{"notes": [{"id": "BygSP6Vtvr", "original": "SkeJg1svvr", "number": 595, "cdate": 1569439069194, "ddate": null, "tcdate": 1569439069194, "tmdate": 1583912041332, "tddate": null, "forum": "BygSP6Vtvr", "replyto": null, "invitation": "ICLR.cc/2020/Conference/-/Blind_Submission", "content": {"title": "Ensemble Distribution Distillation", "authors": ["Andrey Malinin", "Bruno Mlodozeniec", "Mark Gales"], "authorids": ["am969@yandex-team.ru", "bkm28@cam.ac.uk", "mjfg@eng.cam.ac.uk"], "keywords": ["Ensemble Distillation", "Knowledge Distillation", "Uncertainty Estimation", "Density Estimation"], "TL;DR": "We distill an ensemble of models into a single model, capturing both the improved classification performance and information about the diversity of the ensemble, which is useful for uncertainty estimation.", "abstract": "Ensembles of models often yield improvements in system performance. These ensemble approaches have also been empirically shown to yield robust measures of uncertainty, and are capable of distinguishing between different forms of uncertainty. However, ensembles come at a computational and memory cost which may be prohibitive for many applications. There has been significant work done on the distillation of an ensemble into a single model. Such approaches decrease computational cost and allow a single model to achieve an accuracy comparable to that of an ensemble. However, information about the diversity of the ensemble, which can yield estimates of different forms of uncertainty, is lost. This work considers the novel task of Ensemble Distribution Distillation (EnD^2) - distilling the distribution of the predictions from an ensemble, rather than just the average prediction, into a single model. EnD^2 enables a single model to retain both the improved classification performance of ensemble distillation as well as information about the diversity of the ensemble, which is useful for uncertainty estimation. A solution for EnD^2 based on Prior Networks, a class of models which allow a single neural network to explicitly model a distribution over output distributions, is proposed in this work. The properties of EnD^2 are investigated on both an artificial dataset, and on the CIFAR-10, CIFAR-100 and TinyImageNet datasets, where it is shown that EnD^2 can approach the classification performance of an ensemble, and outperforms both standard DNNs and Ensemble Distillation on the tasks of misclassification and out-of-distribution input detection.", "pdf": "/pdf/b89ef269141324b94996984453d8c77e2a828d57.pdf", "paperhash": "malinin|ensemble_distribution_distillation", "_bibtex": "@inproceedings{\nMalinin2020Ensemble,\ntitle={Ensemble Distribution Distillation},\nauthor={Andrey Malinin and Bruno Mlodozeniec and Mark Gales},\nbooktitle={International Conference on Learning Representations},\nyear={2020},\nurl={https://openreview.net/forum?id=BygSP6Vtvr}\n}", "full_presentation_video": "", "original_pdf": "/attachment/79a469d47433204bfdd0ea80b025de9f9acddec3.pdf", "appendix": "", "poster": "", "spotlight_video": "", "slides": ""}, "signatures": ["ICLR.cc/2020/Conference"], "readers": ["everyone"], "nonreaders": [], "writers": ["ICLR.cc/2020/Conference"], "details": {"replyCount": 9, "writable": false, "overwriting": [], "revisions": true, "tags": [], "invitation": {"reply": {"readers": {"values-regex": ".*"}, "writers": {"values": ["ICLR.cc/2020/Conference"]}, "signatures": {"values": ["ICLR.cc/2020/Conference"]}, "content": {"spotlight_video": {"value-regex": ".*"}, "full_presentation_video": {"value-regex": ".*"}, "original_pdf": {"required": false, "description": "Upload a PDF file that ends with .pdf", "value-regex": ".*"}, "appendix": {"value-regex": ".*"}, "authorids": {"values-regex": ".*"}, "poster": {"value-regex": ".*"}, "authors": {"values": ["Anonymous"]}, "slides": {"value-regex": ".*"}}}, "final": [], "signatures": ["ICLR.cc/2020/Conference"], "readers": ["everyone"], "nonreaders": [], "writers": ["ICLR.cc/2020/Conference"], "invitees": ["ICLR.cc/2020/Conference"], "noninvitees": [], "tcdate": 1569271260237, "tmdate": 1593459412141, "id": "ICLR.cc/2020/Conference/-/Blind_Submission"}}, "tauthor": "ICLR.cc/2020/Conference"}, {"id": "36PJm4Zrz9", "original": null, "number": 1, "cdate": 1576798700796, "ddate": null, "tcdate": 1576798700796, "tmdate": 1576800935160, "tddate": null, "forum": "BygSP6Vtvr", "replyto": "BygSP6Vtvr", "invitation": "ICLR.cc/2020/Conference/Paper595/-/Decision", "content": {"decision": "Accept (Poster)", "comment": "The paper investigates how to distill an ensemble effectively (using a prior network) in order to reap the benefits of uncertainty estimation provided by ensembling (in addition to the accuracy gains provided by ensembling). \n\nOverall, the paper is nicely written, and makes a valuable contribution. The authors also addressed most of the initial concerns raised by the reviewers. I recommend the paper for acceptance, and encourage the authors to take into account the reviewer feedback when preparing the final version.", "title": "Paper Decision"}, "signatures": ["ICLR.cc/2020/Conference/Program_Chairs"], "readers": ["everyone"], "nonreaders": [], "writers": ["ICLR.cc/2020/Conference/Program_Chairs"], "details": {"replyCount": 0, "writable": false, "overwriting": [], "revisions": false, "forumContent": {"title": "Ensemble Distribution Distillation", "authors": ["Andrey Malinin", "Bruno Mlodozeniec", "Mark Gales"], "authorids": ["am969@yandex-team.ru", "bkm28@cam.ac.uk", "mjfg@eng.cam.ac.uk"], "keywords": ["Ensemble Distillation", "Knowledge Distillation", "Uncertainty Estimation", "Density Estimation"], "TL;DR": "We distill an ensemble of models into a single model, capturing both the improved classification performance and information about the diversity of the ensemble, which is useful for uncertainty estimation.", "abstract": "Ensembles of models often yield improvements in system performance. These ensemble approaches have also been empirically shown to yield robust measures of uncertainty, and are capable of distinguishing between different forms of uncertainty. However, ensembles come at a computational and memory cost which may be prohibitive for many applications. There has been significant work done on the distillation of an ensemble into a single model. Such approaches decrease computational cost and allow a single model to achieve an accuracy comparable to that of an ensemble. However, information about the diversity of the ensemble, which can yield estimates of different forms of uncertainty, is lost. This work considers the novel task of Ensemble Distribution Distillation (EnD^2) - distilling the distribution of the predictions from an ensemble, rather than just the average prediction, into a single model. EnD^2 enables a single model to retain both the improved classification performance of ensemble distillation as well as information about the diversity of the ensemble, which is useful for uncertainty estimation. A solution for EnD^2 based on Prior Networks, a class of models which allow a single neural network to explicitly model a distribution over output distributions, is proposed in this work. The properties of EnD^2 are investigated on both an artificial dataset, and on the CIFAR-10, CIFAR-100 and TinyImageNet datasets, where it is shown that EnD^2 can approach the classification performance of an ensemble, and outperforms both standard DNNs and Ensemble Distillation on the tasks of misclassification and out-of-distribution input detection.", "pdf": "/pdf/b89ef269141324b94996984453d8c77e2a828d57.pdf", "paperhash": "malinin|ensemble_distribution_distillation", "_bibtex": "@inproceedings{\nMalinin2020Ensemble,\ntitle={Ensemble Distribution Distillation},\nauthor={Andrey Malinin and Bruno Mlodozeniec and Mark Gales},\nbooktitle={International Conference on Learning Representations},\nyear={2020},\nurl={https://openreview.net/forum?id=BygSP6Vtvr}\n}", "full_presentation_video": "", "original_pdf": "/attachment/79a469d47433204bfdd0ea80b025de9f9acddec3.pdf", "appendix": "", "poster": "", "spotlight_video": "", "slides": ""}, "tags": [], "invitation": {"reply": {"writers": {"description": "How your identity will be displayed.", "values-regex": ["ICLR.cc/2020/Conference/Program_Chairs"]}, "signatures": {"values": ["ICLR.cc/2020/Conference/Program_Chairs"], "description": "How your identity will be displayed."}, "content": {"decision": {"value-radio": ["Accept (Spotlight)", "Accept (Talk)", "Accept (Poster)", "Reject"], "description": "Decision", "required": true, "order": 2}, "title": {"value": "Paper Decision", "required": true, "order": 1}, "comment": {"value-regex": "[\\S\\s]{0,5000}", "description": "", "required": false, "order": 3}}, "forum": "BygSP6Vtvr", "replyto": "BygSP6Vtvr", "readers": {"values": ["everyone"], "description": "Select all user groups that should be able to read this comment."}, "nonreaders": {"values": []}}, "expdate": 1576854540000, "duedate": 1576853940000, "multiReply": false, "readers": ["everyone"], "invitees": ["ICLR.cc/2020/Conference/Program_Chairs"], "tcdate": 1576795707922, "tmdate": 1576800256211, "super": "ICLR.cc/2020/Conference/-/Decision", "signatures": ["ICLR.cc/2020/Conference"], "writers": ["ICLR.cc/2020/Conference"], "id": "ICLR.cc/2020/Conference/Paper595/-/Decision"}}}, {"id": "rygXFaj3tB", "original": null, "number": 2, "cdate": 1571761531129, "ddate": null, "tcdate": 1571761531129, "tmdate": 1574261672311, "tddate": null, "forum": "BygSP6Vtvr", "replyto": "BygSP6Vtvr", "invitation": "ICLR.cc/2020/Conference/Paper595/-/Official_Review", "content": {"experience_assessment": "I have published one or two papers in this area.", "rating": "6: Weak Accept", "review_assessment:_checking_correctness_of_experiments": "I carefully checked the experiments.", "review_assessment:_thoroughness_in_paper_reading": "I read the paper thoroughly.", "title": "Official Blind Review #2", "review": "\n\n========= Post Rebuttal ========= \n\n\nI appreciate the authors' effort in addressing the raised issues. I think the revised paper has higher quality in that the additional ablation studies are very useful to understand the effectiveness of the method and the importance of the hyperparameters. It now also has higher clarity in that the presentation of the work is considerably more detailed in the last revision. The outstanding issue is that the final results are not consistent across datasets, baselines, and metrics which is concerning. But, I think, overall, the paper is pushing on an interesting line of research which is relevant and educational for ICLR audience. Th concerns on consistency and conclusiveness of the results can hopefully be addressed in a journal version of the work as suggested by the authors.\n\n========= Summary ========= \n \nDistilling an ensemble of deep networks into a single student network is a common approach to reduce the inference-time computational complexity. In those cases, the paper poses the question of whether it is useful for the student to capture the diversity of ensemble members’ predictions on top of the mean distribution (as in the standard distillation). \nThe main motivation is that this captured diversity will enable the student network to decompose the total (predictive) uncertainty into data (aleatoric/irreducible) and knowledge (epistemic/model) uncertainty components. \nIn order to distill the diversity, it proposes to use “prior networks [Malinin&Gales 2018]” to output parameters of a  Dirichlet distribution over the simplex of possible predictive categorical distributions.\nIt uses one toy dataset as well as 3 small image classification datasets to compare the performance of the proposed method (EnD^2) with a) standard ensemble distillation (EnD), b) ensemble of deep networks, as well as c) an individual deep network. The performance is measured in terms of classification accuracy, and the quality of the predictive uncertainty for in-distribution (ID) and out-of-distribution (OOD) samples.\nIt shows that for OOD sample detection, the proposed EnD^2 outperforms the standard EnD and bridges the gap to the full ensemble. The classification accuracy and ID uncertainty quality is similar to the standard EnD.\n \n \n========= Strengths and Weaknesses ========= \n \n+ the paper studies the interesting problem of decoupling data/knowledge uncertainty in the commonly-used framework of knowledge distillation. It proposes a simple solution to the problem. So, it is highly relevant for the field.\n+ Results in Table 3 suggest significant improvements over the standard distillation (EnD). \n+ Figure 3 is pedagogical and intuitive for the data vs knowledge uncertainty decomposition and the effectiveness of auxiliary dataset for this toy problem.\n \n(I) General concerns:\n- The technical novelty is limited to the combination of knowledge distillation and prior networks.\n- Two closely-related works are not cited:\n[Li&Hoiem, “Reducing Over-confident Errors outside the Known Distribution” 2019] uses auxiliary dataset for ensemble distillation.\n[Englesson&Azizpour, “Efficient Evaluation-Time Uncertainty Estimation by Improved Distillation”, 2019] addresses the problem of efficient uncertainty estimation using knowledge distillation.\n \n(II) Concerns regarding the experiments\n- As also found curious by the authors, it is concerning that the EnD_Aux results are so low for OOD detection. Both [Li&Hoiem 2019] and [Englesson&Azizpour 2019] suggest that the standard distillation can perform similarly to (or even outperform) the individual model and the ensemble using an auxiliary dataset [Li&Hoiem 2019] or teacher label for augmented samples [Englesson&Azizpour 2019]. It should be mentioned that the OOD dataset setup is different across these works.\n- Why only 100-ensembles are used for the real-world experiments? Does a “successful” training of the prior network require a large number of samples? This would be important since prior ensemble works (e.g. [Lakshminarayanan et al. 2017] ) hardly improve beyond 5-15 networks. Training 100 networks is very costly which would be an important limitation of this work in case it’s necessary. An ablation study on the number of networks in the ensemble is required for investigating this trade-off.\n- Hyperparameter optimization: Appendix A provides the final values for the hyperparameters of each method. However, it is not clear how these were optimized? Was grid search used? What was the range for all the hyperparameters? Is there a validation set or cross validation is used and in each case how is the split done? Is it exactly the same hyper-parameter optimization that is done for EnD and EnD^2? \n \n(III) Missing from experiments\n- The main goal/motivation of the paper is to be able to decompose the total uncertainty when distilling an ensemble into a single model. In that respect, richer and more experiments are required to evaluate this ability. Currently, the experiments are focused on showing that EnD^2 outperforms EnD. The toy dataset, qualitatively, evaluates the decomposition quality with interesting results but is not enough to make conclusions for real-world datasets. For instance, as an additional experiment, plots/statistics can be given on data vs knowledge uncertainty for ID vs OOD samples.\n- Prior network [Malinin&Gales 2018] in its standard form is an important single-network baseline that should be included for both ID and OOD experiments. \n- Temperature scaling is mentioned to be a vital part of the model. As such, it requires a thorough ablation study to see the results with or without it as well as when changing the temperature and the annealing factor. It should be studied from two aspects: accuracy and convergence failure (as mentioned by the paper)\n- P.7: “Prediction Rejection Ratio” (PRR) is a measure proposed in this work but it’s only defined in the appendix. That is the only metric that measures the quality of uncertainty for ID samples (Table 3). As such, I believe it’s important to define PRR in the main paper and also further include more standard metrics such as NLL, AUROC, AUPRcurve in table 3 so that some context is given to the newly-proposed PRR.\n- Along the same line, it seems NLL is consistently and “more significantly” worse for EnD^2 compared to EnD.\n \n(IV) Missing training and implementation details\n- More details should be provided for the training of the student prior network including it’s loss function given a dataset and Dirichlet distribution. This can be obtained from [Malinin&Gales 2018] but it’s important for this work to be self-contained.\n- the loss function in equation 8 has log(p(\\pi|x;\\theta)); is there any numerical issue regarding the Dirichlet distribution and/or the log? If so, how significant and what measures are accordingly taken? Could it be that the temperature scaling is more a way of alleviating these issues as opposed to the shared support of distributions for KL divergence?  \n- the details of the annealing algorithm is entirely missing.\n \n \n========= Final Decision ========= \n \nThe paper addresses a highly relevant problem in a simple (and potentially effective) way. This is great. However, there are several concerns as listed above which altogether makes me lean towards an initial “weak reject” rating. (II) and (III) are more central to this initial rating. I will carefully read the authors rebuttal as well as other reviewers’ comments before I finalize my rating.\n \n \n========= Minor points ========= \n \ngeneral:\n- P.2: “[...] limitation of ensembles is that the computational cost of training and inference [...] One solution is to distill [...]“ -> this only remedies the computational complexity of inference and in fact increases the training time.\n- P.3: [Malinin&Gales 2018] should be cited for equation 4 and the discussion around it.\n- P.5: “Ensemble Distillation (EnD) is able to recover the classification performance [...] with only very minor degradation in performance”. Table 1 does not show any degradation for EnD. It shows some degradation for EnD^2 when 100-ensemble is used.\n- P.7: “Note, that on C100 and TIM, EnD2 yields better classification performance than EnD”: almost all of the classification improvements are well within one-std. In the specific case of C100, it’s a stretch to call it a “better classification performance”.\n- P.7: how many runs are used to obtain the mean and std reported in table 3 and 4.\n- P.7: is the PRR in table 3 calculated using the total or knowledge uncertainty for ensemble and EnD2?\n\nTypo:\n- P.2: “. Consider an ensemble of models {P[…]” --> a closing parenthesis is missing.\n- P.3: “Each of the models P([...]” --> a closing parenthesis is missing.\n- P.3: “ the entropy of the expected and“ -> “the entropy of the expectation”\n- P.4: “=\\hat{p}(x,\\pi)” → “\\sim\\hat{p}(x,\\pi)”\n- P3-4.: hat and star seem to have been arbitrarily used for input x, parameters theta, pi and p with most of them undefined.\n- P.5: script MI is used for mutual information while in P.4 script I is used.\n- P.6: “may require the use additional training” -> use of additional\n- P.6: Results of EnD in table 2 does not match table 1.\n \n", "review_assessment:_checking_correctness_of_derivations_and_theory": "I carefully checked the derivations and theory."}, "signatures": ["ICLR.cc/2020/Conference/Paper595/AnonReviewer2"], "readers": ["everyone"], "nonreaders": [], "writers": ["ICLR.cc/2020/Conference/Paper595/AnonReviewer2"], "details": {"replyCount": 0, "writable": false, "overwriting": [], "revisions": false, "forumContent": {"title": "Ensemble Distribution Distillation", "authors": ["Andrey Malinin", "Bruno Mlodozeniec", "Mark Gales"], "authorids": ["am969@yandex-team.ru", "bkm28@cam.ac.uk", "mjfg@eng.cam.ac.uk"], "keywords": ["Ensemble Distillation", "Knowledge Distillation", "Uncertainty Estimation", "Density Estimation"], "TL;DR": "We distill an ensemble of models into a single model, capturing both the improved classification performance and information about the diversity of the ensemble, which is useful for uncertainty estimation.", "abstract": "Ensembles of models often yield improvements in system performance. These ensemble approaches have also been empirically shown to yield robust measures of uncertainty, and are capable of distinguishing between different forms of uncertainty. However, ensembles come at a computational and memory cost which may be prohibitive for many applications. There has been significant work done on the distillation of an ensemble into a single model. Such approaches decrease computational cost and allow a single model to achieve an accuracy comparable to that of an ensemble. However, information about the diversity of the ensemble, which can yield estimates of different forms of uncertainty, is lost. This work considers the novel task of Ensemble Distribution Distillation (EnD^2) - distilling the distribution of the predictions from an ensemble, rather than just the average prediction, into a single model. EnD^2 enables a single model to retain both the improved classification performance of ensemble distillation as well as information about the diversity of the ensemble, which is useful for uncertainty estimation. A solution for EnD^2 based on Prior Networks, a class of models which allow a single neural network to explicitly model a distribution over output distributions, is proposed in this work. The properties of EnD^2 are investigated on both an artificial dataset, and on the CIFAR-10, CIFAR-100 and TinyImageNet datasets, where it is shown that EnD^2 can approach the classification performance of an ensemble, and outperforms both standard DNNs and Ensemble Distillation on the tasks of misclassification and out-of-distribution input detection.", "pdf": "/pdf/b89ef269141324b94996984453d8c77e2a828d57.pdf", "paperhash": "malinin|ensemble_distribution_distillation", "_bibtex": "@inproceedings{\nMalinin2020Ensemble,\ntitle={Ensemble Distribution Distillation},\nauthor={Andrey Malinin and Bruno Mlodozeniec and Mark Gales},\nbooktitle={International Conference on Learning Representations},\nyear={2020},\nurl={https://openreview.net/forum?id=BygSP6Vtvr}\n}", "full_presentation_video": "", "original_pdf": "/attachment/79a469d47433204bfdd0ea80b025de9f9acddec3.pdf", "appendix": "", "poster": "", "spotlight_video": "", "slides": ""}, "tags": [], "invitation": {"reply": {"content": {"experience_assessment": {"required": true, "order": 4, "description": "Please make a selection that represents your experience correctly", "value-radio": ["I have published in this field for several years.", "I have published one or two papers in this area.", "I have read many papers in this area.", "I do not know much about this area."]}, "rating": {"value-dropdown": ["1: Reject", "3: Weak Reject", "6: Weak Accept", "8: Accept"], "order": 3, "required": true}, "review_assessment:_checking_correctness_of_experiments": {"required": true, "order": 7, "description": "If no experiments, please select N/A", "value-radio": ["I carefully checked the experiments.", "I assessed the sensibility of the experiments.", "I did not assess the experiments.", "N/A"]}, "review_assessment:_thoroughness_in_paper_reading": {"required": true, "order": 5, "description": "If this is not applicable, please select N/A", "value-radio": ["I read the paper thoroughly.", "I read the paper at least twice and used my best judgement in assessing the paper.", "I made a quick assessment of this paper.", "N/A"]}, "title": {"value-regex": "Official Blind Review #[0-9]+", "order": 1, "required": true, "description": "Please replace NUM with your AnonReviewer number (it is the number following \"AnonReviewer\" in your signatures below)", "default": "Official Blind Review #NUM"}, "review": {"value-regex": "[\\S\\s]{500,200000}", "order": 2, "description": "Provide your complete review here (500 - 200000 characters). For guidance in writing a good review, see this brief reviewer guide (https://iclr.cc/Conferences/2020/ReviewerGuide) with three key bullet points.", "required": true}, "review_assessment:_checking_correctness_of_derivations_and_theory": {"required": true, "order": 6, "description": "If no derivations or theory, please select N/A", "value-radio": ["I carefully checked the derivations and theory.", "I assessed the sensibility of the derivations and theory.", "I did not assess the derivations or theory.", "N/A"]}}, "forum": "BygSP6Vtvr", "replyto": "BygSP6Vtvr", "readers": {"values": ["everyone"], "description": "Select all user groups that should be able to read this comment."}, "nonreaders": {"values": []}, "writers": {"values-regex": "ICLR.cc/2020/Conference/Paper595/AnonReviewer[0-9]+", "description": "How your identity will be displayed."}, "signatures": {"values-regex": "ICLR.cc/2020/Conference/Paper595/AnonReviewer[0-9]+", "description": "How your identity will be displayed."}}, "expdate": 1576060297178, "duedate": 1572706740000, "multiReply": false, "readers": ["everyone"], "nonreaders": [], "invitees": ["ICLR.cc/2020/Conference/Paper595/Reviewers"], "noninvitees": [], "tcdate": 1570237749869, "tmdate": 1576060297191, "super": "ICLR.cc/2020/Conference/-/Official_Review", "signatures": ["ICLR.cc/2020/Conference"], "writers": ["ICLR.cc/2020/Conference"], "id": "ICLR.cc/2020/Conference/Paper595/-/Official_Review"}}}, {"id": "H1lCf2NFor", "original": null, "number": 1, "cdate": 1573633045888, "ddate": null, "tcdate": 1573633045888, "tmdate": 1573827970315, "tddate": null, "forum": "BygSP6Vtvr", "replyto": "BygSP6Vtvr", "invitation": "ICLR.cc/2020/Conference/Paper595/-/Official_Comment", "content": {"title": "GENERAL RESPONSE TO REVIEWERS", "comment": "Dear Reviewers!\n\nWe thank you for putting in the time and effort to produce such detailed reviews! We have taken on board your comments, fixed most of the minor errors which you have pointed out, added suggested references and put them in context, clarified certain points and have implemented some of the structural changes which you recommend (though we have now gone over the 8 page suggested limit). A new version of the paper reflecting these changes has been uploaded. The additional experiments suggested by you are under way now. We have added partial results, though we may not be able to complete all the extra experiments within the time-frame of this rebuttal period (but definitely within the next two weeks). We provide a more detailed response to each of you as a comment to each review. \n\nWe will inform of any further update to the paper in this comment.\n\nUPDATE:  1. We have added histograms of uncertainty for standard ensemble distillation in the appendix. \n                  2. As per reviewer II suggestion, we have also provided AUPR numbers for all models in the appendix. However, they mainly illustrate the AUPR is difficult to use to assess misclassification detection performance.\n                  3. We have found a small bug in table 4 - results for EnD and EnD_AUX were carried over from an older table and incorrect. We have updated these numbers to the appropriate model. These results now tie up far better with the new histograms in the appendix and with the paper pointed out to us by reviewer II.\n\nUPDATE II: We have now added the studies of the effects and temperature and number of models in an additional appendix which were requested by reviewer II. In short, the results show that temperature annealing is important, and using an initial temperature of at least 5 is necessary for good ensemble distribution distillation, while a temperature of 10 increases the consistency of the result. Secondly, the results show that using ensemble of 5 models does not allow the ensemble distribution distillation to estimate knowledge uncertainty well, and that using ensembles of 20 models does better. However, not further significant improvements from using more than 20 models are not observed. Overall, this is good, as it suggests that it is possible to do EnDD without having to expensively train a vast ensemble of models. "}, "signatures": ["ICLR.cc/2020/Conference/Paper595/Authors"], "readers": ["everyone"], "nonreaders": [], "writers": ["ICLR.cc/2020/Conference/Paper595/Authors", "ICLR.cc/2020/Conference"], "details": {"replyCount": 0, "writable": false, "overwriting": [], "revisions": false, "forumContent": {"title": "Ensemble Distribution Distillation", "authors": ["Andrey Malinin", "Bruno Mlodozeniec", "Mark Gales"], "authorids": ["am969@yandex-team.ru", "bkm28@cam.ac.uk", "mjfg@eng.cam.ac.uk"], "keywords": ["Ensemble Distillation", "Knowledge Distillation", "Uncertainty Estimation", "Density Estimation"], "TL;DR": "We distill an ensemble of models into a single model, capturing both the improved classification performance and information about the diversity of the ensemble, which is useful for uncertainty estimation.", "abstract": "Ensembles of models often yield improvements in system performance. These ensemble approaches have also been empirically shown to yield robust measures of uncertainty, and are capable of distinguishing between different forms of uncertainty. However, ensembles come at a computational and memory cost which may be prohibitive for many applications. There has been significant work done on the distillation of an ensemble into a single model. Such approaches decrease computational cost and allow a single model to achieve an accuracy comparable to that of an ensemble. However, information about the diversity of the ensemble, which can yield estimates of different forms of uncertainty, is lost. This work considers the novel task of Ensemble Distribution Distillation (EnD^2) - distilling the distribution of the predictions from an ensemble, rather than just the average prediction, into a single model. EnD^2 enables a single model to retain both the improved classification performance of ensemble distillation as well as information about the diversity of the ensemble, which is useful for uncertainty estimation. A solution for EnD^2 based on Prior Networks, a class of models which allow a single neural network to explicitly model a distribution over output distributions, is proposed in this work. The properties of EnD^2 are investigated on both an artificial dataset, and on the CIFAR-10, CIFAR-100 and TinyImageNet datasets, where it is shown that EnD^2 can approach the classification performance of an ensemble, and outperforms both standard DNNs and Ensemble Distillation on the tasks of misclassification and out-of-distribution input detection.", "pdf": "/pdf/b89ef269141324b94996984453d8c77e2a828d57.pdf", "paperhash": "malinin|ensemble_distribution_distillation", "_bibtex": "@inproceedings{\nMalinin2020Ensemble,\ntitle={Ensemble Distribution Distillation},\nauthor={Andrey Malinin and Bruno Mlodozeniec and Mark Gales},\nbooktitle={International Conference on Learning Representations},\nyear={2020},\nurl={https://openreview.net/forum?id=BygSP6Vtvr}\n}", "full_presentation_video": "", "original_pdf": "/attachment/79a469d47433204bfdd0ea80b025de9f9acddec3.pdf", "appendix": "", "poster": "", "spotlight_video": "", "slides": ""}, "tags": [], "invitation": {"reply": {"content": {"title": {"required": true, "description": "Brief summary of your comment.", "order": 0, "value-regex": ".{1,500}"}, "comment": {"required": true, "description": "Your comment or reply (max 5000 characters). Add TeX formulas using the following formats: $In-line Formula$ or $$Block Formula$$", "order": 1, "value-regex": "[\\S\\s]{1,5000}"}}, "forum": "BygSP6Vtvr", "readers": {"values-dropdown": ["everyone", "ICLR.cc/2020/Conference/Paper595/Authors", "ICLR.cc/2020/Conference/Paper595/AnonReviewer.*", "ICLR.cc/2020/Conference/Paper595/Reviewers/Submitted", "ICLR.cc/2020/Conference/Paper595/Reviewers", "ICLR.cc/2020/Conference/Paper595/Area_Chairs", "ICLR.cc/2020/Conference/Program_Chairs"], "description": "Who your comment will be visible to. If replying to a specific person make sure to add the group they are a member of so that they are able to see your response"}, "writers": {"values-copied": ["ICLR.cc/2020/Conference", "{signatures}"]}, "signatures": {"description": "How your identity will be displayed.", "values-regex": "ICLR.cc/2020/Conference/Paper595/AnonReviewer[0-9]+|ICLR.cc/2020/Conference/Paper595/Authors|ICLR.cc/2020/Conference/Paper595/Area_Chair[0-9]+|ICLR.cc/2020/Conference/Program_Chairs"}}, "readers": ["everyone"], "tcdate": 1569504169103, "tmdate": 1576860561388, "super": "ICLR.cc/2020/Conference/-/Comment", "signatures": ["ICLR.cc/2020/Conference"], "writers": ["ICLR.cc/2020/Conference"], "invitees": ["ICLR.cc/2020/Conference/Paper595/Authors", "ICLR.cc/2020/Conference/Paper595/Reviewers", "ICLR.cc/2020/Conference/Paper595/Area_Chairs", "ICLR.cc/2020/Conference/Program_Chairs"], "id": "ICLR.cc/2020/Conference/Paper595/-/Official_Comment"}}}, {"id": "r1xzMickcB", "original": null, "number": 3, "cdate": 1571953417773, "ddate": null, "tcdate": 1571953417773, "tmdate": 1573777615430, "tddate": null, "forum": "BygSP6Vtvr", "replyto": "BygSP6Vtvr", "invitation": "ICLR.cc/2020/Conference/Paper595/-/Official_Review", "content": {"experience_assessment": "I do not know much about this area.", "rating": "6: Weak Accept", "review_assessment:_checking_correctness_of_experiments": "I carefully checked the experiments.", "review_assessment:_thoroughness_in_paper_reading": "I read the paper thoroughly.", "title": "Official Blind Review #3", "review": "This paper notes that ensemble distillation (EnD) loses the distributional information from the original ensemble, which prevents users of the distilled model from being able to obtain estimates of its knowledge uncertainty. It proposes the challenge of distilling the ensemble in a way that preserves information about the ensemble distribution, so that knowledge uncertainty can still be extracted from the distilled model. It names this task \"Ensemble Distribution Distillation (EnD^2)\". It then proposes using Prior Networks (introduced in Malinin & Gales 2018) as a solution, and proceeds to evaluate it with a series of experiments -- first obtaining some intuition from spiral dataset, then more rigorously on benchmark image datasets (CIFAR10/100/TinyImageNet).\n\nFirst, it trains ensembles of 10 and 100 NNs on a spiral dataset, distills them using the regular approach (EnD) and Prior Networks (EnD^2), compares their performance, and notes that the Prior Networks approach has comparable performance. Next, it visualizes over the input space of the spiral dataset the total uncertainty, data uncertainty, and knowledge uncertainty estimates, which are extracted directly from the original ensemble and from the EnD^2 distilled model (Figure 3). It notes that while the original ensemble is able to correctly estimate the knowledge uncertainty in regions that are far away from the training distribution, the EnD^2 model fails at this task (Figure 3f). It then proposes to augment the training set with out-of-distribution data, and demonstrates that this improves the estimation of knowledge uncertainty (Figure 3i). It also proposes a new metric for evaluating the Prediction Rejection Ratio (PRR), uses it to compare how the EnD^2 model compares to the original ensemble and the EnD model. Finally, it demonstrates using a series of benchmark image classification tasks that the EnD^2 model is able to identify out-of-distribution samples with comparable performance to the original ensemble.\n\nDecision: Leaning-to-Accept. Distillation is a well-established technique, and adapting it so that the same NN can perform both predictions and knowledge uncertainty estimates is impactful. This work proposes using Prior Networks as a way to distill ensembles of NNs in a way that preserves the knowledge uncertainty estimates, and evaluated this claim with a sequence of experiments. This work also proposes a new evaluation metric (Prediction Rejection Ratio), and can be used to evaluate future models that are able to simultaneously perform prediction and knowledge uncertainty estimation. However, the way that the paper is organized around the proposal of \"Ensemble Distribution Distillation\" as a novel machine learning task does not seem very well motivated, as the distribution was solely used to provide uncertainty estimates.\n\nStrengths:\n- The visualizations in Figure 3 helped to provide intuition to the reader.\n- Experiments have a clear logical flow. Spiral experiments provide intuition, motivate out-of-distribution data augmentation, then image data experiments provide evidence for the applicability of the method. \n- Motivates and explains the newly proposed evaluation metric (prediction rejection ratio) in the appendix.\n- The out-of-distribution detection experiments are quite comprehensive.\n- The training procedures are clearly detailed in the appendix.\n- Investigates the appropriateness of the Dirichlet distribution in the appendix.\n\nWeaknesses:\n- The proposal of the novel machine learning task of \"Ensemble Distribution Distillation\" does not seem very well motivated. In this paper, the distribution distillation was solely used to obtain a knowledge uncertainty estimation. Besides that, what else would the distribution be used for? It was also initially unclear to me what this paper contributes on top of \"Predictive Uncertainty Estimation via Prior Networks (Malinin & Gales, 2018)\". A suggestion is to rewrite the summary of contributions to emphasize that the use of Prior Networks to produce a single model that can both perform predictions and provide uncertainty estimates as an extension of ensemble distillation is novel, and that a more comprehensive set of experiments on more difficult image datasets were done in this paper.\n\nMinor comments:\n- page 2, expression right before equation 2, and in the first sentence on page 3 is missing closing parentheses.\n- page 3, figure 1. It wasn't initially obvious to me that the triangle represents the simplex of the softmax output, and each black dot represents the output of one model of the ensemble.\n- page 4, equation 9. Add some space to the right of the equality sign.\n- Use backticks`   instead of single quotation mark ' to open quotation marks in LaTeX.\n\n\nRebuttal response:\nI acknowledge the authors' point about the importance of EnDD in addition to knowledge uncertainty estimation, and maintain my rating.", "review_assessment:_checking_correctness_of_derivations_and_theory": "I did not assess the derivations or theory."}, "signatures": ["ICLR.cc/2020/Conference/Paper595/AnonReviewer3"], "readers": ["everyone"], "nonreaders": [], "writers": ["ICLR.cc/2020/Conference/Paper595/AnonReviewer3"], "details": {"replyCount": 0, "writable": false, "overwriting": [], "revisions": false, "forumContent": {"title": "Ensemble Distribution Distillation", "authors": ["Andrey Malinin", "Bruno Mlodozeniec", "Mark Gales"], "authorids": ["am969@yandex-team.ru", "bkm28@cam.ac.uk", "mjfg@eng.cam.ac.uk"], "keywords": ["Ensemble Distillation", "Knowledge Distillation", "Uncertainty Estimation", "Density Estimation"], "TL;DR": "We distill an ensemble of models into a single model, capturing both the improved classification performance and information about the diversity of the ensemble, which is useful for uncertainty estimation.", "abstract": "Ensembles of models often yield improvements in system performance. These ensemble approaches have also been empirically shown to yield robust measures of uncertainty, and are capable of distinguishing between different forms of uncertainty. However, ensembles come at a computational and memory cost which may be prohibitive for many applications. There has been significant work done on the distillation of an ensemble into a single model. Such approaches decrease computational cost and allow a single model to achieve an accuracy comparable to that of an ensemble. However, information about the diversity of the ensemble, which can yield estimates of different forms of uncertainty, is lost. This work considers the novel task of Ensemble Distribution Distillation (EnD^2) - distilling the distribution of the predictions from an ensemble, rather than just the average prediction, into a single model. EnD^2 enables a single model to retain both the improved classification performance of ensemble distillation as well as information about the diversity of the ensemble, which is useful for uncertainty estimation. A solution for EnD^2 based on Prior Networks, a class of models which allow a single neural network to explicitly model a distribution over output distributions, is proposed in this work. The properties of EnD^2 are investigated on both an artificial dataset, and on the CIFAR-10, CIFAR-100 and TinyImageNet datasets, where it is shown that EnD^2 can approach the classification performance of an ensemble, and outperforms both standard DNNs and Ensemble Distillation on the tasks of misclassification and out-of-distribution input detection.", "pdf": "/pdf/b89ef269141324b94996984453d8c77e2a828d57.pdf", "paperhash": "malinin|ensemble_distribution_distillation", "_bibtex": "@inproceedings{\nMalinin2020Ensemble,\ntitle={Ensemble Distribution Distillation},\nauthor={Andrey Malinin and Bruno Mlodozeniec and Mark Gales},\nbooktitle={International Conference on Learning Representations},\nyear={2020},\nurl={https://openreview.net/forum?id=BygSP6Vtvr}\n}", "full_presentation_video": "", "original_pdf": "/attachment/79a469d47433204bfdd0ea80b025de9f9acddec3.pdf", "appendix": "", "poster": "", "spotlight_video": "", "slides": ""}, "tags": [], "invitation": {"reply": {"content": {"experience_assessment": {"required": true, "order": 4, "description": "Please make a selection that represents your experience correctly", "value-radio": ["I have published in this field for several years.", "I have published one or two papers in this area.", "I have read many papers in this area.", "I do not know much about this area."]}, "rating": {"value-dropdown": ["1: Reject", "3: Weak Reject", "6: Weak Accept", "8: Accept"], "order": 3, "required": true}, "review_assessment:_checking_correctness_of_experiments": {"required": true, "order": 7, "description": "If no experiments, please select N/A", "value-radio": ["I carefully checked the experiments.", "I assessed the sensibility of the experiments.", "I did not assess the experiments.", "N/A"]}, "review_assessment:_thoroughness_in_paper_reading": {"required": true, "order": 5, "description": "If this is not applicable, please select N/A", "value-radio": ["I read the paper thoroughly.", "I read the paper at least twice and used my best judgement in assessing the paper.", "I made a quick assessment of this paper.", "N/A"]}, "title": {"value-regex": "Official Blind Review #[0-9]+", "order": 1, "required": true, "description": "Please replace NUM with your AnonReviewer number (it is the number following \"AnonReviewer\" in your signatures below)", "default": "Official Blind Review #NUM"}, "review": {"value-regex": "[\\S\\s]{500,200000}", "order": 2, "description": "Provide your complete review here (500 - 200000 characters). For guidance in writing a good review, see this brief reviewer guide (https://iclr.cc/Conferences/2020/ReviewerGuide) with three key bullet points.", "required": true}, "review_assessment:_checking_correctness_of_derivations_and_theory": {"required": true, "order": 6, "description": "If no derivations or theory, please select N/A", "value-radio": ["I carefully checked the derivations and theory.", "I assessed the sensibility of the derivations and theory.", "I did not assess the derivations or theory.", "N/A"]}}, "forum": "BygSP6Vtvr", "replyto": "BygSP6Vtvr", "readers": {"values": ["everyone"], "description": "Select all user groups that should be able to read this comment."}, "nonreaders": {"values": []}, "writers": {"values-regex": "ICLR.cc/2020/Conference/Paper595/AnonReviewer[0-9]+", "description": "How your identity will be displayed."}, "signatures": {"values-regex": "ICLR.cc/2020/Conference/Paper595/AnonReviewer[0-9]+", "description": "How your identity will be displayed."}}, "expdate": 1576060297178, "duedate": 1572706740000, "multiReply": false, "readers": ["everyone"], "nonreaders": [], "invitees": ["ICLR.cc/2020/Conference/Paper595/Reviewers"], "noninvitees": [], "tcdate": 1570237749869, "tmdate": 1576060297191, "super": "ICLR.cc/2020/Conference/-/Official_Review", "signatures": ["ICLR.cc/2020/Conference"], "writers": ["ICLR.cc/2020/Conference"], "id": "ICLR.cc/2020/Conference/Paper595/-/Official_Review"}}}, {"id": "r1goHTNYjH", "original": null, "number": 2, "cdate": 1573633346667, "ddate": null, "tcdate": 1573633346667, "tmdate": 1573638348982, "tddate": null, "forum": "BygSP6Vtvr", "replyto": "BkxPqUmUtH", "invitation": "ICLR.cc/2020/Conference/Paper595/-/Official_Comment", "content": {"title": "RESPONSE TO REVIEWER I", "comment": "Dear Reviewer I,\n\nWhile in this paper we deal with EnDD for classification tasks, it is straightforward to adapt to regression tasks by considering a model which parameterises the Normal-inverse-Wishart (or a mixture of) distribution. Such models are described in [PhD Thesis, Malinin 2019] . This is now mentioned in the current version of the paper. Your suggestion to do EnDD with a hyper-network is interesting, as it might allow extracting measures of uncertainty based on distributions over model parameters, for example, which may provide additional insights. This could be an interesting direction for future work. :)\n\nYou are completely correct - we could parameterize a Mixture of Dirichlet Distributions and it would still be possible to obtain closed-form expressions for the loss function and all measures of uncertainty (eq. 9 and 10). We were initially planning to do this in a journal paper follow up, as it would be of minor novelty for a follow-up ICML/NeurIPS/ICLR submission).\n\nRegarding the advantage of knowledge uncertainty over total uncertainty - this is a property of the source ensemble and the in-domain dataset, rather than Ensemble Distribution Distillation. Regarding the ensemble - it is possible that if we consider different architectures, training regimes and ensembling techniques (SWA-gaussian, checkpoint ensembles, etc...) then we may achieve better measures of knowledge uncertainty. Regarding the dataset - if the in-domain dataset contains a small amount of data uncertainty, then OOD detection performance using total uncertainty and knowledge uncertainty should be almost the same. The image datasets considered in this work do have a low degree of data uncertainty (unlike the toy dataset, where significant data uncertainty was added). Hence, as seen in the table, total uncertainty and knowledge uncertainty measures often give very similar performance. It is important to note that on more challenging tasks, which naturally exhibit a higher level of data uncertainty, we would expect that the decomposition would be more beneficial. This has now been addressed in the paper. \n\nWe will make the references more consistent and do additional tidying of the paper shortly.\n\n[PhD Thesis, Malinin 2019] \"Uncertainty Estimation in Deep Learning with application to Spoken Language Assessment\". University of Cambridge"}, "signatures": ["ICLR.cc/2020/Conference/Paper595/Authors"], "readers": ["everyone"], "nonreaders": [], "writers": ["ICLR.cc/2020/Conference/Paper595/Authors", "ICLR.cc/2020/Conference"], "details": {"replyCount": 0, "writable": false, "overwriting": [], "revisions": false, "forumContent": {"title": "Ensemble Distribution Distillation", "authors": ["Andrey Malinin", "Bruno Mlodozeniec", "Mark Gales"], "authorids": ["am969@yandex-team.ru", "bkm28@cam.ac.uk", "mjfg@eng.cam.ac.uk"], "keywords": ["Ensemble Distillation", "Knowledge Distillation", "Uncertainty Estimation", "Density Estimation"], "TL;DR": "We distill an ensemble of models into a single model, capturing both the improved classification performance and information about the diversity of the ensemble, which is useful for uncertainty estimation.", "abstract": "Ensembles of models often yield improvements in system performance. These ensemble approaches have also been empirically shown to yield robust measures of uncertainty, and are capable of distinguishing between different forms of uncertainty. However, ensembles come at a computational and memory cost which may be prohibitive for many applications. There has been significant work done on the distillation of an ensemble into a single model. Such approaches decrease computational cost and allow a single model to achieve an accuracy comparable to that of an ensemble. However, information about the diversity of the ensemble, which can yield estimates of different forms of uncertainty, is lost. This work considers the novel task of Ensemble Distribution Distillation (EnD^2) - distilling the distribution of the predictions from an ensemble, rather than just the average prediction, into a single model. EnD^2 enables a single model to retain both the improved classification performance of ensemble distillation as well as information about the diversity of the ensemble, which is useful for uncertainty estimation. A solution for EnD^2 based on Prior Networks, a class of models which allow a single neural network to explicitly model a distribution over output distributions, is proposed in this work. The properties of EnD^2 are investigated on both an artificial dataset, and on the CIFAR-10, CIFAR-100 and TinyImageNet datasets, where it is shown that EnD^2 can approach the classification performance of an ensemble, and outperforms both standard DNNs and Ensemble Distillation on the tasks of misclassification and out-of-distribution input detection.", "pdf": "/pdf/b89ef269141324b94996984453d8c77e2a828d57.pdf", "paperhash": "malinin|ensemble_distribution_distillation", "_bibtex": "@inproceedings{\nMalinin2020Ensemble,\ntitle={Ensemble Distribution Distillation},\nauthor={Andrey Malinin and Bruno Mlodozeniec and Mark Gales},\nbooktitle={International Conference on Learning Representations},\nyear={2020},\nurl={https://openreview.net/forum?id=BygSP6Vtvr}\n}", "full_presentation_video": "", "original_pdf": "/attachment/79a469d47433204bfdd0ea80b025de9f9acddec3.pdf", "appendix": "", "poster": "", "spotlight_video": "", "slides": ""}, "tags": [], "invitation": {"reply": {"content": {"title": {"required": true, "description": "Brief summary of your comment.", "order": 0, "value-regex": ".{1,500}"}, "comment": {"required": true, "description": "Your comment or reply (max 5000 characters). Add TeX formulas using the following formats: $In-line Formula$ or $$Block Formula$$", "order": 1, "value-regex": "[\\S\\s]{1,5000}"}}, "forum": "BygSP6Vtvr", "readers": {"values-dropdown": ["everyone", "ICLR.cc/2020/Conference/Paper595/Authors", "ICLR.cc/2020/Conference/Paper595/AnonReviewer.*", "ICLR.cc/2020/Conference/Paper595/Reviewers/Submitted", "ICLR.cc/2020/Conference/Paper595/Reviewers", "ICLR.cc/2020/Conference/Paper595/Area_Chairs", "ICLR.cc/2020/Conference/Program_Chairs"], "description": "Who your comment will be visible to. If replying to a specific person make sure to add the group they are a member of so that they are able to see your response"}, "writers": {"values-copied": ["ICLR.cc/2020/Conference", "{signatures}"]}, "signatures": {"description": "How your identity will be displayed.", "values-regex": "ICLR.cc/2020/Conference/Paper595/AnonReviewer[0-9]+|ICLR.cc/2020/Conference/Paper595/Authors|ICLR.cc/2020/Conference/Paper595/Area_Chair[0-9]+|ICLR.cc/2020/Conference/Program_Chairs"}}, "readers": ["everyone"], "tcdate": 1569504169103, "tmdate": 1576860561388, "super": "ICLR.cc/2020/Conference/-/Comment", "signatures": ["ICLR.cc/2020/Conference"], "writers": ["ICLR.cc/2020/Conference"], "invitees": ["ICLR.cc/2020/Conference/Paper595/Authors", "ICLR.cc/2020/Conference/Paper595/Reviewers", "ICLR.cc/2020/Conference/Paper595/Area_Chairs", "ICLR.cc/2020/Conference/Program_Chairs"], "id": "ICLR.cc/2020/Conference/Paper595/-/Official_Comment"}}}, {"id": "H1l_eIBFoH", "original": null, "number": 4, "cdate": 1573635567685, "ddate": null, "tcdate": 1573635567685, "tmdate": 1573636389560, "tddate": null, "forum": "BygSP6Vtvr", "replyto": "rygXFaj3tB", "invitation": "ICLR.cc/2020/Conference/Paper595/-/Official_Comment", "content": {"title": "RESPONSE TO REVIEWER II - PART I", "comment": "Dear Reviewer II, \n\nWe address each of your comments point-by-point below.\n\n(I) General concerns:\n\nI.a See response to reviewer III\n\nI.b Works now cited. See II.a\n \n(II) Concerns regarding the experiments\nII.a Thank you for pointing out these papers, as they are relevant to our work and we have now cited them. While work by [Li&Hoiem 2019] considers an augmented dataset, their datasets, training regime and model architecture are completely different to the one in our work, so it is hard to make a direct comparison. Work by [Englesson&Azizpour 2019] is closer in terms of datasets, overall setup and evaluation. However, an important difference is that they use the ensemble's predictions on augmented data obtained via rotations and other standard perturbations, while we use the ensemble's predictions on the original data for augmented data (flips,shifts,rotations). What they do is sensible and expected to give gains on top of what we do. The reason we didn't do this is because it would be prohibitive in terms of memory to save the predictions of an ensemble of 100 models for all possible forms of perturbation. We would also like to point out that the assessment of the measures of uncertainty in these two works is more narrow in scope in comparison to ours, and mostly focused on calibration and test-set NLL (which we also provide). Regarding the worse performance of EnD_AUX relative to the ensemble on OOD detection - this may be an effect of the training regime we considered.\n\nII.b We agree that an ablation study would be informative and are currently running it. Results will be updated as soon as it is complete. Should be done in about a day or two. \n \nII.c Hyper-parameters were 'manually' tuned for accuracy on a small held-out set of 1000 samples. Then models were trained on the full training set using the same hyper-parameter settings for several random seeds. In general we explored 'around' the same setup as in (Malinin and Gales 2018, 2019). Unfortunately, when we did this study we only had access to a limited set of GPUs, so a thorough parameter grid-search was infeasible. We agree that in general, a more thorough investigation of this method on different architectures (ResNet, DenseNet, etc...) using different training regimes and on both a bigger image dataset (ImageNet) and a different task (machine translation/NLP/speech recognition) would be informative. However, we leave that to future work. Specifically, we plan to address this in a journal paper follow-up.\n \n(III) Missing from experiments\n\nIII.a Your concern is valid and we agree that it is desirable to assess EnDD on more complex tasks than CIFA10/CIFAR100/TinyImageNet. However, the datasets we use are consistent with those used by other works in this area (Hendrycks and Gimpel 2016, Kimin Lee et all 2018, Malinin and Gales 2018/2019). In future work we plan to assess EnDD on more challenging tasks, such as NMT/ASR, where both the scale and complexity of data is much larger. At the same time, however, we have added histograms of total/data/knowledge uncertainty for ID/OOD inputs to models trained on each dataset (C10/C100/TIM) in the main paper and in appendix in order to analyse the decomposition of uncertainty achievable through EnDD relative to the original ensemble in a little more detail, as well as further analyse the appropriateness of the Dirichlet.\n\n(Lee et all, 2018a) \"Confidence-Calibrated Adversarial Training: Towards Robust Models Generalizing Beyond the Attack Used During Training\"\n(Lee et all, 2018b) \"A Simple Unified Framework for Detecting Out-of-Distribution Samples and Adversarial Attacks\"\n\nIII.b We include result Prior Networks trained in a matching configuration to EnDD for the CIFAR10, CIFAR100 and TinyImageNet datasets. The results show that Prior Networks can achieve comparable (but smaller) improvements in classification performance as EnDD, due to the regularizing effect of using more data. However, both on CIFAR-10 and CIFAR-100 misclassification detection, test-set negative log-likelihood and calibration ECE performance are drastically worse for a Prior Network on in-domain data than for all other models. On CIFAR-10 Prior Networks achieve best OOD detection results, but on CIFAR-100 and TinyImagenet do not (with one exception). It is necessary to point out that while the setup for Prior Networks on CIFAR-10 is both identical to \"Reverse KL-Divergence Training\" (Malinin and Gales 2019) and to the EnDD configuration considered here, the setup for the Prior Network on CIFAR-100 is different. Specifically, we used a matched configuration to EnDD, but this represents a degraded baseline for OOD detection relative to (Malinin and Gales 2019), where the TinyImageNet dataset was used as 'OOD training data'.\n\nIII.c Ablation study is currently underway. We will update the results as soon as it is completed.\n\n"}, "signatures": ["ICLR.cc/2020/Conference/Paper595/Authors"], "readers": ["everyone"], "nonreaders": [], "writers": ["ICLR.cc/2020/Conference/Paper595/Authors", "ICLR.cc/2020/Conference"], "details": {"replyCount": 0, "writable": false, "overwriting": [], "revisions": false, "forumContent": {"title": "Ensemble Distribution Distillation", "authors": ["Andrey Malinin", "Bruno Mlodozeniec", "Mark Gales"], "authorids": ["am969@yandex-team.ru", "bkm28@cam.ac.uk", "mjfg@eng.cam.ac.uk"], "keywords": ["Ensemble Distillation", "Knowledge Distillation", "Uncertainty Estimation", "Density Estimation"], "TL;DR": "We distill an ensemble of models into a single model, capturing both the improved classification performance and information about the diversity of the ensemble, which is useful for uncertainty estimation.", "abstract": "Ensembles of models often yield improvements in system performance. These ensemble approaches have also been empirically shown to yield robust measures of uncertainty, and are capable of distinguishing between different forms of uncertainty. However, ensembles come at a computational and memory cost which may be prohibitive for many applications. There has been significant work done on the distillation of an ensemble into a single model. Such approaches decrease computational cost and allow a single model to achieve an accuracy comparable to that of an ensemble. However, information about the diversity of the ensemble, which can yield estimates of different forms of uncertainty, is lost. This work considers the novel task of Ensemble Distribution Distillation (EnD^2) - distilling the distribution of the predictions from an ensemble, rather than just the average prediction, into a single model. EnD^2 enables a single model to retain both the improved classification performance of ensemble distillation as well as information about the diversity of the ensemble, which is useful for uncertainty estimation. A solution for EnD^2 based on Prior Networks, a class of models which allow a single neural network to explicitly model a distribution over output distributions, is proposed in this work. The properties of EnD^2 are investigated on both an artificial dataset, and on the CIFAR-10, CIFAR-100 and TinyImageNet datasets, where it is shown that EnD^2 can approach the classification performance of an ensemble, and outperforms both standard DNNs and Ensemble Distillation on the tasks of misclassification and out-of-distribution input detection.", "pdf": "/pdf/b89ef269141324b94996984453d8c77e2a828d57.pdf", "paperhash": "malinin|ensemble_distribution_distillation", "_bibtex": "@inproceedings{\nMalinin2020Ensemble,\ntitle={Ensemble Distribution Distillation},\nauthor={Andrey Malinin and Bruno Mlodozeniec and Mark Gales},\nbooktitle={International Conference on Learning Representations},\nyear={2020},\nurl={https://openreview.net/forum?id=BygSP6Vtvr}\n}", "full_presentation_video": "", "original_pdf": "/attachment/79a469d47433204bfdd0ea80b025de9f9acddec3.pdf", "appendix": "", "poster": "", "spotlight_video": "", "slides": ""}, "tags": [], "invitation": {"reply": {"content": {"title": {"required": true, "description": "Brief summary of your comment.", "order": 0, "value-regex": ".{1,500}"}, "comment": {"required": true, "description": "Your comment or reply (max 5000 characters). Add TeX formulas using the following formats: $In-line Formula$ or $$Block Formula$$", "order": 1, "value-regex": "[\\S\\s]{1,5000}"}}, "forum": "BygSP6Vtvr", "readers": {"values-dropdown": ["everyone", "ICLR.cc/2020/Conference/Paper595/Authors", "ICLR.cc/2020/Conference/Paper595/AnonReviewer.*", "ICLR.cc/2020/Conference/Paper595/Reviewers/Submitted", "ICLR.cc/2020/Conference/Paper595/Reviewers", "ICLR.cc/2020/Conference/Paper595/Area_Chairs", "ICLR.cc/2020/Conference/Program_Chairs"], "description": "Who your comment will be visible to. If replying to a specific person make sure to add the group they are a member of so that they are able to see your response"}, "writers": {"values-copied": ["ICLR.cc/2020/Conference", "{signatures}"]}, "signatures": {"description": "How your identity will be displayed.", "values-regex": "ICLR.cc/2020/Conference/Paper595/AnonReviewer[0-9]+|ICLR.cc/2020/Conference/Paper595/Authors|ICLR.cc/2020/Conference/Paper595/Area_Chair[0-9]+|ICLR.cc/2020/Conference/Program_Chairs"}}, "readers": ["everyone"], "tcdate": 1569504169103, "tmdate": 1576860561388, "super": "ICLR.cc/2020/Conference/-/Comment", "signatures": ["ICLR.cc/2020/Conference"], "writers": ["ICLR.cc/2020/Conference"], "invitees": ["ICLR.cc/2020/Conference/Paper595/Authors", "ICLR.cc/2020/Conference/Paper595/Reviewers", "ICLR.cc/2020/Conference/Paper595/Area_Chairs", "ICLR.cc/2020/Conference/Program_Chairs"], "id": "ICLR.cc/2020/Conference/Paper595/-/Official_Comment"}}}, {"id": "H1xidUSYjS", "original": null, "number": 5, "cdate": 1573635698666, "ddate": null, "tcdate": 1573635698666, "tmdate": 1573635698666, "tddate": null, "forum": "BygSP6Vtvr", "replyto": "rygXFaj3tB", "invitation": "ICLR.cc/2020/Conference/Paper595/-/Official_Comment", "content": {"title": "RESPONSE TO REVIEWER II - PART II", "comment": "III.d While it is important to describe PRR, we believe that it will distract from the main story if added to the main part of the paper. Thus, we will keep it in the appendix. It must be noted that this measure was also proposed in a number of different publications and previous papers (not cited in the appendix). We didn't have references previously because overleaf died before we could upload a version of the paper with them. However, we are happy to move the NLL/Calibration experiments to the main paper and discuss them there. Additionally, we can provide a PR curve and AUPR numbers in the appendix for further information. However, this has previously been investigated in [PhD Thesis, Malinin 2019] for a range of datasets.\n\n[PhD Thesis, Malinin 2019] \"Uncertainty Estimation in Deep Learning with application to Spoken Language Assessment\". University of Cambridge\n\nIII.e This is likely a consequence of over-estimating the support due to using forward KL-divergence in combination with a Dirichlet distribution, which may not be flexible enough to capture the distribution of the ensembles. EnD doesn't suffer from this, as it only tries to match the mean of the ensemble. We have moved the NLL results to the main paper and addressed this in the discussion. We have moved to discussion about the appropriateness of the Dirichlet Distribution from the appendix into the main paper as it ties in with this concern.\n \n \n(IV) Missing training and implementation details\n\nIV.a Details added to equation 9.\n\nIV.b The only possible issues is if one of the ensemble's predictions is so sharp that it is a one-hot vector. Then $\\ln(\\pi_c^{(mi)})$ would be a NaN for the pis which are 0. To avoid this we added a very small smoothing term (now described in appendix) to deal with this even without temperature annealing. While this allows EnDD to work on Toy data, it is still necessary to use temperature for the CIFAR-10/CIFAR-100/TinyImageNet datasets. However, the loss should otherwise be stable. One of the reasons we believe that temperature affects the common support, rather than stability of the loss, is because the toy problem is 3-dimensional (in terms of classes). As the dimensionality of the problem increases, common support is harder to achieve due to how high-dimensional spaces operate.\n\nIV.c Details of annealing schedule have been added to the appendix. \n\n(V) Minor Points\n\nV.a,b,c - All addressed in the paper.\n\nV.d 100 DNN models were trained. 3 EnD and EnDD models were run. 10 for C10 Prior Network, 3 for C100 and TIM Prior Network. We initially invested a lot of compute to construct a rich ensemble, and then a lot of time was spent getting EnDD working for image data. However, all models tend to yield roughly consistent performance across different random seeds, so we considered 3 random seeds sufficient. Using more would, of course, be better.\n\nV.e We used confidence of the max class, which is also a measures of total uncertainty. It was shown in (Malinin and Gales, 2018) and in (Phd Thesis, Malinin, 2019) that confidence of the max class consistently yields marginally better performance on misclassification detection than entropy, as it is only sensitive to the probability of the prediction being considered, unlike entropy, which is sensitive to the entire distribution over classes.\n\nTYPOS: All addressed. "}, "signatures": ["ICLR.cc/2020/Conference/Paper595/Authors"], "readers": ["everyone"], "nonreaders": [], "writers": ["ICLR.cc/2020/Conference/Paper595/Authors", "ICLR.cc/2020/Conference"], "details": {"replyCount": 0, "writable": false, "overwriting": [], "revisions": false, "forumContent": {"title": "Ensemble Distribution Distillation", "authors": ["Andrey Malinin", "Bruno Mlodozeniec", "Mark Gales"], "authorids": ["am969@yandex-team.ru", "bkm28@cam.ac.uk", "mjfg@eng.cam.ac.uk"], "keywords": ["Ensemble Distillation", "Knowledge Distillation", "Uncertainty Estimation", "Density Estimation"], "TL;DR": "We distill an ensemble of models into a single model, capturing both the improved classification performance and information about the diversity of the ensemble, which is useful for uncertainty estimation.", "abstract": "Ensembles of models often yield improvements in system performance. These ensemble approaches have also been empirically shown to yield robust measures of uncertainty, and are capable of distinguishing between different forms of uncertainty. However, ensembles come at a computational and memory cost which may be prohibitive for many applications. There has been significant work done on the distillation of an ensemble into a single model. Such approaches decrease computational cost and allow a single model to achieve an accuracy comparable to that of an ensemble. However, information about the diversity of the ensemble, which can yield estimates of different forms of uncertainty, is lost. This work considers the novel task of Ensemble Distribution Distillation (EnD^2) - distilling the distribution of the predictions from an ensemble, rather than just the average prediction, into a single model. EnD^2 enables a single model to retain both the improved classification performance of ensemble distillation as well as information about the diversity of the ensemble, which is useful for uncertainty estimation. A solution for EnD^2 based on Prior Networks, a class of models which allow a single neural network to explicitly model a distribution over output distributions, is proposed in this work. The properties of EnD^2 are investigated on both an artificial dataset, and on the CIFAR-10, CIFAR-100 and TinyImageNet datasets, where it is shown that EnD^2 can approach the classification performance of an ensemble, and outperforms both standard DNNs and Ensemble Distillation on the tasks of misclassification and out-of-distribution input detection.", "pdf": "/pdf/b89ef269141324b94996984453d8c77e2a828d57.pdf", "paperhash": "malinin|ensemble_distribution_distillation", "_bibtex": "@inproceedings{\nMalinin2020Ensemble,\ntitle={Ensemble Distribution Distillation},\nauthor={Andrey Malinin and Bruno Mlodozeniec and Mark Gales},\nbooktitle={International Conference on Learning Representations},\nyear={2020},\nurl={https://openreview.net/forum?id=BygSP6Vtvr}\n}", "full_presentation_video": "", "original_pdf": "/attachment/79a469d47433204bfdd0ea80b025de9f9acddec3.pdf", "appendix": "", "poster": "", "spotlight_video": "", "slides": ""}, "tags": [], "invitation": {"reply": {"content": {"title": {"required": true, "description": "Brief summary of your comment.", "order": 0, "value-regex": ".{1,500}"}, "comment": {"required": true, "description": "Your comment or reply (max 5000 characters). Add TeX formulas using the following formats: $In-line Formula$ or $$Block Formula$$", "order": 1, "value-regex": "[\\S\\s]{1,5000}"}}, "forum": "BygSP6Vtvr", "readers": {"values-dropdown": ["everyone", "ICLR.cc/2020/Conference/Paper595/Authors", "ICLR.cc/2020/Conference/Paper595/AnonReviewer.*", "ICLR.cc/2020/Conference/Paper595/Reviewers/Submitted", "ICLR.cc/2020/Conference/Paper595/Reviewers", "ICLR.cc/2020/Conference/Paper595/Area_Chairs", "ICLR.cc/2020/Conference/Program_Chairs"], "description": "Who your comment will be visible to. If replying to a specific person make sure to add the group they are a member of so that they are able to see your response"}, "writers": {"values-copied": ["ICLR.cc/2020/Conference", "{signatures}"]}, "signatures": {"description": "How your identity will be displayed.", "values-regex": "ICLR.cc/2020/Conference/Paper595/AnonReviewer[0-9]+|ICLR.cc/2020/Conference/Paper595/Authors|ICLR.cc/2020/Conference/Paper595/Area_Chair[0-9]+|ICLR.cc/2020/Conference/Program_Chairs"}}, "readers": ["everyone"], "tcdate": 1569504169103, "tmdate": 1576860561388, "super": "ICLR.cc/2020/Conference/-/Comment", "signatures": ["ICLR.cc/2020/Conference"], "writers": ["ICLR.cc/2020/Conference"], "invitees": ["ICLR.cc/2020/Conference/Paper595/Authors", "ICLR.cc/2020/Conference/Paper595/Reviewers", "ICLR.cc/2020/Conference/Paper595/Area_Chairs", "ICLR.cc/2020/Conference/Program_Chairs"], "id": "ICLR.cc/2020/Conference/Paper595/-/Official_Comment"}}}, {"id": "BJePTRNYiS", "original": null, "number": 3, "cdate": 1573633727464, "ddate": null, "tcdate": 1573633727464, "tmdate": 1573633727464, "tddate": null, "forum": "BygSP6Vtvr", "replyto": "r1xzMickcB", "invitation": "ICLR.cc/2020/Conference/Paper595/-/Official_Comment", "content": {"title": "RESPONSE TO REVIEWER III", "comment": "Dear Reviewer III,\n\nThe benefit of Ensemble Distribution Distillation is the ability to explicitly emulate a source ensemble and decompose measures of uncertainty. This is common practice for tasks such as Bayesian Active Learning (Kirsch 2019), where knowledge uncertainty is commonly used. Thus, we believe that the ability to model an ensemble and decompose uncertainties via EnDD is by itself significant. However, we speculate that Ensemble Distribution Distillation may have additional benefits by consuming extra degrees of freedom from the model and adding a regularizing effect. This may make the model more robust to, for example, adversarial attacks. This is supported by the findings in (Malinin & Gales, 2019), where it is shown that it is more difficult to construct adversarial attacks against Prior Network models due to their rich measures of uncertainty. However, investigating this is left to future work. \n\n(Kirsch, 2019) \"BatchBALD: Efficient and Diverse Batch Acquisition for Deep Bayesian Active Learning\" (NeurIPS 2019)\n(Malinin and Gales, 2019) \"Reverse KL-divergence training of Prior Networks: Improved Uncertainty and Adversarial Robustness\" (NeurIPS 2019)\n"}, "signatures": ["ICLR.cc/2020/Conference/Paper595/Authors"], "readers": ["everyone"], "nonreaders": [], "writers": ["ICLR.cc/2020/Conference/Paper595/Authors", "ICLR.cc/2020/Conference"], "details": {"replyCount": 0, "writable": false, "overwriting": [], "revisions": false, "forumContent": {"title": "Ensemble Distribution Distillation", "authors": ["Andrey Malinin", "Bruno Mlodozeniec", "Mark Gales"], "authorids": ["am969@yandex-team.ru", "bkm28@cam.ac.uk", "mjfg@eng.cam.ac.uk"], "keywords": ["Ensemble Distillation", "Knowledge Distillation", "Uncertainty Estimation", "Density Estimation"], "TL;DR": "We distill an ensemble of models into a single model, capturing both the improved classification performance and information about the diversity of the ensemble, which is useful for uncertainty estimation.", "abstract": "Ensembles of models often yield improvements in system performance. These ensemble approaches have also been empirically shown to yield robust measures of uncertainty, and are capable of distinguishing between different forms of uncertainty. However, ensembles come at a computational and memory cost which may be prohibitive for many applications. There has been significant work done on the distillation of an ensemble into a single model. Such approaches decrease computational cost and allow a single model to achieve an accuracy comparable to that of an ensemble. However, information about the diversity of the ensemble, which can yield estimates of different forms of uncertainty, is lost. This work considers the novel task of Ensemble Distribution Distillation (EnD^2) - distilling the distribution of the predictions from an ensemble, rather than just the average prediction, into a single model. EnD^2 enables a single model to retain both the improved classification performance of ensemble distillation as well as information about the diversity of the ensemble, which is useful for uncertainty estimation. A solution for EnD^2 based on Prior Networks, a class of models which allow a single neural network to explicitly model a distribution over output distributions, is proposed in this work. The properties of EnD^2 are investigated on both an artificial dataset, and on the CIFAR-10, CIFAR-100 and TinyImageNet datasets, where it is shown that EnD^2 can approach the classification performance of an ensemble, and outperforms both standard DNNs and Ensemble Distillation on the tasks of misclassification and out-of-distribution input detection.", "pdf": "/pdf/b89ef269141324b94996984453d8c77e2a828d57.pdf", "paperhash": "malinin|ensemble_distribution_distillation", "_bibtex": "@inproceedings{\nMalinin2020Ensemble,\ntitle={Ensemble Distribution Distillation},\nauthor={Andrey Malinin and Bruno Mlodozeniec and Mark Gales},\nbooktitle={International Conference on Learning Representations},\nyear={2020},\nurl={https://openreview.net/forum?id=BygSP6Vtvr}\n}", "full_presentation_video": "", "original_pdf": "/attachment/79a469d47433204bfdd0ea80b025de9f9acddec3.pdf", "appendix": "", "poster": "", "spotlight_video": "", "slides": ""}, "tags": [], "invitation": {"reply": {"content": {"title": {"required": true, "description": "Brief summary of your comment.", "order": 0, "value-regex": ".{1,500}"}, "comment": {"required": true, "description": "Your comment or reply (max 5000 characters). Add TeX formulas using the following formats: $In-line Formula$ or $$Block Formula$$", "order": 1, "value-regex": "[\\S\\s]{1,5000}"}}, "forum": "BygSP6Vtvr", "readers": {"values-dropdown": ["everyone", "ICLR.cc/2020/Conference/Paper595/Authors", "ICLR.cc/2020/Conference/Paper595/AnonReviewer.*", "ICLR.cc/2020/Conference/Paper595/Reviewers/Submitted", "ICLR.cc/2020/Conference/Paper595/Reviewers", "ICLR.cc/2020/Conference/Paper595/Area_Chairs", "ICLR.cc/2020/Conference/Program_Chairs"], "description": "Who your comment will be visible to. If replying to a specific person make sure to add the group they are a member of so that they are able to see your response"}, "writers": {"values-copied": ["ICLR.cc/2020/Conference", "{signatures}"]}, "signatures": {"description": "How your identity will be displayed.", "values-regex": "ICLR.cc/2020/Conference/Paper595/AnonReviewer[0-9]+|ICLR.cc/2020/Conference/Paper595/Authors|ICLR.cc/2020/Conference/Paper595/Area_Chair[0-9]+|ICLR.cc/2020/Conference/Program_Chairs"}}, "readers": ["everyone"], "tcdate": 1569504169103, "tmdate": 1576860561388, "super": "ICLR.cc/2020/Conference/-/Comment", "signatures": ["ICLR.cc/2020/Conference"], "writers": ["ICLR.cc/2020/Conference"], "invitees": ["ICLR.cc/2020/Conference/Paper595/Authors", "ICLR.cc/2020/Conference/Paper595/Reviewers", "ICLR.cc/2020/Conference/Paper595/Area_Chairs", "ICLR.cc/2020/Conference/Program_Chairs"], "id": "ICLR.cc/2020/Conference/Paper595/-/Official_Comment"}}}, {"id": "BkxPqUmUtH", "original": null, "number": 1, "cdate": 1571333774717, "ddate": null, "tcdate": 1571333774717, "tmdate": 1572972575834, "tddate": null, "forum": "BygSP6Vtvr", "replyto": "BygSP6Vtvr", "invitation": "ICLR.cc/2020/Conference/Paper595/-/Official_Review", "content": {"rating": "8: Accept", "experience_assessment": "I have published one or two papers in this area.", "review_assessment:_checking_correctness_of_derivations_and_theory": "I carefully checked the derivations and theory.", "review_assessment:_checking_correctness_of_experiments": "I carefully checked the experiments.", "title": "Official Blind Review #1", "review_assessment:_thoroughness_in_paper_reading": "I read the paper thoroughly.", "review": "Summary:\n\nEnsembles of probabilistic models (e.g. for classification) provide measures of both data uncertainty (i.e. how uncertain each model is on average) and model uncertainty (i.e. how much the models disagree in their predictions). When naively distilling an ensemble to a single model, the ability to decompose total uncertainty into data uncertainty and model uncertainty is lost. This paper describes a method for ensemble distillation that retains both types of uncertainty in the case of classification. The idea is to train a prior network (i.e. a conditional Dirichlet distribution) to model the distribution of categorical probabilities within the ensemble. Both total uncertainty and data uncertainty can then be computed analytically from the prior network.\n\nPros:\n\nThe paper considers an interesting problem, and makes a clear contribution towards addressing it. The paper motivates the problem well, and explains the contribution and the method's limitations clearly.\n\nThe proposed method is simple, but well motivated, sound, and well explained.\n\nThe paper is very well written and easy to read. I particularly appreciated the toy experiment in section 4 and the visualization in figure 3, which showcase clearly what the method does.\n\nThe experiments are thorough, and the results are discussed fairly and objectively.\n\nCons:\n\nThe scope of the paper and the method is limited to the problem of probabilistic classification. However, one could have a more general ensemble of conditional or unconditional distributions. The method could in principle be applied to this setting, by having a hypernetwork learn the distribution of the distributional parameters of the models in the ensemble (the method presented in the paper is a special case of this, where the hypernetwork is a prior network and the distributional parameters are categorical probabilities). However, it's not clear that the method would scale to models with arbitrary distributional parameters. I would suggest that the paper make it clear from the beginning that the scope is probabilistic classification, and at the end discuss the extent to which this is a limitation, and how the method could potentially be extended to other kinds of ensembles.\n\nThe prior network used is essentially a conditional Dirichlet distribution, which (as the paper clearly acknowledges) may not always be flexible enough. A more flexible prior network could be a mixture of Dirichlet distributions, where the mixing coefficients and the parameters of each mixture component would be functions of the input, similarly to mixture density networks (http://publications.aston.ac.uk/id/eprint/373/) but with Dirichets instead of Gaussians. I believe that equations (9) and (10) would still be tractable in that case, as it's tractable to compute expectations under mixtures if the expectations under mixture components are tractable.\n\nOne limitation of the approach is that the prior network may not give accurate predictions for inputs it hasn't been trained on (as the paper discusses and section 4 clearly demonstrates). It's not clear how this problem can be overcome in general, and further research may be needed in that direction.\n\nSome of the results in Table 4 are puzzling (as the paper also acknowledges). In particular, the EnD model should be able to retain the performance of the ensemble when using total uncertainty but it doesn't. Also, using knowledge uncertainty doesn't always seem to be better than using total uncertainty, which to some extent defeats the purpose of the method (at least in this particular example). It would be good to investigate further these results. In any case, I appreciate that the paper acknowledges these results, but avoids unjustified speculation about what may be causing them.\n\nDecision:\n\nOverall, this is good work and I'm happy to recommend acceptance. There are some limitations to the method, but these can be seen as motivation for future work.\n\nMinor suggestions for improvement:\n\nThis older work is relevant and could be cited (but there is no obligation to do so).\nOn compressing ensembles:\n- Model compression, https://dl.acm.org/citation.cfm?id=1150464\n- Compact approximations to Bayesian predictive distributions, https://dl.acm.org/citation.cfm?id=1102457\n- Distilling model knowledge, https://arxiv.org/abs/1510.02437\nOn information-theoretic measures for decomposing total uncertainty as in eq. (4):\n- Decomposition of uncertainty in Bayesian deep learning for efficient and risk-sensitive learning, https://arxiv.org/abs/1710.07283\n\n\"[Knowledge uncertainty] arises when the test input comes from a different distribution than the one that generated the training data\"\nThis is only one way knowledge uncertainty can arise, it could also arise when the test input comes from the same distribution that generated training data, but there aren't enough training data available.\n\nSome parentheses are dangling at the bottom of page 2, top of page 3 and middle of page 4.\n\nIn figure 1, it'd be good to make clear in the caption that the figure is illustrating the simplex of categorical probabilities.\n\nThe last paragraph of section 2 uses the term \"posterior\" repeatedly to refer to P(y|x, \\theta) which is confusing. I would call P(y|x, \\theta) the \"model prediction\" or something like that.\n\nEq. (5) should be without the negative sign I think.\n\nIn section 3, I would use a different symbol (e.g. \\phi) to denote the parameters of the prior network, to clearly distinguish them from the parameters of the models in the ensemble.\n\n\"Optimization of the KL-divergence between distributions with limited non-zero common support is particularly difficult\"\nSome more evidence in support of this claim is needed I think; either explain why or provide a reference that does.\n\nIn section 4, the text says that EnD has \"a minor degradation in performance\" but table 1 seems to show otherwise. Also, the results of EnD in table 1 and table 2 are different, which makes me think there may be a typo somewhere.\n\nMaking the references have consistent format and correct capitalization (e.g. DNNs, Bayesian) would make the paper look even more polished.\n"}, "signatures": ["ICLR.cc/2020/Conference/Paper595/AnonReviewer1"], "readers": ["everyone"], "nonreaders": [], "writers": ["ICLR.cc/2020/Conference/Paper595/AnonReviewer1"], "details": {"replyCount": 0, "writable": false, "overwriting": [], "revisions": false, "forumContent": {"title": "Ensemble Distribution Distillation", "authors": ["Andrey Malinin", "Bruno Mlodozeniec", "Mark Gales"], "authorids": ["am969@yandex-team.ru", "bkm28@cam.ac.uk", "mjfg@eng.cam.ac.uk"], "keywords": ["Ensemble Distillation", "Knowledge Distillation", "Uncertainty Estimation", "Density Estimation"], "TL;DR": "We distill an ensemble of models into a single model, capturing both the improved classification performance and information about the diversity of the ensemble, which is useful for uncertainty estimation.", "abstract": "Ensembles of models often yield improvements in system performance. These ensemble approaches have also been empirically shown to yield robust measures of uncertainty, and are capable of distinguishing between different forms of uncertainty. However, ensembles come at a computational and memory cost which may be prohibitive for many applications. There has been significant work done on the distillation of an ensemble into a single model. Such approaches decrease computational cost and allow a single model to achieve an accuracy comparable to that of an ensemble. However, information about the diversity of the ensemble, which can yield estimates of different forms of uncertainty, is lost. This work considers the novel task of Ensemble Distribution Distillation (EnD^2) - distilling the distribution of the predictions from an ensemble, rather than just the average prediction, into a single model. EnD^2 enables a single model to retain both the improved classification performance of ensemble distillation as well as information about the diversity of the ensemble, which is useful for uncertainty estimation. A solution for EnD^2 based on Prior Networks, a class of models which allow a single neural network to explicitly model a distribution over output distributions, is proposed in this work. The properties of EnD^2 are investigated on both an artificial dataset, and on the CIFAR-10, CIFAR-100 and TinyImageNet datasets, where it is shown that EnD^2 can approach the classification performance of an ensemble, and outperforms both standard DNNs and Ensemble Distillation on the tasks of misclassification and out-of-distribution input detection.", "pdf": "/pdf/b89ef269141324b94996984453d8c77e2a828d57.pdf", "paperhash": "malinin|ensemble_distribution_distillation", "_bibtex": "@inproceedings{\nMalinin2020Ensemble,\ntitle={Ensemble Distribution Distillation},\nauthor={Andrey Malinin and Bruno Mlodozeniec and Mark Gales},\nbooktitle={International Conference on Learning Representations},\nyear={2020},\nurl={https://openreview.net/forum?id=BygSP6Vtvr}\n}", "full_presentation_video": "", "original_pdf": "/attachment/79a469d47433204bfdd0ea80b025de9f9acddec3.pdf", "appendix": "", "poster": "", "spotlight_video": "", "slides": ""}, "tags": [], "invitation": {"reply": {"content": {"experience_assessment": {"required": true, "order": 4, "description": "Please make a selection that represents your experience correctly", "value-radio": ["I have published in this field for several years.", "I have published one or two papers in this area.", "I have read many papers in this area.", "I do not know much about this area."]}, "rating": {"value-dropdown": ["1: Reject", "3: Weak Reject", "6: Weak Accept", "8: Accept"], "order": 3, "required": true}, "review_assessment:_checking_correctness_of_experiments": {"required": true, "order": 7, "description": "If no experiments, please select N/A", "value-radio": ["I carefully checked the experiments.", "I assessed the sensibility of the experiments.", "I did not assess the experiments.", "N/A"]}, "review_assessment:_thoroughness_in_paper_reading": {"required": true, "order": 5, "description": "If this is not applicable, please select N/A", "value-radio": ["I read the paper thoroughly.", "I read the paper at least twice and used my best judgement in assessing the paper.", "I made a quick assessment of this paper.", "N/A"]}, "title": {"value-regex": "Official Blind Review #[0-9]+", "order": 1, "required": true, "description": "Please replace NUM with your AnonReviewer number (it is the number following \"AnonReviewer\" in your signatures below)", "default": "Official Blind Review #NUM"}, "review": {"value-regex": "[\\S\\s]{500,200000}", "order": 2, "description": "Provide your complete review here (500 - 200000 characters). For guidance in writing a good review, see this brief reviewer guide (https://iclr.cc/Conferences/2020/ReviewerGuide) with three key bullet points.", "required": true}, "review_assessment:_checking_correctness_of_derivations_and_theory": {"required": true, "order": 6, "description": "If no derivations or theory, please select N/A", "value-radio": ["I carefully checked the derivations and theory.", "I assessed the sensibility of the derivations and theory.", "I did not assess the derivations or theory.", "N/A"]}}, "forum": "BygSP6Vtvr", "replyto": "BygSP6Vtvr", "readers": {"values": ["everyone"], "description": "Select all user groups that should be able to read this comment."}, "nonreaders": {"values": []}, "writers": {"values-regex": "ICLR.cc/2020/Conference/Paper595/AnonReviewer[0-9]+", "description": "How your identity will be displayed."}, "signatures": {"values-regex": "ICLR.cc/2020/Conference/Paper595/AnonReviewer[0-9]+", "description": "How your identity will be displayed."}}, "expdate": 1576060297178, "duedate": 1572706740000, "multiReply": false, "readers": ["everyone"], "nonreaders": [], "invitees": ["ICLR.cc/2020/Conference/Paper595/Reviewers"], "noninvitees": [], "tcdate": 1570237749869, "tmdate": 1576060297191, "super": "ICLR.cc/2020/Conference/-/Official_Review", "signatures": ["ICLR.cc/2020/Conference"], "writers": ["ICLR.cc/2020/Conference"], "id": "ICLR.cc/2020/Conference/Paper595/-/Official_Review"}}}], "count": 10}