{"notes": [{"id": "RdhjoXl-SDG", "original": "q7r45J2HAq", "number": 2428, "cdate": 1601308268053, "ddate": null, "tcdate": 1601308268053, "tmdate": 1614985668899, "tddate": null, "forum": "RdhjoXl-SDG", "replyto": null, "invitation": "ICLR.cc/2021/Conference/-/Blind_Submission", "content": {"title": "Multiscale Invertible Generative Networks for High-Dimensional Bayesian Inference", "authorids": ["~Shumao_Zhang1", "~Thomas_Hou2", "~Pengchuan_Zhang1"], "authors": ["Shumao Zhang", "Thomas Hou", "Pengchuan Zhang"], "keywords": [], "abstract": "High-dimensional Bayesian inference problems cast a long-standing challenge in generating samples, especially when the posterior has multiple modes. For a wide class of Bayesian inference problems equipped with the multiscale structure that low-dimensional (coarse-scale) surrogate can approximate the original high-dimensional (fine-scale) problem well, we propose to train a Multiscale Invertible Generative Network (MsIGN) for sample generation. A novel prior conditioning layer is designed to bridge networks at different resolutions, enabling coarse-to-fine multi-stage training. Jeffreys divergence is adopted as the training objective to avoid mode dropping. On two high-dimensional Bayesian inverse problems, MsIGN approximates the posterior accurately and clearly captures multiple modes, showing superior performance compared with previous deep generative network approaches. On the natural image synthesis task, MsIGN achieves the superior performance in bits-per-dimension compared with our baseline models and yields great interpret-ability of its neurons in intermediate layers.", "code_of_ethics": "I acknowledge that I and all co-authors of this work have read and commit to adhering to the ICLR Code of Ethics", "paperhash": "zhang|multiscale_invertible_generative_networks_for_highdimensional_bayesian_inference", "supplementary_material": "/attachment/eae1692391fbd4c45bce3f65b4ce609b2d18bc2b.zip", "pdf": "/pdf/c1d96c7db981128a60eb30ab88e5706ed7d54e6c.pdf", "reviewed_version_(pdf)": "https://openreview.net/references/pdf?id=1ewipEAc8r", "_bibtex": "@misc{\nzhang2021multiscale,\ntitle={Multiscale Invertible Generative Networks for High-Dimensional Bayesian Inference},\nauthor={Shumao Zhang and Thomas Hou and Pengchuan Zhang},\nyear={2021},\nurl={https://openreview.net/forum?id=RdhjoXl-SDG}\n}"}, "signatures": ["ICLR.cc/2021/Conference"], "readers": ["everyone"], "nonreaders": [], "writers": ["ICLR.cc/2021/Conference"], "details": {"replyCount": 8, "writable": false, "overwriting": [], "revisions": true, "tags": [], "invitation": {"reply": {"readers": {"values-regex": ".*"}, "writers": {"values": ["ICLR.cc/2021/Conference"]}, "signatures": {"values": ["ICLR.cc/2021/Conference"]}, "content": {"authors": {"values": ["Anonymous"]}, "authorids": {"values-regex": ".*"}, "reviewed_version_(pdf)": {"required": false, "description": "Upload a PDF file that ends with .pdf", "value-regex": ".*"}}}, "signatures": ["ICLR.cc/2021/Conference"], "readers": ["everyone"], "writers": ["ICLR.cc/2021/Conference"], "invitees": ["~", "OpenReview.net/Support"], "tcdate": 1601308008205, "tmdate": 1614984599368, "id": "ICLR.cc/2021/Conference/-/Blind_Submission"}}, "tauthor": "OpenReview.net"}, {"id": "8xDSujmHdx3", "original": null, "number": 1, "cdate": 1610040488982, "ddate": null, "tcdate": 1610040488982, "tmdate": 1610474094705, "tddate": null, "forum": "RdhjoXl-SDG", "replyto": "RdhjoXl-SDG", "invitation": "ICLR.cc/2021/Conference/Paper2428/-/Decision", "content": {"title": "Final Decision", "decision": "Reject", "comment": "The paper considers sample generation in high-dimensional bayesian inference and proposes a multi scale procedure that performs coarse-to-fine multi-stage training and enables interpretability of intermediate activations at coarse scales.  The method is simple, elegant and addresses a very important bottleneck of high-dimensional bayesian inference. The clarity of the paper has been greatly improved based on the reviewers suggestions. \n\nHowever some concerns remain regarding the evaluation that are needed to clearly demonstrate the value of the approach. In particular, it would be important to assess the impact of the number of levels, and how quickly the dimensions grow from one level to the next. The number of forward simulations does not provide a sufficient picture of the computational cost of the approaches. It would be also important to provide wall-clock time.  Figure 2a should also provide the best of 3  independent experiments,  or better, more experiments should be run, and curves with shaded areas should be provided so one could visualize variability w.r.t runs. "}, "signatures": ["ICLR.cc/2021/Conference/Program_Chairs"], "readers": ["everyone"], "nonreaders": [], "writers": ["ICLR.cc/2021/Conference/Program_Chairs"], "details": {"replyCount": 0, "writable": false, "overwriting": [], "revisions": false, "forumContent": {"title": "Multiscale Invertible Generative Networks for High-Dimensional Bayesian Inference", "authorids": ["~Shumao_Zhang1", "~Thomas_Hou2", "~Pengchuan_Zhang1"], "authors": ["Shumao Zhang", "Thomas Hou", "Pengchuan Zhang"], "keywords": [], "abstract": "High-dimensional Bayesian inference problems cast a long-standing challenge in generating samples, especially when the posterior has multiple modes. For a wide class of Bayesian inference problems equipped with the multiscale structure that low-dimensional (coarse-scale) surrogate can approximate the original high-dimensional (fine-scale) problem well, we propose to train a Multiscale Invertible Generative Network (MsIGN) for sample generation. A novel prior conditioning layer is designed to bridge networks at different resolutions, enabling coarse-to-fine multi-stage training. Jeffreys divergence is adopted as the training objective to avoid mode dropping. On two high-dimensional Bayesian inverse problems, MsIGN approximates the posterior accurately and clearly captures multiple modes, showing superior performance compared with previous deep generative network approaches. On the natural image synthesis task, MsIGN achieves the superior performance in bits-per-dimension compared with our baseline models and yields great interpret-ability of its neurons in intermediate layers.", "code_of_ethics": "I acknowledge that I and all co-authors of this work have read and commit to adhering to the ICLR Code of Ethics", "paperhash": "zhang|multiscale_invertible_generative_networks_for_highdimensional_bayesian_inference", "supplementary_material": "/attachment/eae1692391fbd4c45bce3f65b4ce609b2d18bc2b.zip", "pdf": "/pdf/c1d96c7db981128a60eb30ab88e5706ed7d54e6c.pdf", "reviewed_version_(pdf)": "https://openreview.net/references/pdf?id=1ewipEAc8r", "_bibtex": "@misc{\nzhang2021multiscale,\ntitle={Multiscale Invertible Generative Networks for High-Dimensional Bayesian Inference},\nauthor={Shumao Zhang and Thomas Hou and Pengchuan Zhang},\nyear={2021},\nurl={https://openreview.net/forum?id=RdhjoXl-SDG}\n}"}, "tags": [], "invitation": {"reply": {"forum": "RdhjoXl-SDG", "replyto": "RdhjoXl-SDG", "readers": {"values": ["everyone"]}, "writers": {"values": ["ICLR.cc/2021/Conference/Program_Chairs"]}, "signatures": {"values": ["ICLR.cc/2021/Conference/Program_Chairs"]}, "content": {"title": {"value": "Final Decision"}, "decision": {"value-radio": ["Accept (Oral)", "Accept (Spotlight)", "Accept (Poster)", "Reject"]}, "comment": {"value-regex": "[\\S\\s]{0,50000}", "markdown": true}}}, "multiReply": false, "signatures": ["ICLR.cc/2021/Conference"], "readers": ["everyone"], "writers": ["ICLR.cc/2021/Conference"], "invitees": ["ICLR.cc/2021/Conference/Program_Chairs"], "tcdate": 1610040488968, "tmdate": 1610474094689, "id": "ICLR.cc/2021/Conference/Paper2428/-/Decision"}}}, {"id": "rDTTm8hs41d", "original": null, "number": 2, "cdate": 1603887065043, "ddate": null, "tcdate": 1603887065043, "tmdate": 1606755412081, "tddate": null, "forum": "RdhjoXl-SDG", "replyto": "RdhjoXl-SDG", "invitation": "ICLR.cc/2021/Conference/Paper2428/-/Official_Review", "content": {"title": "The lack of clarity is in the way of making this a good paper that I am willing to accept. (Update: Marginal accept)", "review": "# Paper Summary\nThis paper presents a model and a corresponding training approach for multi-scale invertible models. The presented model is defined on multiple scales with information on finer scales being conditioned on coarser scales. Data generation is hence done sequentially from a coarser to finer scale. The authors argue that this multi-scale sampling helps in addressing the curse of dimensionality problem by allowing to sample from high density regions more efficiently.\n\nAs a core part of the model, the authors present a linear layer that combines information from a coarse scale and a noise vector to predict the data on a finer scale. This prior conditioning layer, as the authors call it, exploits the fact that the downsampling operation from a finer scale to a coarser scale is a linear operation. Under the assumption that the fine scale data follows a multivariate normal distribution, the downsampling operation can be analytically inverted.\n\nTraining is done by minimizing Jeffreys divergence, i.e. the loss is calculated bi-directinally in the forward and the backward direction of the model, akin to Ardizzone et al. (2019). The authors argue that Jeffreys divergence is less prone to the mode dropping that can happen when training with KL divergence. The authors justify this argument by citing Nielsen & Nock (2009), by doing ablation studies on toy data, and by giving a toy example in Appendix C.\n\nDue to the multi-scale structure and the fact that the coarse scale data can be generated from a fixed corruption process (the downsampling model), it is possible to train this model by decoupling the different scales. The authors suggest to train the model from a coarser to finer scale in a multi-stage process. The authors claim the superiority of this approach to regular end-to-end training.\n\nIn an extensive experimental section, the authors evaluate their approach on two 'Bayesian Inverse Problems', as well as on generative modeling of the Celeb A 64 data set. In further experiments, the authors perform ablation studies on a synthetic data set in order to justify their presented approach. In all experiments, the presented approach yields the highest performance.\n\n# Assessment Summary\n\nThe presented model and training approach exploit the hierarchical nature of data in a smart way. This in turn results in good performance on a number of data sets. The experimental section is rigorous and convincing. These aspects of the work should put me in favor of acceptance if it weren't for the lack of clarity in places (see below). In its current state the paper does not explain the method well enough in order to get a full understanding of the approach. I therefore tend to reject the paper at this stage. With appropriate improvements in the writing I would be happy to improve my score.\n\n# Positives\n- A multi-scale approach is a reasonable choice in many real world applications. The presented model exploits our world knowledge by utilizing a fixed downsampling operator to generate views of the data on different scales. This kind of inductive bias is simple to interpret and it appears to be a promising aid in model training.\n- The experimental section is extensive. The authors evaulate their approach on multiple problems, synthetic and real world. Especially the ablation study should be pointed out.\n- The ablation study aims to confirm the authors claims that the presented approach results in better mode capture. To do that the authors compare different model architectures, different training losses, and the multi-stage training to end-to-end training. Their results suggest that the multi-scale model trained in multiple stages using Jeffreys divergence indeed performs best.\n\n# Negatives\n- One of the biggest issues in this paper is the lack of clarity in places, which in turn makes the work hard to digest. This is often owed either to a poor choice of notation or to abbreviated explanations. Especially the methods section should be pointed out in this regard. I will give a few examples below.\n\t- In equation (1) the authors surrogate $q(x|y)$ with $q(x)$. This choice makes it difficult to follow equations (5) and (6) as it is not clear anymore where we are dealing with marginal or conditional probabilities.\n\t- The use of $\\rho(x)$ and $L(y|x)$ does not follow the ICLR style guide for probabilities.\n\t- Section 2.1 is not clear. Here, the choice of abbreviations in (5) and (6) hinders an understanding. It is not made clear which role variable y plays in the network. It should be made more clear by the authors that the forward process of the multiscale model is sampling from the posterior distribution.\n\t- Figure 1 only shows the sampling process, but does not help to understand the training. $\\tilde{x}_l$ is represented with smaller images than $x_l$ although both have the same dimensionality.\n\t- Section 2.3 discusses biefly the use of Jeffreys divergence with importance sampling for training the model. The authors do not make clear what $p(x)$ and $q(x)$ stand for in this context. As such it is not possible to make out how to train the model with the suggested loss.\n- The prior conditioning layer (upsampling layer) exploits the fact that the downsampling operation is linear and the prior over fine-scale data is assumed to be a multivariate normal distribution. As such, the upsampling can be implemented with a linear function of the coarse data and a noise vector. It is well known that this kind of inversion, although analytically correct, is computationally infeasible in high dimensional data. The authors do not address this issue in their text.\n- With respect to the multi-scale structure of the model, the paper does not position itself well in the literature. Invertible models such as in Dinh et al. (2016) already use a multi-scale structure. The authors should point out the difference of their approach more explicitly. Using explicit downsampling as an inductive bias was used successfully before for training GANs in Denton et al. (2015). This work might be a good starting point to discover other related multi-scale approaches.\n\n\n# Recommendations\n- Figure 1 could be improved to visualise the overall approach better. It would be worth visualising the sampling process for estimating Jeffreys divergence. Further, I would suggest to use an example from the Celeb A data set in order to get a better understanding of the intermediate scales. In addition, the downsampling operation $\\mathcal{A}$ could be emphasided in this figure.\n- Notation should be improved and made more consistent. Is there a way to reduce the amount of variables used? Is it possible to use consistent notation to denote probabilities?\n- Section 2.1 should be clarified. Is there a simpler way to explain this? For example by exploiting the Markov property of the model.\n\n# Questions\n- In Lemma 2.1 it is assumed that the fine-scale signal follows a multivariate normal distribution. Is this a reasonable assumption? Does this not contradict the idea of multiple modes in the data?\n- Figure 6: Why do the interemediate coarser scale samples not look like downsampled versions of the high resolution image?\n- What happens if the models on each scale are trained completely decoupled? Would it be fair to call the model a stacked super-resolution model?\n\n# References\n\nArdizzone, L., Kruse, J., Wirkert, S., Rahner, D., Pellegrini, E. W., Klessen, R. S., & Köthe, U. (2018). Analyzing inverse problems with invertible neural networks.\n \nDenton, E. L., Chintala, S., & Fergus, R. (2015). Deep generative image models using a￼ laplacian pyramid of adversarial networks. \n\nDinh, L., Sohl-Dickstein, J., & Bengio, S. (2016). Density estimation using real nvp.\n\nNielsen, F., & Nock, R. (2009). Sided and symmetrized Bregman centroids.\n\n---------------------------------------------------------\n\n# Review Update\nBased on the response and update from the authors I will improve my score from '5: Marginally below acceptance threshold' to '6: Marginally above acceptance threshold'. I generally believe that the presented approach merits publication. The methodology is sound and the experiments are convincing. I appreciate the fact that the authors made an effort to improve the writing.\n\n\n", "rating": "6: Marginally above acceptance threshold", "confidence": "3: The reviewer is fairly confident that the evaluation is correct"}, "signatures": ["ICLR.cc/2021/Conference/Paper2428/AnonReviewer2"], "readers": ["everyone"], "nonreaders": [], "writers": ["ICLR.cc/2021/Conference", "ICLR.cc/2021/Conference/Paper2428/AnonReviewer2"], "details": {"replyCount": 0, "writable": false, "overwriting": [], "revisions": false, "forumContent": {"title": "Multiscale Invertible Generative Networks for High-Dimensional Bayesian Inference", "authorids": ["~Shumao_Zhang1", "~Thomas_Hou2", "~Pengchuan_Zhang1"], "authors": ["Shumao Zhang", "Thomas Hou", "Pengchuan Zhang"], "keywords": [], "abstract": "High-dimensional Bayesian inference problems cast a long-standing challenge in generating samples, especially when the posterior has multiple modes. For a wide class of Bayesian inference problems equipped with the multiscale structure that low-dimensional (coarse-scale) surrogate can approximate the original high-dimensional (fine-scale) problem well, we propose to train a Multiscale Invertible Generative Network (MsIGN) for sample generation. A novel prior conditioning layer is designed to bridge networks at different resolutions, enabling coarse-to-fine multi-stage training. Jeffreys divergence is adopted as the training objective to avoid mode dropping. On two high-dimensional Bayesian inverse problems, MsIGN approximates the posterior accurately and clearly captures multiple modes, showing superior performance compared with previous deep generative network approaches. On the natural image synthesis task, MsIGN achieves the superior performance in bits-per-dimension compared with our baseline models and yields great interpret-ability of its neurons in intermediate layers.", "code_of_ethics": "I acknowledge that I and all co-authors of this work have read and commit to adhering to the ICLR Code of Ethics", "paperhash": "zhang|multiscale_invertible_generative_networks_for_highdimensional_bayesian_inference", "supplementary_material": "/attachment/eae1692391fbd4c45bce3f65b4ce609b2d18bc2b.zip", "pdf": "/pdf/c1d96c7db981128a60eb30ab88e5706ed7d54e6c.pdf", "reviewed_version_(pdf)": "https://openreview.net/references/pdf?id=1ewipEAc8r", "_bibtex": "@misc{\nzhang2021multiscale,\ntitle={Multiscale Invertible Generative Networks for High-Dimensional Bayesian Inference},\nauthor={Shumao Zhang and Thomas Hou and Pengchuan Zhang},\nyear={2021},\nurl={https://openreview.net/forum?id=RdhjoXl-SDG}\n}"}, "tags": [], "invitation": {"reply": {"content": {"title": {"order": 1, "value-regex": ".{0,500}", "description": "Brief summary of your review.", "required": true}, "review": {"order": 2, "value-regex": "[\\S\\s]{1,200000}", "description": "Please provide an evaluation of the quality, clarity, originality and significance of this work, including a list of its pros and cons (max 200000 characters). Add formatting using Markdown and formulas using LaTeX. For more information see https://openreview.net/faq . ***Please remember to file the Code-of-Ethics report. Once you submitted the review, a link to the report will be visible in the bottom right corner of your review.***", "required": true, "markdown": true}, "rating": {"order": 3, "value-dropdown": ["10: Top 5% of accepted papers, seminal paper", "9: Top 15% of accepted papers, strong accept", "8: Top 50% of accepted papers, clear accept", "7: Good paper, accept", "6: Marginally above acceptance threshold", "5: Marginally below acceptance threshold", "4: Ok but not good enough - rejection", "3: Clear rejection", "2: Strong rejection", "1: Trivial or wrong"], "required": true}, "confidence": {"order": 4, "value-radio": ["5: The reviewer is absolutely certain that the evaluation is correct and very familiar with the relevant literature", "4: The reviewer is confident but not absolutely certain that the evaluation is correct", "3: The reviewer is fairly confident that the evaluation is correct", "2: The reviewer is willing to defend the evaluation, but it is quite likely that the reviewer did not understand central parts of the paper", "1: The reviewer's evaluation is an educated guess"], "required": true}}, "forum": "RdhjoXl-SDG", "replyto": "RdhjoXl-SDG", "readers": {"description": "Select all user groups that should be able to read this comment.", "values": ["everyone"]}, "nonreaders": {"values": []}, "writers": {"values-copied": ["ICLR.cc/2021/Conference", "{signatures}"], "description": "How your identity will be displayed."}, "signatures": {"values-regex": "ICLR.cc/2021/Conference/Paper2428/AnonReviewer[0-9]+", "description": "How your identity will be displayed."}}, "expdate": 1607428800000, "duedate": 1606752000000, "multiReply": false, "readers": ["everyone"], "tcdate": 1602538096576, "tmdate": 1606915797203, "super": "ICLR.cc/2021/Conference/-/Official_Review", "signatures": ["OpenReview.net"], "writers": ["ICLR.cc/2021/Conference"], "invitees": ["ICLR.cc/2021/Conference/Paper2428/Reviewers", "OpenReview.net/Support"], "id": "ICLR.cc/2021/Conference/Paper2428/-/Official_Review"}}}, {"id": "IwJedFV5AAH", "original": null, "number": 7, "cdate": 1606249748457, "ddate": null, "tcdate": 1606249748457, "tmdate": 1606249748457, "tddate": null, "forum": "RdhjoXl-SDG", "replyto": "RdhjoXl-SDG", "invitation": "ICLR.cc/2021/Conference/Paper2428/-/Official_Comment", "content": {"title": "Response and Revision", "comment": "We thank reviewers for their insightful feedback, appreciation and suggestions to our work! The manuscript (both the main body and the appendices) has been revised with the following major changes to incorporate the comments.\n\n(Here Rx means Reviewer x for x=1,2,3)\n\n\n- Based on R1 and R2’s comments and suggestions about the clarity issue, we have revised our Section 1 and 2. Notations are made clearer at the beginning of both sections, and equations are followed by more detailed explanation, especially in Section 2.1. We also revised the font style to follow the ICLR guideline as mentioned by R2. Images are re-generated to a vector format, if possible. \n\n\n- Based on R1’s comments on the SotA claim, we revised our wording and do not claim SotA now.\n\n\n- Based on R1’ question on the multi-modality design of the test bed, we revised our wording in Section 4.1 to make clear that “q(x(s1, s2)) = q(x(s1, 1-s2))” is not the sufficient condition to make the test bed multi-modal, but a helpful condition to generate a multi-modal testbed, and to make sure modes are mirror-symmetric, and hence balanced to each other. We also revised our Appendix E.1 to elaborate on this issue.\n\n\n- Based on R2’s suggestion, we revised our Figure 1. We still decided to use samples from the Bayesian inverse problem as an example, because we wanted to emphasize our main target task of Bayesian inference.\n\n\n- Based on R2’s comment, we also moved part of Appendix D to Section 2.3 to make the description of our training strategy more complete.\n\n\n- Based on R2’s suggestion on more comprehensive literature review, we revised and appended new content in Section 3.\n\n\n- Based on R2’ suggestion on the highlight of the ablation study, we appended more description on our ablation study at Section 4.1.3, in order to give a more detailed discussion in this section. We also revised our appendix G in better support of this section.\n\n\nThe appendix has been greatly revised to give clearer explanation and support to our paper. "}, "signatures": ["ICLR.cc/2021/Conference/Paper2428/Authors"], "readers": ["everyone"], "nonreaders": [], "writers": ["ICLR.cc/2021/Conference", "ICLR.cc/2021/Conference/Paper2428/Authors"], "details": {"replyCount": 0, "writable": false, "overwriting": [], "revisions": false, "forumContent": {"title": "Multiscale Invertible Generative Networks for High-Dimensional Bayesian Inference", "authorids": ["~Shumao_Zhang1", "~Thomas_Hou2", "~Pengchuan_Zhang1"], "authors": ["Shumao Zhang", "Thomas Hou", "Pengchuan Zhang"], "keywords": [], "abstract": "High-dimensional Bayesian inference problems cast a long-standing challenge in generating samples, especially when the posterior has multiple modes. For a wide class of Bayesian inference problems equipped with the multiscale structure that low-dimensional (coarse-scale) surrogate can approximate the original high-dimensional (fine-scale) problem well, we propose to train a Multiscale Invertible Generative Network (MsIGN) for sample generation. A novel prior conditioning layer is designed to bridge networks at different resolutions, enabling coarse-to-fine multi-stage training. Jeffreys divergence is adopted as the training objective to avoid mode dropping. On two high-dimensional Bayesian inverse problems, MsIGN approximates the posterior accurately and clearly captures multiple modes, showing superior performance compared with previous deep generative network approaches. On the natural image synthesis task, MsIGN achieves the superior performance in bits-per-dimension compared with our baseline models and yields great interpret-ability of its neurons in intermediate layers.", "code_of_ethics": "I acknowledge that I and all co-authors of this work have read and commit to adhering to the ICLR Code of Ethics", "paperhash": "zhang|multiscale_invertible_generative_networks_for_highdimensional_bayesian_inference", "supplementary_material": "/attachment/eae1692391fbd4c45bce3f65b4ce609b2d18bc2b.zip", "pdf": "/pdf/c1d96c7db981128a60eb30ab88e5706ed7d54e6c.pdf", "reviewed_version_(pdf)": "https://openreview.net/references/pdf?id=1ewipEAc8r", "_bibtex": "@misc{\nzhang2021multiscale,\ntitle={Multiscale Invertible Generative Networks for High-Dimensional Bayesian Inference},\nauthor={Shumao Zhang and Thomas Hou and Pengchuan Zhang},\nyear={2021},\nurl={https://openreview.net/forum?id=RdhjoXl-SDG}\n}"}, "tags": [], "invitation": {"reply": {"content": {"title": {"order": 0, "value-regex": ".{1,500}", "description": "Brief summary of your comment.", "required": true}, "comment": {"order": 1, "value-regex": "[\\S\\s]{1,5000}", "description": "Your comment or reply (max 5000 characters). Add formatting using Markdown and formulas using LaTeX. For more information see https://openreview.net/faq", "required": true, "markdown": true}}, "forum": "RdhjoXl-SDG", "readers": {"description": "Who your comment will be visible to. If replying to a specific person make sure to add the group they are a member of so that they are able to see your response", "values-dropdown": ["ICLR.cc/2021/Conference/Program_Chairs", "ICLR.cc/2021/Conference/Paper2428/Area_Chairs"], "default": ["ICLR.cc/2021/Conference/Program_Chairs", "ICLR.cc/2021/Conference/Paper2428/Area_Chairs"]}, "writers": {"values-copied": ["ICLR.cc/2021/Conference", "{signatures}"]}, "signatures": {"values-regex": "ICLR.cc/2021/Conference/Paper2428/AnonReviewer[0-9]+|ICLR.cc/2021/Conference/Paper2428/Authors|ICLR.cc/2021/Conference/Paper2428/Area_Chair[0-9]+|ICLR.cc/2021/Conference/Program_Chairs", "description": "How your identity will be displayed."}}, "expdate": 1610649480000, "final": [], "readers": ["everyone"], "nonreaders": [], "invitees": ["ICLR.cc/2021/Conference", "ICLR.cc/2021/Conference/Paper2428/Area_Chairs", "ICLR.cc/2021/Conference/Program_Chairs", "OpenReview.net/Support"], "noninvitees": [], "tcdate": 1601923848486, "tmdate": 1610649509835, "super": "ICLR.cc/2021/Conference/-/Comment", "signatures": ["ICLR.cc/2021/Conference"], "writers": ["ICLR.cc/2021/Conference"], "id": "ICLR.cc/2021/Conference/Paper2428/-/Official_Comment"}}}, {"id": "nG468HsvcRC", "original": null, "number": 5, "cdate": 1605655738213, "ddate": null, "tcdate": 1605655738213, "tmdate": 1605662043359, "tddate": null, "forum": "RdhjoXl-SDG", "replyto": "U1xFEv5p8T", "invitation": "ICLR.cc/2021/Conference/Paper2428/-/Official_Comment", "content": {"title": "Comment to Reviewer 3", "comment": "Thank you for your honest comment.\n\nOur work targets at the Bayesian inference problems, where we want to generate samples from a distribution, given its unnormalized density. Such problem is very challenging when the sample dimension is high and when there are multiple modes in the distribution. Our MsIGN proposes a way to detect multiple modes and approximate the target distribution when the problem demonstrates certain multiscale structure, even if the dimension is rather high.\n\nNow we've updated our manuscript to enhance its clarity. Meanwhile, we will be very glad to discuss your questions and concerns."}, "signatures": ["ICLR.cc/2021/Conference/Paper2428/Authors"], "readers": ["everyone"], "nonreaders": [], "writers": ["ICLR.cc/2021/Conference", "ICLR.cc/2021/Conference/Paper2428/Authors"], "details": {"replyCount": 0, "writable": false, "overwriting": [], "revisions": false, "forumContent": {"title": "Multiscale Invertible Generative Networks for High-Dimensional Bayesian Inference", "authorids": ["~Shumao_Zhang1", "~Thomas_Hou2", "~Pengchuan_Zhang1"], "authors": ["Shumao Zhang", "Thomas Hou", "Pengchuan Zhang"], "keywords": [], "abstract": "High-dimensional Bayesian inference problems cast a long-standing challenge in generating samples, especially when the posterior has multiple modes. For a wide class of Bayesian inference problems equipped with the multiscale structure that low-dimensional (coarse-scale) surrogate can approximate the original high-dimensional (fine-scale) problem well, we propose to train a Multiscale Invertible Generative Network (MsIGN) for sample generation. A novel prior conditioning layer is designed to bridge networks at different resolutions, enabling coarse-to-fine multi-stage training. Jeffreys divergence is adopted as the training objective to avoid mode dropping. On two high-dimensional Bayesian inverse problems, MsIGN approximates the posterior accurately and clearly captures multiple modes, showing superior performance compared with previous deep generative network approaches. On the natural image synthesis task, MsIGN achieves the superior performance in bits-per-dimension compared with our baseline models and yields great interpret-ability of its neurons in intermediate layers.", "code_of_ethics": "I acknowledge that I and all co-authors of this work have read and commit to adhering to the ICLR Code of Ethics", "paperhash": "zhang|multiscale_invertible_generative_networks_for_highdimensional_bayesian_inference", "supplementary_material": "/attachment/eae1692391fbd4c45bce3f65b4ce609b2d18bc2b.zip", "pdf": "/pdf/c1d96c7db981128a60eb30ab88e5706ed7d54e6c.pdf", "reviewed_version_(pdf)": "https://openreview.net/references/pdf?id=1ewipEAc8r", "_bibtex": "@misc{\nzhang2021multiscale,\ntitle={Multiscale Invertible Generative Networks for High-Dimensional Bayesian Inference},\nauthor={Shumao Zhang and Thomas Hou and Pengchuan Zhang},\nyear={2021},\nurl={https://openreview.net/forum?id=RdhjoXl-SDG}\n}"}, "tags": [], "invitation": {"reply": {"content": {"title": {"order": 0, "value-regex": ".{1,500}", "description": "Brief summary of your comment.", "required": true}, "comment": {"order": 1, "value-regex": "[\\S\\s]{1,5000}", "description": "Your comment or reply (max 5000 characters). Add formatting using Markdown and formulas using LaTeX. For more information see https://openreview.net/faq", "required": true, "markdown": true}}, "forum": "RdhjoXl-SDG", "readers": {"description": "Who your comment will be visible to. If replying to a specific person make sure to add the group they are a member of so that they are able to see your response", "values-dropdown": ["ICLR.cc/2021/Conference/Program_Chairs", "ICLR.cc/2021/Conference/Paper2428/Area_Chairs"], "default": ["ICLR.cc/2021/Conference/Program_Chairs", "ICLR.cc/2021/Conference/Paper2428/Area_Chairs"]}, "writers": {"values-copied": ["ICLR.cc/2021/Conference", "{signatures}"]}, "signatures": {"values-regex": "ICLR.cc/2021/Conference/Paper2428/AnonReviewer[0-9]+|ICLR.cc/2021/Conference/Paper2428/Authors|ICLR.cc/2021/Conference/Paper2428/Area_Chair[0-9]+|ICLR.cc/2021/Conference/Program_Chairs", "description": "How your identity will be displayed."}}, "expdate": 1610649480000, "final": [], "readers": ["everyone"], "nonreaders": [], "invitees": ["ICLR.cc/2021/Conference", "ICLR.cc/2021/Conference/Paper2428/Area_Chairs", "ICLR.cc/2021/Conference/Program_Chairs", "OpenReview.net/Support"], "noninvitees": [], "tcdate": 1601923848486, "tmdate": 1610649509835, "super": "ICLR.cc/2021/Conference/-/Comment", "signatures": ["ICLR.cc/2021/Conference"], "writers": ["ICLR.cc/2021/Conference"], "id": "ICLR.cc/2021/Conference/Paper2428/-/Official_Comment"}}}, {"id": "CfCuRU2WJf", "original": null, "number": 4, "cdate": 1605655140756, "ddate": null, "tcdate": 1605655140756, "tmdate": 1605662022785, "tddate": null, "forum": "RdhjoXl-SDG", "replyto": "rDTTm8hs41d", "invitation": "ICLR.cc/2021/Conference/Paper2428/-/Official_Comment", "content": {"title": "Comment to Reviewer 2", "comment": "Thank you for your detailed review, comments and suggestions.\n\nWe've updated our manuscript, especially for the methodology part, to increase the clarity of this work.\n\n#### Regarding the negatives:\n\n- $q(x)$ vs $q(x|y)$: The measurement data $y$ only takes the part of defining the target distribution $q(x|y)$ in MsIGN, so we decided to drop it for notation simplicity. In fact, in other literatures in Bayesian inference problems like Moselhy et al., (2012) and Chen et al., (2019), authors used a similar abbreviation to the target posterior distribution. We updated our wording to make this notation clearer to readers in the beginning of Section 2.\n\n- Prior conditioning operator incomputable: The prior conditioning layer only needs to be computed once and will be fixed thereafter. Thus although sometimes the dimension gets too high and the inversion might be very expensive, it might still be acceptable given that we only needs to compute it once. Furthermore, if the dimension gets so high such that one-time evaluation is infeasible, we can consider performing low-rank approximation of the analytical solution. Though the prior conditioning operator is not exact, the following unit of invertible flow will correct this approximation by training. \n\n- Related work for the multi-scale design: Since we mainly focus on the task of Bayesian inference, in Section 3 we mainly listed related work for this task. We thank the reviewer for reminding us of the related works in image synthesis task, and have revised this section in the manuscript. The RealNVP model in Dinh et al., (2016) and Glow model in Kingma & Dhariwal., (2018) do used a multi-scale design, but the main difference is that 1) their multi-scale design doesn’t have spatial semantic meaning. The internal neuron gets a reduced of dimension, but this reduction has no spatial property. 2) Due to 1), RealNVP and Glow can’t be trained in a multi-stage fashion, and generate samples in a coarse-to-fine manner. The GAN model in Denton et al., (2015) is a generative adversial network that is not invertible, which is hard to do density evaluation. And therefore, the lack of invertibility in this models makes it difficult to be applied to the Bayesian inference problems. We appended more related work discussion in Section 3.\n\n#### Regarding the questions\n\n- Assumption of the multi-variate normal distribution: In the image synthesis task, since we lack of the information of how the distribution of images looks like a priori, we assume the prior of the images to be a multi-variate normal distribution. This doesn’t contradict with the multi-modal nature of the data because it only enforces a prior (and in practice a very weak one) for the data. The prior helps us in building a prior conditioning distribution to guide us in refining a low-resolution image to a high-resolution one, and it won’t hurt the multi-modality.\n\n- Figure 6: We use the model trained on low-resolution data to initialize the high-resolution model. Parameters from the low-resolution model will not be frozen in the following training, and therefore, the output at low-resolution stage might be different from that of the original low-resolution model. As shown in Figure 6, they are most likely some linear mix of the original output along the color channel. We can still see that the spatial feature of the intermediate coarser scale samples resembles that of the finer scale samples.\n\n- Decoupled training and a stacked super-resolution model: For the image synthesis task, it is fair to call our model a stacked super-resolution model. In fact, we also report that given the data set of natural images, each scale of our model can be trained separately. However, we focus on solving Bayesian inverse problems using MsIGN, where true samples are not available in training. In this case, we can’t train each scale of MsIGN separately. For high-$d$ Bayesian inverse problem with multiple modes, it is crucial to have the coarse-scale model in hand to optimize the Jeffreys divergence by importance sampling, and initialize the fine-scale model. In this sense, it may be appropriate to call our MsIGN a stacked super-resolution model.\n\n#### References\n\nEl Moselhy, Tarek A., and Youssef M. Marzouk. \"Bayesian inference with optimal maps.\" Journal of Computational Physics 231.23 (2012): 7815-7850.\n\nChen, Peng, et al. \"Projected Stein variational Newton: A fast and scalable Bayesian inference method in high dimensions.\" Advances in Neural Information Processing Systems. 2019.\n\nKingma, Durk P., and Prafulla Dhariwal. \"Glow: Generative flow with invertible 1x1 convolutions.\" Advances in neural information processing systems. 2018."}, "signatures": ["ICLR.cc/2021/Conference/Paper2428/Authors"], "readers": ["everyone"], "nonreaders": [], "writers": ["ICLR.cc/2021/Conference", "ICLR.cc/2021/Conference/Paper2428/Authors"], "details": {"replyCount": 0, "writable": false, "overwriting": [], "revisions": false, "forumContent": {"title": "Multiscale Invertible Generative Networks for High-Dimensional Bayesian Inference", "authorids": ["~Shumao_Zhang1", "~Thomas_Hou2", "~Pengchuan_Zhang1"], "authors": ["Shumao Zhang", "Thomas Hou", "Pengchuan Zhang"], "keywords": [], "abstract": "High-dimensional Bayesian inference problems cast a long-standing challenge in generating samples, especially when the posterior has multiple modes. For a wide class of Bayesian inference problems equipped with the multiscale structure that low-dimensional (coarse-scale) surrogate can approximate the original high-dimensional (fine-scale) problem well, we propose to train a Multiscale Invertible Generative Network (MsIGN) for sample generation. A novel prior conditioning layer is designed to bridge networks at different resolutions, enabling coarse-to-fine multi-stage training. Jeffreys divergence is adopted as the training objective to avoid mode dropping. On two high-dimensional Bayesian inverse problems, MsIGN approximates the posterior accurately and clearly captures multiple modes, showing superior performance compared with previous deep generative network approaches. On the natural image synthesis task, MsIGN achieves the superior performance in bits-per-dimension compared with our baseline models and yields great interpret-ability of its neurons in intermediate layers.", "code_of_ethics": "I acknowledge that I and all co-authors of this work have read and commit to adhering to the ICLR Code of Ethics", "paperhash": "zhang|multiscale_invertible_generative_networks_for_highdimensional_bayesian_inference", "supplementary_material": "/attachment/eae1692391fbd4c45bce3f65b4ce609b2d18bc2b.zip", "pdf": "/pdf/c1d96c7db981128a60eb30ab88e5706ed7d54e6c.pdf", "reviewed_version_(pdf)": "https://openreview.net/references/pdf?id=1ewipEAc8r", "_bibtex": "@misc{\nzhang2021multiscale,\ntitle={Multiscale Invertible Generative Networks for High-Dimensional Bayesian Inference},\nauthor={Shumao Zhang and Thomas Hou and Pengchuan Zhang},\nyear={2021},\nurl={https://openreview.net/forum?id=RdhjoXl-SDG}\n}"}, "tags": [], "invitation": {"reply": {"content": {"title": {"order": 0, "value-regex": ".{1,500}", "description": "Brief summary of your comment.", "required": true}, "comment": {"order": 1, "value-regex": "[\\S\\s]{1,5000}", "description": "Your comment or reply (max 5000 characters). Add formatting using Markdown and formulas using LaTeX. For more information see https://openreview.net/faq", "required": true, "markdown": true}}, "forum": "RdhjoXl-SDG", "readers": {"description": "Who your comment will be visible to. If replying to a specific person make sure to add the group they are a member of so that they are able to see your response", "values-dropdown": ["ICLR.cc/2021/Conference/Program_Chairs", "ICLR.cc/2021/Conference/Paper2428/Area_Chairs"], "default": ["ICLR.cc/2021/Conference/Program_Chairs", "ICLR.cc/2021/Conference/Paper2428/Area_Chairs"]}, "writers": {"values-copied": ["ICLR.cc/2021/Conference", "{signatures}"]}, "signatures": {"values-regex": "ICLR.cc/2021/Conference/Paper2428/AnonReviewer[0-9]+|ICLR.cc/2021/Conference/Paper2428/Authors|ICLR.cc/2021/Conference/Paper2428/Area_Chair[0-9]+|ICLR.cc/2021/Conference/Program_Chairs", "description": "How your identity will be displayed."}}, "expdate": 1610649480000, "final": [], "readers": ["everyone"], "nonreaders": [], "invitees": ["ICLR.cc/2021/Conference", "ICLR.cc/2021/Conference/Paper2428/Area_Chairs", "ICLR.cc/2021/Conference/Program_Chairs", "OpenReview.net/Support"], "noninvitees": [], "tcdate": 1601923848486, "tmdate": 1610649509835, "super": "ICLR.cc/2021/Conference/-/Comment", "signatures": ["ICLR.cc/2021/Conference"], "writers": ["ICLR.cc/2021/Conference"], "id": "ICLR.cc/2021/Conference/Paper2428/-/Official_Comment"}}}, {"id": "HgeOdAvvkgf", "original": null, "number": 3, "cdate": 1605653789320, "ddate": null, "tcdate": 1605653789320, "tmdate": 1605661960926, "tddate": null, "forum": "RdhjoXl-SDG", "replyto": "y-15D5Yklf0", "invitation": "ICLR.cc/2021/Conference/Paper2428/-/Official_Comment", "content": {"title": "Comment to Reviewer 1", "comment": "Thanks for your careful review and detailed comments. We've updated our manuscript.\n\nHere are our reply to your comments:\n\n- The existence of a prior conditioning operator: When the distribution is odd, for example a singular distribution, the prior conditioning operator will exist but not be necessarily bijective or invertible. However, in Bayesian inference, the posterior distribution has a well-defined density in general. Besides, in those odd cases, we can still construct a prior conditioning operator that approximates the distribution well, rather than exactly captures it. This approximation will be refined by the following invertible flow unit. Theoretically not every distribution has a well-defined prior conditioning operator, but in the practice of Bayesian inference problems with multiscale structure, we expect this issue won’t be a trouble.\n\n- Optimization in Appendix D, repetition, spelling error, figures in vector format: We thank you very much for the suggestions. We’ve revised our manuscript accordingly.\n\n- “$q(x(s1, s2))=q(x(s1, 1-s2))$” does not imply multiple modes: Yes, “$q(x(s1, s2))=q(x(s1, 1-s2))$” is not a sufficient condition to the existence of multiple modes. This design only ensures that we will have a symmetric posterior distribution. To construct a posterior with multiple modes, we need to carefully choose the hyper-parameter $\\alpha$, $\\beta$, $\\sigma_\\varepsilon$, as well as the measurement functions $\\varphi$, and the force term $f$. To certify the multi-modality, we run multiple gradient ascent searching of the posterior, starting from different initial points. We observe that they all converge to two mutually symmetric points $\\mathbf{x}^*$ and $\\tilde{\\mathbf{x}}^*$. We also visualize the 1D landscape profile of the posterior q on the line passing through $\\mathbf{x}^*$ and $\\tilde{\\mathbf{x}}^*$. The profile also shows a clear double-modal feature. We appended more necessary details in our manuscript, see Section 4.1 and Appendix E.\n\n- Showing the worst of 3: For Figure 2(a), we repeat the experiment for 3 times for robustness purpose. Different runs (of a same method) may capture different mode, and thus can be difficult or confusing to visualize. Therefore based on this consideration we only plot 1 out of these 3 runs, and our choice is the the worst of these 3.\n\n- SOTA claim and Table 2: Yes, it may be inadequate to claim the SOTA among all solutions to the image synthesis task. However, to our knowledge, MsIGN gives the best bit-per-dimension value among flow-based generative models. Besides, Routing transformer is an auto-regressive model and has much more number of parameters than ours (80M vs 33M for the ImageNet-64 data set). We also remark that the main focus of MsIGN is to solve the Bayesian inference problems here. We revised our wording to \"achieves superior performance in bits-per-dimension among our baseline models, like Glow (Kingma & Prafulla., 2018), FFJORD (Grathwohl et al., 2018), Flow++ (Ho et al., 2019), i-ResNet(Behrmann et al., 2019), and Residual Flow (Chen et al., 2019)\" in the updated version.\n\n#### References\n\nKingma, Durk P., and Prafulla Dhariwal. \"Glow: Generative flow with invertible 1x1 convolutions.\" Advances in neural information processing systems. 2018.\n\nGrathwohl, Will, et al. \"Ffjord: Free-form continuous dynamics for scalable reversible generative models.\" arXiv preprint arXiv:1810.01367 (2018).\n\nHo, Jonathan, et al. \"Flow++: Improving flow-based generative models with variational dequantization and architecture design.\" arXiv preprint arXiv:1902.00275 (2019).\n\nBehrmann, Jens, et al. \"Invertible residual networks.\" International Conference on Machine Learning. 2019.\n\nChen, Ricky TQ, et al. \"Residual flows for invertible generative modeling.\" Advances in Neural Information Processing Systems. 2019.\n"}, "signatures": ["ICLR.cc/2021/Conference/Paper2428/Authors"], "readers": ["everyone"], "nonreaders": [], "writers": ["ICLR.cc/2021/Conference", "ICLR.cc/2021/Conference/Paper2428/Authors"], "details": {"replyCount": 0, "writable": false, "overwriting": [], "revisions": false, "forumContent": {"title": "Multiscale Invertible Generative Networks for High-Dimensional Bayesian Inference", "authorids": ["~Shumao_Zhang1", "~Thomas_Hou2", "~Pengchuan_Zhang1"], "authors": ["Shumao Zhang", "Thomas Hou", "Pengchuan Zhang"], "keywords": [], "abstract": "High-dimensional Bayesian inference problems cast a long-standing challenge in generating samples, especially when the posterior has multiple modes. For a wide class of Bayesian inference problems equipped with the multiscale structure that low-dimensional (coarse-scale) surrogate can approximate the original high-dimensional (fine-scale) problem well, we propose to train a Multiscale Invertible Generative Network (MsIGN) for sample generation. A novel prior conditioning layer is designed to bridge networks at different resolutions, enabling coarse-to-fine multi-stage training. Jeffreys divergence is adopted as the training objective to avoid mode dropping. On two high-dimensional Bayesian inverse problems, MsIGN approximates the posterior accurately and clearly captures multiple modes, showing superior performance compared with previous deep generative network approaches. On the natural image synthesis task, MsIGN achieves the superior performance in bits-per-dimension compared with our baseline models and yields great interpret-ability of its neurons in intermediate layers.", "code_of_ethics": "I acknowledge that I and all co-authors of this work have read and commit to adhering to the ICLR Code of Ethics", "paperhash": "zhang|multiscale_invertible_generative_networks_for_highdimensional_bayesian_inference", "supplementary_material": "/attachment/eae1692391fbd4c45bce3f65b4ce609b2d18bc2b.zip", "pdf": "/pdf/c1d96c7db981128a60eb30ab88e5706ed7d54e6c.pdf", "reviewed_version_(pdf)": "https://openreview.net/references/pdf?id=1ewipEAc8r", "_bibtex": "@misc{\nzhang2021multiscale,\ntitle={Multiscale Invertible Generative Networks for High-Dimensional Bayesian Inference},\nauthor={Shumao Zhang and Thomas Hou and Pengchuan Zhang},\nyear={2021},\nurl={https://openreview.net/forum?id=RdhjoXl-SDG}\n}"}, "tags": [], "invitation": {"reply": {"content": {"title": {"order": 0, "value-regex": ".{1,500}", "description": "Brief summary of your comment.", "required": true}, "comment": {"order": 1, "value-regex": "[\\S\\s]{1,5000}", "description": "Your comment or reply (max 5000 characters). Add formatting using Markdown and formulas using LaTeX. For more information see https://openreview.net/faq", "required": true, "markdown": true}}, "forum": "RdhjoXl-SDG", "readers": {"description": "Who your comment will be visible to. If replying to a specific person make sure to add the group they are a member of so that they are able to see your response", "values-dropdown": ["ICLR.cc/2021/Conference/Program_Chairs", "ICLR.cc/2021/Conference/Paper2428/Area_Chairs"], "default": ["ICLR.cc/2021/Conference/Program_Chairs", "ICLR.cc/2021/Conference/Paper2428/Area_Chairs"]}, "writers": {"values-copied": ["ICLR.cc/2021/Conference", "{signatures}"]}, "signatures": {"values-regex": "ICLR.cc/2021/Conference/Paper2428/AnonReviewer[0-9]+|ICLR.cc/2021/Conference/Paper2428/Authors|ICLR.cc/2021/Conference/Paper2428/Area_Chair[0-9]+|ICLR.cc/2021/Conference/Program_Chairs", "description": "How your identity will be displayed."}}, "expdate": 1610649480000, "final": [], "readers": ["everyone"], "nonreaders": [], "invitees": ["ICLR.cc/2021/Conference", "ICLR.cc/2021/Conference/Paper2428/Area_Chairs", "ICLR.cc/2021/Conference/Program_Chairs", "OpenReview.net/Support"], "noninvitees": [], "tcdate": 1601923848486, "tmdate": 1610649509835, "super": "ICLR.cc/2021/Conference/-/Comment", "signatures": ["ICLR.cc/2021/Conference"], "writers": ["ICLR.cc/2021/Conference"], "id": "ICLR.cc/2021/Conference/Paper2428/-/Official_Comment"}}}, {"id": "U1xFEv5p8T", "original": null, "number": 1, "cdate": 1603812082036, "ddate": null, "tcdate": 1603812082036, "tmdate": 1605024213440, "tddate": null, "forum": "RdhjoXl-SDG", "replyto": "RdhjoXl-SDG", "invitation": "ICLR.cc/2021/Conference/Paper2428/-/Official_Review", "content": {"title": "I believe the paper has its merits, but frankly I could not understand much", "review": "While the use of an hierarchical flow-based model to obtain samples of finer scales seems interesting, I have to admit that I did not understand much of the setup the authors propose. The methodology section is too dense and many of their claims are not really motivated at all. \n\nI do not see this paper accepted the way it is, but it might be true that a person more expert in flow-based models and inference than me thinks completely the opposite.", "rating": "5: Marginally below acceptance threshold", "confidence": "1: The reviewer's evaluation is an educated guess"}, "signatures": ["ICLR.cc/2021/Conference/Paper2428/AnonReviewer3"], "readers": ["everyone"], "nonreaders": [], "writers": ["ICLR.cc/2021/Conference", "ICLR.cc/2021/Conference/Paper2428/AnonReviewer3"], "details": {"replyCount": 0, "writable": false, "overwriting": [], "revisions": false, "forumContent": {"title": "Multiscale Invertible Generative Networks for High-Dimensional Bayesian Inference", "authorids": ["~Shumao_Zhang1", "~Thomas_Hou2", "~Pengchuan_Zhang1"], "authors": ["Shumao Zhang", "Thomas Hou", "Pengchuan Zhang"], "keywords": [], "abstract": "High-dimensional Bayesian inference problems cast a long-standing challenge in generating samples, especially when the posterior has multiple modes. For a wide class of Bayesian inference problems equipped with the multiscale structure that low-dimensional (coarse-scale) surrogate can approximate the original high-dimensional (fine-scale) problem well, we propose to train a Multiscale Invertible Generative Network (MsIGN) for sample generation. A novel prior conditioning layer is designed to bridge networks at different resolutions, enabling coarse-to-fine multi-stage training. Jeffreys divergence is adopted as the training objective to avoid mode dropping. On two high-dimensional Bayesian inverse problems, MsIGN approximates the posterior accurately and clearly captures multiple modes, showing superior performance compared with previous deep generative network approaches. On the natural image synthesis task, MsIGN achieves the superior performance in bits-per-dimension compared with our baseline models and yields great interpret-ability of its neurons in intermediate layers.", "code_of_ethics": "I acknowledge that I and all co-authors of this work have read and commit to adhering to the ICLR Code of Ethics", "paperhash": "zhang|multiscale_invertible_generative_networks_for_highdimensional_bayesian_inference", "supplementary_material": "/attachment/eae1692391fbd4c45bce3f65b4ce609b2d18bc2b.zip", "pdf": "/pdf/c1d96c7db981128a60eb30ab88e5706ed7d54e6c.pdf", "reviewed_version_(pdf)": "https://openreview.net/references/pdf?id=1ewipEAc8r", "_bibtex": "@misc{\nzhang2021multiscale,\ntitle={Multiscale Invertible Generative Networks for High-Dimensional Bayesian Inference},\nauthor={Shumao Zhang and Thomas Hou and Pengchuan Zhang},\nyear={2021},\nurl={https://openreview.net/forum?id=RdhjoXl-SDG}\n}"}, "tags": [], "invitation": {"reply": {"content": {"title": {"order": 1, "value-regex": ".{0,500}", "description": "Brief summary of your review.", "required": true}, "review": {"order": 2, "value-regex": "[\\S\\s]{1,200000}", "description": "Please provide an evaluation of the quality, clarity, originality and significance of this work, including a list of its pros and cons (max 200000 characters). Add formatting using Markdown and formulas using LaTeX. For more information see https://openreview.net/faq . ***Please remember to file the Code-of-Ethics report. Once you submitted the review, a link to the report will be visible in the bottom right corner of your review.***", "required": true, "markdown": true}, "rating": {"order": 3, "value-dropdown": ["10: Top 5% of accepted papers, seminal paper", "9: Top 15% of accepted papers, strong accept", "8: Top 50% of accepted papers, clear accept", "7: Good paper, accept", "6: Marginally above acceptance threshold", "5: Marginally below acceptance threshold", "4: Ok but not good enough - rejection", "3: Clear rejection", "2: Strong rejection", "1: Trivial or wrong"], "required": true}, "confidence": {"order": 4, "value-radio": ["5: The reviewer is absolutely certain that the evaluation is correct and very familiar with the relevant literature", "4: The reviewer is confident but not absolutely certain that the evaluation is correct", "3: The reviewer is fairly confident that the evaluation is correct", "2: The reviewer is willing to defend the evaluation, but it is quite likely that the reviewer did not understand central parts of the paper", "1: The reviewer's evaluation is an educated guess"], "required": true}}, "forum": "RdhjoXl-SDG", "replyto": "RdhjoXl-SDG", "readers": {"description": "Select all user groups that should be able to read this comment.", "values": ["everyone"]}, "nonreaders": {"values": []}, "writers": {"values-copied": ["ICLR.cc/2021/Conference", "{signatures}"], "description": "How your identity will be displayed."}, "signatures": {"values-regex": "ICLR.cc/2021/Conference/Paper2428/AnonReviewer[0-9]+", "description": "How your identity will be displayed."}}, "expdate": 1607428800000, "duedate": 1606752000000, "multiReply": false, "readers": ["everyone"], "tcdate": 1602538096576, "tmdate": 1606915797203, "super": "ICLR.cc/2021/Conference/-/Official_Review", "signatures": ["OpenReview.net"], "writers": ["ICLR.cc/2021/Conference"], "invitees": ["ICLR.cc/2021/Conference/Paper2428/Reviewers", "OpenReview.net/Support"], "id": "ICLR.cc/2021/Conference/Paper2428/-/Official_Review"}}}, {"id": "y-15D5Yklf0", "original": null, "number": 3, "cdate": 1604096703567, "ddate": null, "tcdate": 1604096703567, "tmdate": 1605024213374, "tddate": null, "forum": "RdhjoXl-SDG", "replyto": "RdhjoXl-SDG", "invitation": "ICLR.cc/2021/Conference/Paper2428/-/Official_Review", "content": {"title": "Multiscale Invertible Generative Networks for High-Dimensional Bayesian Inference", "review": "The authors propose a multi-scale method to design invertible network and apply it to bayesian inverse problems.\n\nThe method itself is quite concise and beautiful in its simplicity (a nice case of “obvious once you see it”), and looks rather simple to implement. The results are also rather promising.\n\nWith that said, there are some steps that are lacking. Notably the results leave some things open (e.g. the SotA-ness is highly debatable given more recent methods such as routing transformers) and for the Bayesian inverse problems it’s hard to judge given that the only baselines are “in house” rather than externally defined. I also find the theoretical exposition to be a bit hard to follow, especially given the generous use of appendices.\n\nI have some further comments:\n\n* The existence of a prior conditioning operator in the general case seems somewhat debatable (consider odd cases like singular distributions, distributions with weird topologies and discrete distributions), I’m quite sure you need at least some further conditions. I’d also be fine with a “if it exists” style statement.\n* The optimisation described in appendix D is quite critical to the method as is (especially since using Jeffreys divergence is even mentioned in the abstract as a main point) and should be in the body of the article.\n* The statement “the subsurface flow simulation at the scale of meters approximates well the simulation at the scale of centimeters” is more or less repeated twice verbatim. It’s also not the most accessible example.\n* Spelling errors like dimebsion, groundtruth. Overall the language could use some polishing throughout the article.\n* All figures should be in vector format\n* The statement “ q(x(s1, s2)) = q(x(s1, 1 − s2))” does not afaik imply more than one mode, consider e.g. a mode centered at s2=0.5.\n* Showing the “worst of 3” seems rather dishonest. Why was this done?\n* Table 2 is quite lacking, several SotA methods are not in there (which makes this method not SotA).\n", "rating": "6: Marginally above acceptance threshold", "confidence": "3: The reviewer is fairly confident that the evaluation is correct"}, "signatures": ["ICLR.cc/2021/Conference/Paper2428/AnonReviewer1"], "readers": ["everyone"], "nonreaders": [], "writers": ["ICLR.cc/2021/Conference", "ICLR.cc/2021/Conference/Paper2428/AnonReviewer1"], "details": {"replyCount": 0, "writable": false, "overwriting": [], "revisions": false, "forumContent": {"title": "Multiscale Invertible Generative Networks for High-Dimensional Bayesian Inference", "authorids": ["~Shumao_Zhang1", "~Thomas_Hou2", "~Pengchuan_Zhang1"], "authors": ["Shumao Zhang", "Thomas Hou", "Pengchuan Zhang"], "keywords": [], "abstract": "High-dimensional Bayesian inference problems cast a long-standing challenge in generating samples, especially when the posterior has multiple modes. For a wide class of Bayesian inference problems equipped with the multiscale structure that low-dimensional (coarse-scale) surrogate can approximate the original high-dimensional (fine-scale) problem well, we propose to train a Multiscale Invertible Generative Network (MsIGN) for sample generation. A novel prior conditioning layer is designed to bridge networks at different resolutions, enabling coarse-to-fine multi-stage training. Jeffreys divergence is adopted as the training objective to avoid mode dropping. On two high-dimensional Bayesian inverse problems, MsIGN approximates the posterior accurately and clearly captures multiple modes, showing superior performance compared with previous deep generative network approaches. On the natural image synthesis task, MsIGN achieves the superior performance in bits-per-dimension compared with our baseline models and yields great interpret-ability of its neurons in intermediate layers.", "code_of_ethics": "I acknowledge that I and all co-authors of this work have read and commit to adhering to the ICLR Code of Ethics", "paperhash": "zhang|multiscale_invertible_generative_networks_for_highdimensional_bayesian_inference", "supplementary_material": "/attachment/eae1692391fbd4c45bce3f65b4ce609b2d18bc2b.zip", "pdf": "/pdf/c1d96c7db981128a60eb30ab88e5706ed7d54e6c.pdf", "reviewed_version_(pdf)": "https://openreview.net/references/pdf?id=1ewipEAc8r", "_bibtex": "@misc{\nzhang2021multiscale,\ntitle={Multiscale Invertible Generative Networks for High-Dimensional Bayesian Inference},\nauthor={Shumao Zhang and Thomas Hou and Pengchuan Zhang},\nyear={2021},\nurl={https://openreview.net/forum?id=RdhjoXl-SDG}\n}"}, "tags": [], "invitation": {"reply": {"content": {"title": {"order": 1, "value-regex": ".{0,500}", "description": "Brief summary of your review.", "required": true}, "review": {"order": 2, "value-regex": "[\\S\\s]{1,200000}", "description": "Please provide an evaluation of the quality, clarity, originality and significance of this work, including a list of its pros and cons (max 200000 characters). Add formatting using Markdown and formulas using LaTeX. For more information see https://openreview.net/faq . ***Please remember to file the Code-of-Ethics report. Once you submitted the review, a link to the report will be visible in the bottom right corner of your review.***", "required": true, "markdown": true}, "rating": {"order": 3, "value-dropdown": ["10: Top 5% of accepted papers, seminal paper", "9: Top 15% of accepted papers, strong accept", "8: Top 50% of accepted papers, clear accept", "7: Good paper, accept", "6: Marginally above acceptance threshold", "5: Marginally below acceptance threshold", "4: Ok but not good enough - rejection", "3: Clear rejection", "2: Strong rejection", "1: Trivial or wrong"], "required": true}, "confidence": {"order": 4, "value-radio": ["5: The reviewer is absolutely certain that the evaluation is correct and very familiar with the relevant literature", "4: The reviewer is confident but not absolutely certain that the evaluation is correct", "3: The reviewer is fairly confident that the evaluation is correct", "2: The reviewer is willing to defend the evaluation, but it is quite likely that the reviewer did not understand central parts of the paper", "1: The reviewer's evaluation is an educated guess"], "required": true}}, "forum": "RdhjoXl-SDG", "replyto": "RdhjoXl-SDG", "readers": {"description": "Select all user groups that should be able to read this comment.", "values": ["everyone"]}, "nonreaders": {"values": []}, "writers": {"values-copied": ["ICLR.cc/2021/Conference", "{signatures}"], "description": "How your identity will be displayed."}, "signatures": {"values-regex": "ICLR.cc/2021/Conference/Paper2428/AnonReviewer[0-9]+", "description": "How your identity will be displayed."}}, "expdate": 1607428800000, "duedate": 1606752000000, "multiReply": false, "readers": ["everyone"], "tcdate": 1602538096576, "tmdate": 1606915797203, "super": "ICLR.cc/2021/Conference/-/Official_Review", "signatures": ["OpenReview.net"], "writers": ["ICLR.cc/2021/Conference"], "invitees": ["ICLR.cc/2021/Conference/Paper2428/Reviewers", "OpenReview.net/Support"], "id": "ICLR.cc/2021/Conference/Paper2428/-/Official_Review"}}}], "count": 9}