{"notes": [{"tddate": null, "ddate": null, "cdate": null, "tmdate": 1486396657790, "tcdate": 1486396657790, "number": 1, "id": "S1clpGU_g", "invitation": "ICLR.cc/2017/conference/-/paper526/acceptance", "forum": "SJ_QCYqle", "replyto": "SJ_QCYqle", "signatures": ["ICLR.cc/2017/pcs"], "readers": ["everyone"], "writers": ["ICLR.cc/2017/pcs"], "content": {"decision": "Reject", "title": "ICLR committee final decision", "comment": "The paper addresses the little explored domain (at least from computer vision perspective) of analyzing weather data. All reviewers found the application interesting, yet felt that the technical side was somewhat standard. On the positive note, the authors try to use semi-supervised techniques due to limited labeled data, which is less explored in the object detection domain. The also released code, which is a plus. Overall, the application is nice, however, none of the reviewers was swayed by the paper. I suggest that the authors re-submit their work to a vision conference, where applications like this may be more enthusiastically received."}, "nonreaders": [], "details": {"replyCount": 0, "writable": false, "overwriting": [], "revisions": false, "forumContent": {"title": "Semi-Supervised Detection of Extreme Weather Events in Large Climate Datasets", "abstract": "The detection and identification of extreme weather events in large scale climate simulations is an important problem for risk management, informing governmental policy decisions and advancing our basic understanding of the climate system.\nRecent work has shown that fully supervised convolutional neural networks (CNNs) can yield acceptable accuracy for classifying well-known types of extreme weather events when large amounts of labeled data are available. However, there are many different types of spatially localized climate patterns of interest (including hurricanes, extra-tropical cyclones, weather fronts, blocking events, etc.)\nfound in simulation data for which labeled data is not available at large scale for all simulations of interest.\nWe present a multichannel spatiotemporal encoder-decoder CNN architecture for semi-supervised bounding box prediction and exploratory data analysis.\nThis architecture is designed to fully model multi-channel simulation data, temporal dynamics and unlabelled data within a reconstruction and prediction framework so as to improve the detection of a wide range of extreme weather events. \nOur architecture can be viewed as a 3D convolutional autoencoder with an additional modified one-pass bounding box regression loss. \nWe demonstrate that our approach is able to leverage temporal information and unlabelled data to improve localization of extreme weather events. Further, we explore the representations learned by our model in order to better understand this important data, and facilitate further work in understanding and mitigating the effects of climate change.", "pdf": "/pdf/2d086f27e4b8a6596725a5093860f01f15341506.pdf", "TL;DR": "Semi-supervised 3D CNN's improve bounding box detection of weather events in climate simulations compared to supervised approaches.", "paperhash": "racah|semisupervised_detection_of_extreme_weather_events_in_large_climate_datasets", "keywords": ["Semi-Supervised Learning", "Applications", "Computer vision"], "conflicts": ["lbl.gov", "polymtl.ca"], "authors": ["Evan Racah", "Christopher Beckham", "Tegan Maharaj", "Prabhat", "Christopher Pal"], "authorids": ["eracah@lbl.gov", "christopher.beckham@polymtl.ca", "tegan.maharaj@polymtl.ca", "prabhat@lbl.gov", "christopher.pal@polymtl.ca"]}, "tags": [], "invitation": {"rdate": null, "duedate": null, "tddate": null, "ddate": null, "tmdate": 1486396658260, "id": "ICLR.cc/2017/conference/-/paper526/acceptance", "writers": ["ICLR.cc/2017/conference"], "signatures": ["ICLR.cc/2017/conference"], "readers": ["everyone"], "invitees": ["ICLR.cc/2017/pcs"], "noninvitees": ["ICLR.cc/2017/pcs"], "reply": {"forum": "SJ_QCYqle", "replyto": "SJ_QCYqle", "writers": {"values-regex": "ICLR.cc/2017/pcs"}, "signatures": {"values-regex": "ICLR.cc/2017/pcs", "description": "Your displayed identity associated with the above content."}, "readers": {"description": "The users who will be allowed to read the above content.", "values": ["everyone"]}, "content": {"title": {"order": 1, "description": "Brief summary of your decision.", "value": "ICLR committee final decision"}, "comment": {"required": true, "order": 2, "description": "Decision comments.", "value-regex": "[\\S\\s]{1,5000}"}, "decision": {"required": true, "order": 3, "value-radio": ["Accept (Oral)", "Accept (Poster)", "Reject", "Invite to Workshop Track"]}}}, "nonreaders": [], "cdate": 1486396658260}}}, {"tddate": null, "tmdate": 1485310166909, "tcdate": 1481934378344, "number": 2, "id": "BkfVLbMEx", "invitation": "ICLR.cc/2017/conference/-/paper526/official/review", "forum": "SJ_QCYqle", "replyto": "SJ_QCYqle", "signatures": ["ICLR.cc/2017/conference/paper526/AnonReviewer2"], "readers": ["everyone"], "writers": ["ICLR.cc/2017/conference/paper526/AnonReviewer2"], "content": {"title": "review", "rating": "6: Marginally above acceptance threshold", "review": "[EDIT: The thoughtful author responses addressed my major concerns. The github links for data and code will be really helpful for reproducing results (I haven't looked carefully, but this is great). The revision addressed many issues, including the additional results. As such I am upgrading my rating from a 5 to a 6 and recommend acceptance of the paper.]\n\nThe paper proposes to apply deep nets to perform detection and localization of extreme weather events in simulated weather data. The problem is related to object detection in computer vision in that the input is a 2D “image” (multichannel spatial weather data) or 3D “video” (temporal version of the data) and the output is a bounding box (spatial-temporal localization of a weather event) and class label (weather event type). It differs from standard object detection in that the input has multiple heterogenous channels and labeled data is scarce.\n\nA simple but quite reasonable deep net is proposed for the task based on similar approaches in computer vision. While proposal based systems are most popular in vision currently (in particular Faster-RCNN) the proposed approach is simple and a fine starting point. There is little innovation on the part of the detection system, but as noted, it is a valid application of ideas from computer vision to the task at hand. \n\nThe authors propose both a supervised approach (only ground truth bounding box location/label is used) and a semi-supervised approach that additionally incorporates the reconstruction loss as a regularization. In all cases the losses are fairly standard and again, reasonable. The only confusing bit is that the “semi-supervised” loss actually has all the labels used for the “supervised” loss and additionally incorporates the reconstruction loss. Hence, the “semi-supervised” loss is actually stronger, which makes the terminology a bit confusing.\n\nThe paper is easy to follow, but notation is sloppy. For example, above equation 5 it states that “the loss is a weighted combination of reconstruction error and bounding box regression loss”; actually it’s a combination of the supervised and unsupervised loss (Lsup and Lunsup), and Lrec is not defined (although I assume Lrec=Lunsup). The paper is fairly non-technical, but nevertheless these minor issues should be fixed. (E.g., see also reference to “figure 4 and 4”). \n\nThe biggest concern w the paper though is experimental results. Only a single figure and table of results are shown (figure 4 and table 4). The metrics are not defined (what is mean average recall?). Only 2D versus 3D version of the model are shown, and supervised and semi-supervised. Moreover, numbers seem a bit all over the place, without consistent patterns (e.g., why is 2D supervised better than the seemingly much strong 3D semi-supervised?). One of the things that is unclear is how many events are actually in the training/testing data, and more importantly, how good are these results in absolute terms? Regardless, the experiments are fairly sparse and ablation studies and more discussion lacking. It is also unclear if future researchers will be able to reproduce the experimental setting (a commitment to open-source the data or a way to reproduce the experiments would be critical for future authors).\n\nMinor nit: the authors use both a classification loss and an “objectness” loss. I’ve never seen both used together like this (normally objectness is used in two-stage object proposal systems where in the first stage class-agnostic proposals are given and in the second stage these are cropped and a class-specific classifier is applied). I strongly suspect removing the objectness loss would not impact results since the classification loss should provide strictly stronger supervisory signal. Regardless, this is a fairly non-standard choice and should be justified (experimentally).\n\nOverall this is a borderline paper. I do believe that it is valuable to apply computer vision techniques to a domain that I’ve see little work on in our community. That being said, I have no expertise on this type of data -- it’s possible this deep learning techniques are now routinely used in the climate science literature (I suspect not, though). Overall, there is little novelty on the algorithmic side in this paper (the equations in section 3 are commonly used in the cv literature). The use of reconstruction loss to improve results in the data-sparse setting is interesting, but the experimental results are inconclusive. The experimental validation is generally insufficient. Reproducibility for future research is difficult unless the data is open-sourced. Overall, I think this paper is a good start, and with improved experiments and more careful writing I think could eventually make for a decent paper.", "confidence": "3: The reviewer is fairly confident that the evaluation is correct"}, "nonreaders": [], "details": {"replyCount": 0, "writable": false, "overwriting": [], "revisions": false, "forumContent": {"title": "Semi-Supervised Detection of Extreme Weather Events in Large Climate Datasets", "abstract": "The detection and identification of extreme weather events in large scale climate simulations is an important problem for risk management, informing governmental policy decisions and advancing our basic understanding of the climate system.\nRecent work has shown that fully supervised convolutional neural networks (CNNs) can yield acceptable accuracy for classifying well-known types of extreme weather events when large amounts of labeled data are available. However, there are many different types of spatially localized climate patterns of interest (including hurricanes, extra-tropical cyclones, weather fronts, blocking events, etc.)\nfound in simulation data for which labeled data is not available at large scale for all simulations of interest.\nWe present a multichannel spatiotemporal encoder-decoder CNN architecture for semi-supervised bounding box prediction and exploratory data analysis.\nThis architecture is designed to fully model multi-channel simulation data, temporal dynamics and unlabelled data within a reconstruction and prediction framework so as to improve the detection of a wide range of extreme weather events. \nOur architecture can be viewed as a 3D convolutional autoencoder with an additional modified one-pass bounding box regression loss. \nWe demonstrate that our approach is able to leverage temporal information and unlabelled data to improve localization of extreme weather events. Further, we explore the representations learned by our model in order to better understand this important data, and facilitate further work in understanding and mitigating the effects of climate change.", "pdf": "/pdf/2d086f27e4b8a6596725a5093860f01f15341506.pdf", "TL;DR": "Semi-supervised 3D CNN's improve bounding box detection of weather events in climate simulations compared to supervised approaches.", "paperhash": "racah|semisupervised_detection_of_extreme_weather_events_in_large_climate_datasets", "keywords": ["Semi-Supervised Learning", "Applications", "Computer vision"], "conflicts": ["lbl.gov", "polymtl.ca"], "authors": ["Evan Racah", "Christopher Beckham", "Tegan Maharaj", "Prabhat", "Christopher Pal"], "authorids": ["eracah@lbl.gov", "christopher.beckham@polymtl.ca", "tegan.maharaj@polymtl.ca", "prabhat@lbl.gov", "christopher.pal@polymtl.ca"]}, "tags": [], "invitation": {"rdate": null, "tddate": null, "ddate": null, "duedate": 1481932799000, "tmdate": 1482512554261, "id": "ICLR.cc/2017/conference/-/paper526/official/review", "writers": ["ICLR.cc/2017/conference"], "signatures": ["ICLR.cc/2017/conference"], "readers": ["everyone"], "invitees": ["ICLR.cc/2017/conference/paper526/reviewers"], "noninvitees": ["ICLR.cc/2017/conference/paper526/AnonReviewer3", "ICLR.cc/2017/conference/paper526/AnonReviewer2", "ICLR.cc/2017/conference/paper526/AnonReviewer1"], "reply": {"forum": "SJ_QCYqle", "replyto": "SJ_QCYqle", "writers": {"values-regex": "ICLR.cc/2017/conference/paper526/AnonReviewer[0-9]+"}, "signatures": {"values-regex": "ICLR.cc/2017/conference/paper526/AnonReviewer[0-9]+"}, "readers": {"description": "The users who will be allowed to read the above content.", "values": ["everyone"]}, "content": {"title": {"order": 1, "description": "Brief summary of your review.", "value-regex": ".{0,500}"}, "review": {"order": 2, "description": "Please provide an evaluation of the quality, clarity, originality and significance of this work, including a list of its pros and cons.", "value-regex": "[\\S\\s]{1,20000}"}, "rating": {"order": 3, "value-dropdown": ["10: Top 5% of accepted papers, seminal paper", "9: Top 15% of accepted papers, strong accept", "8: Top 50% of accepted papers, clear accept", "7: Good paper, accept", "6: Marginally above acceptance threshold", "5: Marginally below acceptance threshold", "4: Ok but not good enough - rejection", "3: Clear rejection", "2: Strong rejection", "1: Trivial or wrong"]}, "confidence": {"order": 4, "value-radio": ["5: The reviewer is absolutely certain that the evaluation is correct and very familiar with the relevant literature", "4: The reviewer is confident but not absolutely certain that the evaluation is correct", "3: The reviewer is fairly confident that the evaluation is correct", "2: The reviewer is willing to defend the evaluation, but it is quite likely that the reviewer did not understand central parts of the paper", "1: The reviewer's evaluation is an educated guess"]}}}, "nonreaders": [], "expdate": 1489708799000, "cdate": 1482512554261}}}, {"tddate": null, "tmdate": 1485272343725, "tcdate": 1481908885293, "number": 1, "id": "HkaczsZNg", "invitation": "ICLR.cc/2017/conference/-/paper526/official/review", "forum": "SJ_QCYqle", "replyto": "SJ_QCYqle", "signatures": ["ICLR.cc/2017/conference/paper526/AnonReviewer3"], "readers": ["everyone"], "writers": ["ICLR.cc/2017/conference/paper526/AnonReviewer3"], "content": {"title": "Review", "rating": "4: Ok but not good enough - rejection", "review": "This work presents a novel 3D CNN architecture for climate event detection that combines an unsupervised auto-encoder reconstruction loss with YOLO like bounding box prediction. The approach is trained and evaluated on a large-scale, simulated climate dataset labeled by a costly heuristic approach called TECA. \n\nFor the most part, the paper is nicely written (minor comments below) and addresses an important and well motivated problem. The authors provide sufficient model details to allow reproduction (although public code would be preferred). I find the experiments a bit unconvincing (see below) but appreciate the attention to model capacity (via number of parameter) when comparing the 2D and 3D model variants.\n\nI am concerned that the evaluation may be insufficient to assess the effectiveness of this method. An IoU threshold of 0.1 allows for many rather poor detections to count as true positives. If the goal of this work is to count the number of such instances this is defensible, but for localization this seems overly loose.Furthermore, the 3D CNN architecture (which is one of the the core novelties of this work compared to past efforts) does not seem capable of producing variable sized boxes (as noted in the last paragraph of page 7), which I imagine results in poorer performance at higher IoU thresholds (as many of the weather events appear small). \nThe experiments also feel inconclusive about the effect of temporal modeling and semi-supervision. The temporal component does not seem to matter in the supervised settings (2D 51.45 mAP - 3D 51.00 mAP) but improves somewhat in the semi-supervised case (2D 51.11 mAP - 3D 52.92 mAP). Whereas the additional unlabeled data seems to hurt in the 2D case but improve results for the 3D model. Could the authors provide confidence intervals for these numbers? I would like to see further discussion of these trends especially with respect to the effect of the loss weights (alpha, beta, and gamma). \n\nI also note that it is not clear if both the 2D and 3D models were trained for equivalent time periods (seems like no from last paragraph of page 7). Could a plot of training and validation accuracy for each model be presented for comparison? \n\nFinally, is there any baseline approach the authors could report or compare too? Without one, it is difficult to evaluate the performance of the approach with respect to the difficulty of the problem.\n\nPreliminary Rating:\nI think this is an interesting paper that is well motivated but feel the experiments as presented do not seem adequate to support any conclusive trends. I would like to see the mAP trends across a wider range of IoU values and further discussion of training procedure, loss weight settings, and reasons for lack of bounding box variability in the 3D model (as stated above). \n\nClarification:\nIn the paper you say \"While climate models are run on a 3D grid, with the vertical dimension corresponding to 30 levels; we only consider surface quantities (i.e. 2D data) in this study.\" Could you elaborate on what the surface quantities correspond to? Is it the highest cloud level?\n\nMinor notes:\n\tPlease provide years for Prabhat et al. references rather than a and b.\n\tFootnote in 4.2 could be inline text with similar space.\n\t4.3 second paragraph the word table is not capitalized like elsewhere.\n\t4.3 4th paragraph the word section is not capitalized like elsewhere.\n\nEdit: I appreciate the authors responding to my questions but still feel the relatively poor localization performance at stricter IoU thresholds fails to justify the complexity of the approach. I encourage the authors to continue pursuing this line of research.", "confidence": "4: The reviewer is confident but not absolutely certain that the evaluation is correct"}, "nonreaders": [], "details": {"replyCount": 0, "writable": false, "overwriting": [], "revisions": false, "forumContent": {"title": "Semi-Supervised Detection of Extreme Weather Events in Large Climate Datasets", "abstract": "The detection and identification of extreme weather events in large scale climate simulations is an important problem for risk management, informing governmental policy decisions and advancing our basic understanding of the climate system.\nRecent work has shown that fully supervised convolutional neural networks (CNNs) can yield acceptable accuracy for classifying well-known types of extreme weather events when large amounts of labeled data are available. However, there are many different types of spatially localized climate patterns of interest (including hurricanes, extra-tropical cyclones, weather fronts, blocking events, etc.)\nfound in simulation data for which labeled data is not available at large scale for all simulations of interest.\nWe present a multichannel spatiotemporal encoder-decoder CNN architecture for semi-supervised bounding box prediction and exploratory data analysis.\nThis architecture is designed to fully model multi-channel simulation data, temporal dynamics and unlabelled data within a reconstruction and prediction framework so as to improve the detection of a wide range of extreme weather events. \nOur architecture can be viewed as a 3D convolutional autoencoder with an additional modified one-pass bounding box regression loss. \nWe demonstrate that our approach is able to leverage temporal information and unlabelled data to improve localization of extreme weather events. Further, we explore the representations learned by our model in order to better understand this important data, and facilitate further work in understanding and mitigating the effects of climate change.", "pdf": "/pdf/2d086f27e4b8a6596725a5093860f01f15341506.pdf", "TL;DR": "Semi-supervised 3D CNN's improve bounding box detection of weather events in climate simulations compared to supervised approaches.", "paperhash": "racah|semisupervised_detection_of_extreme_weather_events_in_large_climate_datasets", "keywords": ["Semi-Supervised Learning", "Applications", "Computer vision"], "conflicts": ["lbl.gov", "polymtl.ca"], "authors": ["Evan Racah", "Christopher Beckham", "Tegan Maharaj", "Prabhat", "Christopher Pal"], "authorids": ["eracah@lbl.gov", "christopher.beckham@polymtl.ca", "tegan.maharaj@polymtl.ca", "prabhat@lbl.gov", "christopher.pal@polymtl.ca"]}, "tags": [], "invitation": {"rdate": null, "tddate": null, "ddate": null, "duedate": 1481932799000, "tmdate": 1482512554261, "id": "ICLR.cc/2017/conference/-/paper526/official/review", "writers": ["ICLR.cc/2017/conference"], "signatures": ["ICLR.cc/2017/conference"], "readers": ["everyone"], "invitees": ["ICLR.cc/2017/conference/paper526/reviewers"], "noninvitees": ["ICLR.cc/2017/conference/paper526/AnonReviewer3", "ICLR.cc/2017/conference/paper526/AnonReviewer2", "ICLR.cc/2017/conference/paper526/AnonReviewer1"], "reply": {"forum": "SJ_QCYqle", "replyto": "SJ_QCYqle", "writers": {"values-regex": "ICLR.cc/2017/conference/paper526/AnonReviewer[0-9]+"}, "signatures": {"values-regex": "ICLR.cc/2017/conference/paper526/AnonReviewer[0-9]+"}, "readers": {"description": "The users who will be allowed to read the above content.", "values": ["everyone"]}, "content": {"title": {"order": 1, "description": "Brief summary of your review.", "value-regex": ".{0,500}"}, "review": {"order": 2, "description": "Please provide an evaluation of the quality, clarity, originality and significance of this work, including a list of its pros and cons.", "value-regex": "[\\S\\s]{1,20000}"}, "rating": {"order": 3, "value-dropdown": ["10: Top 5% of accepted papers, seminal paper", "9: Top 15% of accepted papers, strong accept", "8: Top 50% of accepted papers, clear accept", "7: Good paper, accept", "6: Marginally above acceptance threshold", "5: Marginally below acceptance threshold", "4: Ok but not good enough - rejection", "3: Clear rejection", "2: Strong rejection", "1: Trivial or wrong"]}, "confidence": {"order": 4, "value-radio": ["5: The reviewer is absolutely certain that the evaluation is correct and very familiar with the relevant literature", "4: The reviewer is confident but not absolutely certain that the evaluation is correct", "3: The reviewer is fairly confident that the evaluation is correct", "2: The reviewer is willing to defend the evaluation, but it is quite likely that the reviewer did not understand central parts of the paper", "1: The reviewer's evaluation is an educated guess"]}}}, "nonreaders": [], "expdate": 1489708799000, "cdate": 1482512554261}}}, {"tddate": null, "tmdate": 1484356654137, "tcdate": 1484356654137, "number": 5, "id": "BJLVneP8l", "invitation": "ICLR.cc/2017/conference/-/paper526/public/comment", "forum": "SJ_QCYqle", "replyto": "Bk28SarVl", "signatures": ["~Evan_Racah1"], "readers": ["everyone"], "writers": ["~Evan_Racah1"], "content": {"title": "response to review", "comment": "Thank you very much for your feedback and kind words! Below, we respond to some points made:\n\nR: “Minor: table 4 -- shouldn’t the semi-supervised models have more parameters than the corresponding supervised ones due to the decoder layers?”\n\nA: The decoder part of the model uses tied weights, so no additional parameters are introduced in the semi-supervised formulation of the network\n\nR: “As other reviewers pointed out, the use of the 0.1 IoU criterion for true positives is very loose relative to the standard 0.5 criterion.  On the other hand, if the results visualized in Figure 3 are typical, a 0.1 overlap criterion could be reasonable for this domain as the detector does seem to localize events well enough that the system could be used to expedite human review of the climate images for extreme events.  Still, it would be useful to also report results at higher overlap thresholds.”\n\nA: The results are still useful to climate scientists, but the more accurate the detections the better. We have included results for IOU 0.5 in a third revision on January 13 and an interpretation of those results.\n\nThanks again!"}, "nonreaders": [], "details": {"replyCount": 0, "writable": false, "overwriting": [], "revisions": false, "forumContent": {"title": "Semi-Supervised Detection of Extreme Weather Events in Large Climate Datasets", "abstract": "The detection and identification of extreme weather events in large scale climate simulations is an important problem for risk management, informing governmental policy decisions and advancing our basic understanding of the climate system.\nRecent work has shown that fully supervised convolutional neural networks (CNNs) can yield acceptable accuracy for classifying well-known types of extreme weather events when large amounts of labeled data are available. However, there are many different types of spatially localized climate patterns of interest (including hurricanes, extra-tropical cyclones, weather fronts, blocking events, etc.)\nfound in simulation data for which labeled data is not available at large scale for all simulations of interest.\nWe present a multichannel spatiotemporal encoder-decoder CNN architecture for semi-supervised bounding box prediction and exploratory data analysis.\nThis architecture is designed to fully model multi-channel simulation data, temporal dynamics and unlabelled data within a reconstruction and prediction framework so as to improve the detection of a wide range of extreme weather events. \nOur architecture can be viewed as a 3D convolutional autoencoder with an additional modified one-pass bounding box regression loss. \nWe demonstrate that our approach is able to leverage temporal information and unlabelled data to improve localization of extreme weather events. Further, we explore the representations learned by our model in order to better understand this important data, and facilitate further work in understanding and mitigating the effects of climate change.", "pdf": "/pdf/2d086f27e4b8a6596725a5093860f01f15341506.pdf", "TL;DR": "Semi-supervised 3D CNN's improve bounding box detection of weather events in climate simulations compared to supervised approaches.", "paperhash": "racah|semisupervised_detection_of_extreme_weather_events_in_large_climate_datasets", "keywords": ["Semi-Supervised Learning", "Applications", "Computer vision"], "conflicts": ["lbl.gov", "polymtl.ca"], "authors": ["Evan Racah", "Christopher Beckham", "Tegan Maharaj", "Prabhat", "Christopher Pal"], "authorids": ["eracah@lbl.gov", "christopher.beckham@polymtl.ca", "tegan.maharaj@polymtl.ca", "prabhat@lbl.gov", "christopher.pal@polymtl.ca"]}, "tags": [], "invitation": {"rdate": null, "duedate": null, "tddate": null, "ddate": null, "tmdate": 1485287536710, "id": "ICLR.cc/2017/conference/-/paper526/public/comment", "writers": ["ICLR.cc/2017/conference"], "signatures": ["ICLR.cc/2017/conference"], "readers": ["everyone"], "invitees": ["~"], "reply": {"forum": "SJ_QCYqle", "writers": {"values-regex": "~.*|\\(anonymous\\)"}, "signatures": {"values-regex": "~.*|\\(anonymous\\)", "description": "How your identity will be displayed with the above content."}, "readers": {"description": "The users who will be allowed to read the above content.", "value-dropdown": ["everyone", "ICLR.cc/2017/conference/organizers", "ICLR.cc/2017/conference/ACs_and_organizers", "ICLR.cc/2017/conference/reviewers_and_ACS_and_organizers"]}, "content": {"title": {"order": 1, "description": "Brief summary of your comment.", "value-regex": ".{1,500}"}, "comment": {"order": 2, "description": "Your comment or reply.", "value-regex": "[\\S\\s]{1,20000}"}}}, "nonreaders": [], "noninvitees": ["ICLR.cc/2017/conference/paper526/reviewers", "ICLR.cc/2017/conference/paper526/areachairs"], "cdate": 1485287536710}}}, {"tddate": null, "tmdate": 1484356432454, "tcdate": 1484356432454, "number": 4, "id": "SkOUsxPUl", "invitation": "ICLR.cc/2017/conference/-/paper526/public/comment", "forum": "SJ_QCYqle", "replyto": "HkaczsZNg", "signatures": ["~Evan_Racah1"], "readers": ["everyone"], "writers": ["~Evan_Racah1"], "content": {"title": "response to review", "comment": "Thank you for your review. Even though you have deemed a rejection, we appreciate that you still took the time to read it and give constructive, useful criticism. Below we respond to some points you made: \n\nR:”Finally, is there any baseline approach the authors could report or compare too?”\n\nA: We decided to use the 2D supervised approach as a baseline, but  we see how it could potentially be useful to show pure YOLO or SSD results.\n\n\nR: “If the goal of this work is to count the number of such instances this is defensible, but for localization this seems overly loose.Furthermore, the 3D CNN architecture (which is one of the the core novelties of this work compared to past efforts) does not seem capable of producing variable sized boxes (as noted in the last paragraph of page 7), which I imagine results in poorer performance at higher IoU thresholds (as many of the weather events appear small).”\n\n\nA: Counting is useful, but climate scientists do eventually want full on detection. That being said, there is some utility in rough localization at least as a starting point. We have posted results for 0.5 IOU in the January 13 revision. You are correct in that the results were much worse due to the more stringent criteria and the shortcomings of the model. We address and interpret the decline in accuracy and these shortcomings in this revision (to save you time, almost all the changes are in section 4.3 and tables 4 and 5. The other changes are just an addition of a link to code and a link to download the data).\n\nThanks again for your time and effort!\n"}, "nonreaders": [], "details": {"replyCount": 0, "writable": false, "overwriting": [], "revisions": false, "forumContent": {"title": "Semi-Supervised Detection of Extreme Weather Events in Large Climate Datasets", "abstract": "The detection and identification of extreme weather events in large scale climate simulations is an important problem for risk management, informing governmental policy decisions and advancing our basic understanding of the climate system.\nRecent work has shown that fully supervised convolutional neural networks (CNNs) can yield acceptable accuracy for classifying well-known types of extreme weather events when large amounts of labeled data are available. However, there are many different types of spatially localized climate patterns of interest (including hurricanes, extra-tropical cyclones, weather fronts, blocking events, etc.)\nfound in simulation data for which labeled data is not available at large scale for all simulations of interest.\nWe present a multichannel spatiotemporal encoder-decoder CNN architecture for semi-supervised bounding box prediction and exploratory data analysis.\nThis architecture is designed to fully model multi-channel simulation data, temporal dynamics and unlabelled data within a reconstruction and prediction framework so as to improve the detection of a wide range of extreme weather events. \nOur architecture can be viewed as a 3D convolutional autoencoder with an additional modified one-pass bounding box regression loss. \nWe demonstrate that our approach is able to leverage temporal information and unlabelled data to improve localization of extreme weather events. Further, we explore the representations learned by our model in order to better understand this important data, and facilitate further work in understanding and mitigating the effects of climate change.", "pdf": "/pdf/2d086f27e4b8a6596725a5093860f01f15341506.pdf", "TL;DR": "Semi-supervised 3D CNN's improve bounding box detection of weather events in climate simulations compared to supervised approaches.", "paperhash": "racah|semisupervised_detection_of_extreme_weather_events_in_large_climate_datasets", "keywords": ["Semi-Supervised Learning", "Applications", "Computer vision"], "conflicts": ["lbl.gov", "polymtl.ca"], "authors": ["Evan Racah", "Christopher Beckham", "Tegan Maharaj", "Prabhat", "Christopher Pal"], "authorids": ["eracah@lbl.gov", "christopher.beckham@polymtl.ca", "tegan.maharaj@polymtl.ca", "prabhat@lbl.gov", "christopher.pal@polymtl.ca"]}, "tags": [], "invitation": {"rdate": null, "duedate": null, "tddate": null, "ddate": null, "tmdate": 1485287536710, "id": "ICLR.cc/2017/conference/-/paper526/public/comment", "writers": ["ICLR.cc/2017/conference"], "signatures": ["ICLR.cc/2017/conference"], "readers": ["everyone"], "invitees": ["~"], "reply": {"forum": "SJ_QCYqle", "writers": {"values-regex": "~.*|\\(anonymous\\)"}, "signatures": {"values-regex": "~.*|\\(anonymous\\)", "description": "How your identity will be displayed with the above content."}, "readers": {"description": "The users who will be allowed to read the above content.", "value-dropdown": ["everyone", "ICLR.cc/2017/conference/organizers", "ICLR.cc/2017/conference/ACs_and_organizers", "ICLR.cc/2017/conference/reviewers_and_ACS_and_organizers"]}, "content": {"title": {"order": 1, "description": "Brief summary of your comment.", "value-regex": ".{1,500}"}, "comment": {"order": 2, "description": "Your comment or reply.", "value-regex": "[\\S\\s]{1,20000}"}}}, "nonreaders": [], "noninvitees": ["ICLR.cc/2017/conference/paper526/reviewers", "ICLR.cc/2017/conference/paper526/areachairs"], "cdate": 1485287536710}}}, {"tddate": null, "replyto": null, "ddate": null, "tmdate": 1484355484988, "tcdate": 1478299167950, "number": 526, "id": "SJ_QCYqle", "invitation": "ICLR.cc/2017/conference/-/submission", "forum": "SJ_QCYqle", "signatures": ["~Evan_Racah1"], "readers": ["everyone"], "content": {"title": "Semi-Supervised Detection of Extreme Weather Events in Large Climate Datasets", "abstract": "The detection and identification of extreme weather events in large scale climate simulations is an important problem for risk management, informing governmental policy decisions and advancing our basic understanding of the climate system.\nRecent work has shown that fully supervised convolutional neural networks (CNNs) can yield acceptable accuracy for classifying well-known types of extreme weather events when large amounts of labeled data are available. However, there are many different types of spatially localized climate patterns of interest (including hurricanes, extra-tropical cyclones, weather fronts, blocking events, etc.)\nfound in simulation data for which labeled data is not available at large scale for all simulations of interest.\nWe present a multichannel spatiotemporal encoder-decoder CNN architecture for semi-supervised bounding box prediction and exploratory data analysis.\nThis architecture is designed to fully model multi-channel simulation data, temporal dynamics and unlabelled data within a reconstruction and prediction framework so as to improve the detection of a wide range of extreme weather events. \nOur architecture can be viewed as a 3D convolutional autoencoder with an additional modified one-pass bounding box regression loss. \nWe demonstrate that our approach is able to leverage temporal information and unlabelled data to improve localization of extreme weather events. Further, we explore the representations learned by our model in order to better understand this important data, and facilitate further work in understanding and mitigating the effects of climate change.", "pdf": "/pdf/2d086f27e4b8a6596725a5093860f01f15341506.pdf", "TL;DR": "Semi-supervised 3D CNN's improve bounding box detection of weather events in climate simulations compared to supervised approaches.", "paperhash": "racah|semisupervised_detection_of_extreme_weather_events_in_large_climate_datasets", "keywords": ["Semi-Supervised Learning", "Applications", "Computer vision"], "conflicts": ["lbl.gov", "polymtl.ca"], "authors": ["Evan Racah", "Christopher Beckham", "Tegan Maharaj", "Prabhat", "Christopher Pal"], "authorids": ["eracah@lbl.gov", "christopher.beckham@polymtl.ca", "tegan.maharaj@polymtl.ca", "prabhat@lbl.gov", "christopher.pal@polymtl.ca"]}, "writers": [], "nonreaders": [], "details": {"replyCount": 11, "writable": false, "overwriting": [], "revisions": true, "tags": [], "invitation": {"rdate": null, "tddate": null, "ddate": null, "duedate": 1475686800000, "tmdate": 1478287705855, "id": "ICLR.cc/2017/conference/-/submission", "writers": ["ICLR.cc/2017/conference"], "signatures": ["ICLR.cc/2017/pcs"], "readers": ["everyone"], "invitees": ["~"], "reply": {"forum": null, "replyto": null, "writers": {"values-regex": "~.*"}, "signatures": {"values-regex": "~.*", "description": "How your identity will be displayed with the above content."}, "readers": {"description": "The users who will be allowed to read the above content.", "values": ["everyone"]}, "content": {"pdf": {"required": true, "order": 5, "description": "Either upload a PDF file or provide a direct link to your PDF on ArXiv (link must begin with http(s) and end with .pdf)", "value-regex": "upload|(http|https):\\/\\/.+\\.pdf"}, "title": {"required": true, "order": 1, "description": "Title of paper.", "value-regex": ".{1,250}"}, "abstract": {"required": true, "order": 4, "description": "Abstract of paper.", "value-regex": "[\\S\\s]{1,5000}"}, "authors": {"required": true, "order": 2, "values-regex": "[^;,\\n]+(,[^,\\n]+)*", "description": "Comma separated list of author names, as they appear in the paper."}, "conflicts": {"required": true, "order": 100, "values-regex": "[^;,\\n]+(,[^,\\n]+)*", "description": "Comma separated list of email domains of people who would have a conflict of interest in reviewing this paper, (e.g., cs.umass.edu;google.com, etc.)."}, "keywords": {"order": 6, "description": "Comma separated list of keywords.", "values-dropdown": ["Theory", "Computer vision", "Speech", "Natural language processing", "Deep learning", "Unsupervised Learning", "Supervised Learning", "Semi-Supervised Learning", "Reinforcement Learning", "Transfer Learning", "Multi-modal learning", "Applications", "Optimization", "Structured prediction", "Games"]}, "TL;DR": {"required": false, "order": 3, "description": "\"Too Long; Didn't Read\": a short sentence describing your paper", "value-regex": "[^\\n]{0,250}"}, "authorids": {"required": true, "order": 3, "values-regex": "[^;,\\n]+(,[^,\\n]+)*", "description": "Comma separated list of author email addresses, in the same order as above."}}}, "nonreaders": [], "noninvitees": [], "expdate": 1483462800000, "cdate": 1478287705855}}}, {"tddate": null, "tmdate": 1484001079818, "tcdate": 1484001079818, "number": 3, "id": "BylSyqZIg", "invitation": "ICLR.cc/2017/conference/-/paper526/public/comment", "forum": "SJ_QCYqle", "replyto": "BkfVLbMEx", "signatures": ["~Evan_Racah1"], "readers": ["everyone"], "writers": ["~Evan_Racah1"], "content": {"title": "reviewer response", "comment": "Dear Reviewer2,\nThank you for your thoughtful, thorough review. Below are some responses to your review.\nR:“The biggest concern w the paper though is experimental results. Only a single figure and table of results are shown (figure 4 and table 4).The metrics are not defined (what is mean average recall?).” \nA:In our revision from December 1st, we included Table 4 and Table 5 as results. Table 4 which show mAP for 2D, 3D, semi-supervised and supervised in addition to different capacities for 2D and a different lambda setting. Table 5 shows mAP for all experiments by performance on each class. The mean average recall metric was erroneously named and is removed in the December 1 revision. Figure 3 shows sample boxes and figure 4 shows some visualization of the embeddings of the “code” layer.\nR:”One of the things that is unclear is how many events are actually in the training/testing data”\nA: Table 3 in the December 1 revision shows the frequency of classes in train and test data\nR:  The only confusing bit is that the “semi-supervised” loss actually has all the labels used for the “supervised” loss and additionally incorporates the reconstruction loss. Hence, the “semi-supervised” loss is actually stronger, which makes the terminology a bit confusing.\nA: The semi-supervised network uses twice as much data, but all additional data is unlabelled. And yes, even the labelled data is subject to reconstruction penalty\nR: “It is also unclear if future researchers will be able to reproduce the experimental setting (a commitment to open-source the data or a way to reproduce the experiments would be critical for future authors).”\nA: We will include the link to the github repo (https://github.com/eracah/hur-detect/) in our next revision in addition to a link for downloading the data (http://portal.nersc.gov/project/dasrepo/climate/)\nR: “the authors use both a classification loss and an “objectness” loss. I’ve never seen both used together like this”\nA: The two are not usually used together in region proposal based methods, but are used together in the loss for YOLO, which is the method we used as our base method. Most detection methods as you said either have a two step process (RCNN-like networks) or just include classification term (SSD). We used both for two reasons: \n1, we started with YOLO and then tweaked it to improve the detection, so we started with both terms and did not have time to experiment with removing one.\n2. Like YOLO, we wanted a simple one shot detection network that would localize and classify in one pass and we liked the simplicity of the formulation of the YOLO loss, where only boxes that had an object were penalized for getting the class wrong. We thought this seemed to be simplest, logical way to formulate the loss as opposed to having a having a two step process with a post-classifier; especially because the post-classifier often involves a background class and the likelihood of having to tune the ratio of negative to positive images passed through the classifier.\n\nThanks again for your time!"}, "nonreaders": [], "details": {"replyCount": 0, "writable": false, "overwriting": [], "revisions": false, "forumContent": {"title": "Semi-Supervised Detection of Extreme Weather Events in Large Climate Datasets", "abstract": "The detection and identification of extreme weather events in large scale climate simulations is an important problem for risk management, informing governmental policy decisions and advancing our basic understanding of the climate system.\nRecent work has shown that fully supervised convolutional neural networks (CNNs) can yield acceptable accuracy for classifying well-known types of extreme weather events when large amounts of labeled data are available. However, there are many different types of spatially localized climate patterns of interest (including hurricanes, extra-tropical cyclones, weather fronts, blocking events, etc.)\nfound in simulation data for which labeled data is not available at large scale for all simulations of interest.\nWe present a multichannel spatiotemporal encoder-decoder CNN architecture for semi-supervised bounding box prediction and exploratory data analysis.\nThis architecture is designed to fully model multi-channel simulation data, temporal dynamics and unlabelled data within a reconstruction and prediction framework so as to improve the detection of a wide range of extreme weather events. \nOur architecture can be viewed as a 3D convolutional autoencoder with an additional modified one-pass bounding box regression loss. \nWe demonstrate that our approach is able to leverage temporal information and unlabelled data to improve localization of extreme weather events. Further, we explore the representations learned by our model in order to better understand this important data, and facilitate further work in understanding and mitigating the effects of climate change.", "pdf": "/pdf/2d086f27e4b8a6596725a5093860f01f15341506.pdf", "TL;DR": "Semi-supervised 3D CNN's improve bounding box detection of weather events in climate simulations compared to supervised approaches.", "paperhash": "racah|semisupervised_detection_of_extreme_weather_events_in_large_climate_datasets", "keywords": ["Semi-Supervised Learning", "Applications", "Computer vision"], "conflicts": ["lbl.gov", "polymtl.ca"], "authors": ["Evan Racah", "Christopher Beckham", "Tegan Maharaj", "Prabhat", "Christopher Pal"], "authorids": ["eracah@lbl.gov", "christopher.beckham@polymtl.ca", "tegan.maharaj@polymtl.ca", "prabhat@lbl.gov", "christopher.pal@polymtl.ca"]}, "tags": [], "invitation": {"rdate": null, "duedate": null, "tddate": null, "ddate": null, "tmdate": 1485287536710, "id": "ICLR.cc/2017/conference/-/paper526/public/comment", "writers": ["ICLR.cc/2017/conference"], "signatures": ["ICLR.cc/2017/conference"], "readers": ["everyone"], "invitees": ["~"], "reply": {"forum": "SJ_QCYqle", "writers": {"values-regex": "~.*|\\(anonymous\\)"}, "signatures": {"values-regex": "~.*|\\(anonymous\\)", "description": "How your identity will be displayed with the above content."}, "readers": {"description": "The users who will be allowed to read the above content.", "value-dropdown": ["everyone", "ICLR.cc/2017/conference/organizers", "ICLR.cc/2017/conference/ACs_and_organizers", "ICLR.cc/2017/conference/reviewers_and_ACS_and_organizers"]}, "content": {"title": {"order": 1, "description": "Brief summary of your comment.", "value-regex": ".{1,500}"}, "comment": {"order": 2, "description": "Your comment or reply.", "value-regex": "[\\S\\s]{1,20000}"}}}, "nonreaders": [], "noninvitees": ["ICLR.cc/2017/conference/paper526/reviewers", "ICLR.cc/2017/conference/paper526/areachairs"], "cdate": 1485287536710}}}, {"tddate": null, "tmdate": 1482179986751, "tcdate": 1482179924506, "number": 3, "id": "Bk28SarVl", "invitation": "ICLR.cc/2017/conference/-/paper526/official/review", "forum": "SJ_QCYqle", "replyto": "SJ_QCYqle", "signatures": ["ICLR.cc/2017/conference/paper526/AnonReviewer1"], "readers": ["everyone"], "writers": ["ICLR.cc/2017/conference/paper526/AnonReviewer1"], "content": {"title": "", "rating": "6: Marginally above acceptance threshold", "review": "This paper applies convnet-based object detection techniques to detection of weather events from 3D climate data, additionally exploring the effect of using an unsupervised autoencoder-style objective term.\n\n\nPros:\n\nThe application of object detection techniques to extreme weather event detection problem is unique, to my knowledge.\n\nThe paper is well-written and describes the method well, including a survey of the related work.\n\nThe best model makes use of 3D convolutions and unsupervised learning, both of which are relatively unexplored in the detection literature.  Both of these aspects are validated and shown to produce at least small performance improvements over a 2D and/or purely supervised approach.\n\n\nCons:\n\nThe benefits of the 3D convolutional architecture and unsupervised learning end up being a little underwhelming, with 52.92% mAP for the 3D+semi-sup result vs. 51.42% mAP for the 2D+sup result.\n\nIt’s a bit strange that 3D+sup and 2D+semi-sup are each worse than the 2D+sup base result;  I’d expect each aspect to give a slight improvement over the base result, given that using both together gives the best results -- perhaps there was not a thorough enough hyperparameter search for these cases.  The paper does acknowledge this and provide potential explanations in Sec. 4.3, however.\n\nAs other reviewers pointed out, the use of the 0.1 IoU criterion for true positives is very loose relative to the standard 0.5 criterion.  On the other hand, if the results visualized in Figure 3 are typical, a 0.1 overlap criterion could be reasonable for this domain as the detector does seem to localize events well enough that the system could be used to expedite human review of the climate images for extreme events.  Still, it would be useful to also report results at higher overlap thresholds.\n\nMinor: eq 6 should (probably) be the squared L2 norm (i.e. the sum of squares) rather than the L2 norm itself.\n\nMinor: table 4 -- shouldn’t the semi-supervised models have more parameters than the corresponding supervised ones due to the decoder layers?\n\n\nOverall, this paper is well-written and applies some interesting underutilized techniques to a relatively unique domain.\f  The results aren't striking, but the model is ablated appropriately and shown to be beneficial.  For a final version, it would be nice to see results at higher overlap thresholds.", "confidence": "4: The reviewer is confident but not absolutely certain that the evaluation is correct"}, "nonreaders": [], "details": {"replyCount": 0, "writable": false, "overwriting": [], "revisions": false, "forumContent": {"title": "Semi-Supervised Detection of Extreme Weather Events in Large Climate Datasets", "abstract": "The detection and identification of extreme weather events in large scale climate simulations is an important problem for risk management, informing governmental policy decisions and advancing our basic understanding of the climate system.\nRecent work has shown that fully supervised convolutional neural networks (CNNs) can yield acceptable accuracy for classifying well-known types of extreme weather events when large amounts of labeled data are available. However, there are many different types of spatially localized climate patterns of interest (including hurricanes, extra-tropical cyclones, weather fronts, blocking events, etc.)\nfound in simulation data for which labeled data is not available at large scale for all simulations of interest.\nWe present a multichannel spatiotemporal encoder-decoder CNN architecture for semi-supervised bounding box prediction and exploratory data analysis.\nThis architecture is designed to fully model multi-channel simulation data, temporal dynamics and unlabelled data within a reconstruction and prediction framework so as to improve the detection of a wide range of extreme weather events. \nOur architecture can be viewed as a 3D convolutional autoencoder with an additional modified one-pass bounding box regression loss. \nWe demonstrate that our approach is able to leverage temporal information and unlabelled data to improve localization of extreme weather events. Further, we explore the representations learned by our model in order to better understand this important data, and facilitate further work in understanding and mitigating the effects of climate change.", "pdf": "/pdf/2d086f27e4b8a6596725a5093860f01f15341506.pdf", "TL;DR": "Semi-supervised 3D CNN's improve bounding box detection of weather events in climate simulations compared to supervised approaches.", "paperhash": "racah|semisupervised_detection_of_extreme_weather_events_in_large_climate_datasets", "keywords": ["Semi-Supervised Learning", "Applications", "Computer vision"], "conflicts": ["lbl.gov", "polymtl.ca"], "authors": ["Evan Racah", "Christopher Beckham", "Tegan Maharaj", "Prabhat", "Christopher Pal"], "authorids": ["eracah@lbl.gov", "christopher.beckham@polymtl.ca", "tegan.maharaj@polymtl.ca", "prabhat@lbl.gov", "christopher.pal@polymtl.ca"]}, "tags": [], "invitation": {"rdate": null, "tddate": null, "ddate": null, "duedate": 1481932799000, "tmdate": 1482512554261, "id": "ICLR.cc/2017/conference/-/paper526/official/review", "writers": ["ICLR.cc/2017/conference"], "signatures": ["ICLR.cc/2017/conference"], "readers": ["everyone"], "invitees": ["ICLR.cc/2017/conference/paper526/reviewers"], "noninvitees": ["ICLR.cc/2017/conference/paper526/AnonReviewer3", "ICLR.cc/2017/conference/paper526/AnonReviewer2", "ICLR.cc/2017/conference/paper526/AnonReviewer1"], "reply": {"forum": "SJ_QCYqle", "replyto": "SJ_QCYqle", "writers": {"values-regex": "ICLR.cc/2017/conference/paper526/AnonReviewer[0-9]+"}, "signatures": {"values-regex": "ICLR.cc/2017/conference/paper526/AnonReviewer[0-9]+"}, "readers": {"description": "The users who will be allowed to read the above content.", "values": ["everyone"]}, "content": {"title": {"order": 1, "description": "Brief summary of your review.", "value-regex": ".{0,500}"}, "review": {"order": 2, "description": "Please provide an evaluation of the quality, clarity, originality and significance of this work, including a list of its pros and cons.", "value-regex": "[\\S\\s]{1,20000}"}, "rating": {"order": 3, "value-dropdown": ["10: Top 5% of accepted papers, seminal paper", "9: Top 15% of accepted papers, strong accept", "8: Top 50% of accepted papers, clear accept", "7: Good paper, accept", "6: Marginally above acceptance threshold", "5: Marginally below acceptance threshold", "4: Ok but not good enough - rejection", "3: Clear rejection", "2: Strong rejection", "1: Trivial or wrong"]}, "confidence": {"order": 4, "value-radio": ["5: The reviewer is absolutely certain that the evaluation is correct and very familiar with the relevant literature", "4: The reviewer is confident but not absolutely certain that the evaluation is correct", "3: The reviewer is fairly confident that the evaluation is correct", "2: The reviewer is willing to defend the evaluation, but it is quite likely that the reviewer did not understand central parts of the paper", "1: The reviewer's evaluation is an educated guess"]}}}, "nonreaders": [], "expdate": 1489708799000, "cdate": 1482512554261}}}, {"tddate": null, "tmdate": 1481141123710, "tcdate": 1481141123703, "number": 2, "id": "H1nFikImx", "invitation": "ICLR.cc/2017/conference/-/paper526/public/comment", "forum": "SJ_QCYqle", "replyto": "S1Q5fKJ7e", "signatures": ["~Evan_Racah1"], "readers": ["everyone"], "writers": ["~Evan_Racah1"], "content": {"title": "0.1 IoU Threshold", "comment": "We picked 0.1 originally to make the accuracy criteria a little easier as we were still developing and improving the model and we never had a chance to try any other values, but in a future revision, we can show results for 0.5 which is more in line with ImageNet.\n"}, "nonreaders": [], "details": {"replyCount": 0, "writable": false, "overwriting": [], "revisions": false, "forumContent": {"title": "Semi-Supervised Detection of Extreme Weather Events in Large Climate Datasets", "abstract": "The detection and identification of extreme weather events in large scale climate simulations is an important problem for risk management, informing governmental policy decisions and advancing our basic understanding of the climate system.\nRecent work has shown that fully supervised convolutional neural networks (CNNs) can yield acceptable accuracy for classifying well-known types of extreme weather events when large amounts of labeled data are available. However, there are many different types of spatially localized climate patterns of interest (including hurricanes, extra-tropical cyclones, weather fronts, blocking events, etc.)\nfound in simulation data for which labeled data is not available at large scale for all simulations of interest.\nWe present a multichannel spatiotemporal encoder-decoder CNN architecture for semi-supervised bounding box prediction and exploratory data analysis.\nThis architecture is designed to fully model multi-channel simulation data, temporal dynamics and unlabelled data within a reconstruction and prediction framework so as to improve the detection of a wide range of extreme weather events. \nOur architecture can be viewed as a 3D convolutional autoencoder with an additional modified one-pass bounding box regression loss. \nWe demonstrate that our approach is able to leverage temporal information and unlabelled data to improve localization of extreme weather events. Further, we explore the representations learned by our model in order to better understand this important data, and facilitate further work in understanding and mitigating the effects of climate change.", "pdf": "/pdf/2d086f27e4b8a6596725a5093860f01f15341506.pdf", "TL;DR": "Semi-supervised 3D CNN's improve bounding box detection of weather events in climate simulations compared to supervised approaches.", "paperhash": "racah|semisupervised_detection_of_extreme_weather_events_in_large_climate_datasets", "keywords": ["Semi-Supervised Learning", "Applications", "Computer vision"], "conflicts": ["lbl.gov", "polymtl.ca"], "authors": ["Evan Racah", "Christopher Beckham", "Tegan Maharaj", "Prabhat", "Christopher Pal"], "authorids": ["eracah@lbl.gov", "christopher.beckham@polymtl.ca", "tegan.maharaj@polymtl.ca", "prabhat@lbl.gov", "christopher.pal@polymtl.ca"]}, "tags": [], "invitation": {"rdate": null, "duedate": null, "tddate": null, "ddate": null, "tmdate": 1485287536710, "id": "ICLR.cc/2017/conference/-/paper526/public/comment", "writers": ["ICLR.cc/2017/conference"], "signatures": ["ICLR.cc/2017/conference"], "readers": ["everyone"], "invitees": ["~"], "reply": {"forum": "SJ_QCYqle", "writers": {"values-regex": "~.*|\\(anonymous\\)"}, "signatures": {"values-regex": "~.*|\\(anonymous\\)", "description": "How your identity will be displayed with the above content."}, "readers": {"description": "The users who will be allowed to read the above content.", "value-dropdown": ["everyone", "ICLR.cc/2017/conference/organizers", "ICLR.cc/2017/conference/ACs_and_organizers", "ICLR.cc/2017/conference/reviewers_and_ACS_and_organizers"]}, "content": {"title": {"order": 1, "description": "Brief summary of your comment.", "value-regex": ".{1,500}"}, "comment": {"order": 2, "description": "Your comment or reply.", "value-regex": "[\\S\\s]{1,20000}"}}}, "nonreaders": [], "noninvitees": ["ICLR.cc/2017/conference/paper526/reviewers", "ICLR.cc/2017/conference/paper526/areachairs"], "cdate": 1485287536710}}}, {"tddate": null, "tmdate": 1481141055924, "tcdate": 1481141055919, "number": 1, "id": "B1uBo1Lmg", "invitation": "ICLR.cc/2017/conference/-/paper526/public/comment", "forum": "SJ_QCYqle", "replyto": "HyQGuhJ7x", "signatures": ["~Evan_Racah1"], "readers": ["everyone"], "writers": ["~Evan_Racah1"], "content": {"title": "mAR", "comment": "Originally we were looking at recall and precision at a certain confidence threshold for the boxes (i.e. what is the precision and recall for model when we only take into account box guesses that have a confidence/objectness probability greater than 0.8). Those were erroneously labelled as mAP and mAR. In the revision on December 1, we corrected that to just report the true mAP (integrate over a precision-recall curve) and as you correctly said there is no analog for recall with that definition of mAP."}, "nonreaders": [], "details": {"replyCount": 0, "writable": false, "overwriting": [], "revisions": false, "forumContent": {"title": "Semi-Supervised Detection of Extreme Weather Events in Large Climate Datasets", "abstract": "The detection and identification of extreme weather events in large scale climate simulations is an important problem for risk management, informing governmental policy decisions and advancing our basic understanding of the climate system.\nRecent work has shown that fully supervised convolutional neural networks (CNNs) can yield acceptable accuracy for classifying well-known types of extreme weather events when large amounts of labeled data are available. However, there are many different types of spatially localized climate patterns of interest (including hurricanes, extra-tropical cyclones, weather fronts, blocking events, etc.)\nfound in simulation data for which labeled data is not available at large scale for all simulations of interest.\nWe present a multichannel spatiotemporal encoder-decoder CNN architecture for semi-supervised bounding box prediction and exploratory data analysis.\nThis architecture is designed to fully model multi-channel simulation data, temporal dynamics and unlabelled data within a reconstruction and prediction framework so as to improve the detection of a wide range of extreme weather events. \nOur architecture can be viewed as a 3D convolutional autoencoder with an additional modified one-pass bounding box regression loss. \nWe demonstrate that our approach is able to leverage temporal information and unlabelled data to improve localization of extreme weather events. Further, we explore the representations learned by our model in order to better understand this important data, and facilitate further work in understanding and mitigating the effects of climate change.", "pdf": "/pdf/2d086f27e4b8a6596725a5093860f01f15341506.pdf", "TL;DR": "Semi-supervised 3D CNN's improve bounding box detection of weather events in climate simulations compared to supervised approaches.", "paperhash": "racah|semisupervised_detection_of_extreme_weather_events_in_large_climate_datasets", "keywords": ["Semi-Supervised Learning", "Applications", "Computer vision"], "conflicts": ["lbl.gov", "polymtl.ca"], "authors": ["Evan Racah", "Christopher Beckham", "Tegan Maharaj", "Prabhat", "Christopher Pal"], "authorids": ["eracah@lbl.gov", "christopher.beckham@polymtl.ca", "tegan.maharaj@polymtl.ca", "prabhat@lbl.gov", "christopher.pal@polymtl.ca"]}, "tags": [], "invitation": {"rdate": null, "duedate": null, "tddate": null, "ddate": null, "tmdate": 1485287536710, "id": "ICLR.cc/2017/conference/-/paper526/public/comment", "writers": ["ICLR.cc/2017/conference"], "signatures": ["ICLR.cc/2017/conference"], "readers": ["everyone"], "invitees": ["~"], "reply": {"forum": "SJ_QCYqle", "writers": {"values-regex": "~.*|\\(anonymous\\)"}, "signatures": {"values-regex": "~.*|\\(anonymous\\)", "description": "How your identity will be displayed with the above content."}, "readers": {"description": "The users who will be allowed to read the above content.", "value-dropdown": ["everyone", "ICLR.cc/2017/conference/organizers", "ICLR.cc/2017/conference/ACs_and_organizers", "ICLR.cc/2017/conference/reviewers_and_ACS_and_organizers"]}, "content": {"title": {"order": 1, "description": "Brief summary of your comment.", "value-regex": ".{1,500}"}, "comment": {"order": 2, "description": "Your comment or reply.", "value-regex": "[\\S\\s]{1,20000}"}}}, "nonreaders": [], "noninvitees": ["ICLR.cc/2017/conference/paper526/reviewers", "ICLR.cc/2017/conference/paper526/areachairs"], "cdate": 1485287536710}}}, {"tddate": null, "tmdate": 1480734730605, "tcdate": 1480734730593, "number": 2, "id": "HyQGuhJ7x", "invitation": "ICLR.cc/2017/conference/-/paper526/pre-review/question", "forum": "SJ_QCYqle", "replyto": "SJ_QCYqle", "signatures": ["ICLR.cc/2017/conference/paper526/AnonReviewer1"], "readers": ["everyone"], "writers": ["ICLR.cc/2017/conference/paper526/AnonReviewer1"], "content": {"title": "mAR", "question": "How is the 'mean average recall' (mAR) metric reported in table 4 defined? (I've never heard of this metric before, and it's not obvious to me what it would mean -- a direct analog of Average Precision would not be well-defined.)"}, "nonreaders": [], "details": {"replyCount": 0, "writable": false, "overwriting": [], "revisions": false, "forumContent": {"title": "Semi-Supervised Detection of Extreme Weather Events in Large Climate Datasets", "abstract": "The detection and identification of extreme weather events in large scale climate simulations is an important problem for risk management, informing governmental policy decisions and advancing our basic understanding of the climate system.\nRecent work has shown that fully supervised convolutional neural networks (CNNs) can yield acceptable accuracy for classifying well-known types of extreme weather events when large amounts of labeled data are available. However, there are many different types of spatially localized climate patterns of interest (including hurricanes, extra-tropical cyclones, weather fronts, blocking events, etc.)\nfound in simulation data for which labeled data is not available at large scale for all simulations of interest.\nWe present a multichannel spatiotemporal encoder-decoder CNN architecture for semi-supervised bounding box prediction and exploratory data analysis.\nThis architecture is designed to fully model multi-channel simulation data, temporal dynamics and unlabelled data within a reconstruction and prediction framework so as to improve the detection of a wide range of extreme weather events. \nOur architecture can be viewed as a 3D convolutional autoencoder with an additional modified one-pass bounding box regression loss. \nWe demonstrate that our approach is able to leverage temporal information and unlabelled data to improve localization of extreme weather events. Further, we explore the representations learned by our model in order to better understand this important data, and facilitate further work in understanding and mitigating the effects of climate change.", "pdf": "/pdf/2d086f27e4b8a6596725a5093860f01f15341506.pdf", "TL;DR": "Semi-supervised 3D CNN's improve bounding box detection of weather events in climate simulations compared to supervised approaches.", "paperhash": "racah|semisupervised_detection_of_extreme_weather_events_in_large_climate_datasets", "keywords": ["Semi-Supervised Learning", "Applications", "Computer vision"], "conflicts": ["lbl.gov", "polymtl.ca"], "authors": ["Evan Racah", "Christopher Beckham", "Tegan Maharaj", "Prabhat", "Christopher Pal"], "authorids": ["eracah@lbl.gov", "christopher.beckham@polymtl.ca", "tegan.maharaj@polymtl.ca", "prabhat@lbl.gov", "christopher.pal@polymtl.ca"]}, "tags": [], "invitation": {"rdate": null, "tddate": null, "ddate": null, "duedate": 1480741199000, "tmdate": 1480959231556, "id": "ICLR.cc/2017/conference/-/paper526/pre-review/question", "writers": ["ICLR.cc/2017/conference"], "signatures": ["ICLR.cc/2017/conference"], "readers": ["everyone"], "invitees": ["ICLR.cc/2017/conference/paper526/reviewers"], "noninvitees": ["ICLR.cc/2017/conference/paper526/AnonReviewer3", "ICLR.cc/2017/conference/paper526/AnonReviewer1"], "reply": {"forum": "SJ_QCYqle", "replyto": "SJ_QCYqle", "writers": {"values-regex": "ICLR.cc/2017/conference/paper526/AnonReviewer[0-9]+"}, "signatures": {"values-regex": "ICLR.cc/2017/conference/paper526/AnonReviewer[0-9]+", "description": "How your identity will be displayed with the above content."}, "readers": {"description": "The users who will be allowed to read the above content.", "values": ["everyone"]}, "content": {"title": {"order": 1, "description": "Brief summary of your question.", "value-regex": ".{1,500}"}, "question": {"order": 2, "description": "Your question", "value-regex": "[\\S\\s]{1,5000}"}}}, "nonreaders": [], "expdate": 1488517199000, "cdate": 1480959231556}}}, {"tddate": null, "tmdate": 1480721034582, "tcdate": 1480721034578, "number": 1, "id": "S1Q5fKJ7e", "invitation": "ICLR.cc/2017/conference/-/paper526/pre-review/question", "forum": "SJ_QCYqle", "replyto": "SJ_QCYqle", "signatures": ["ICLR.cc/2017/conference/paper526/AnonReviewer3"], "readers": ["everyone"], "writers": ["ICLR.cc/2017/conference/paper526/AnonReviewer3"], "content": {"title": "0.1 IoU Threshold", "question": "In the paper, you consider detections with a IoU of 0.1 or greater to be true positives. Could you discuss the choice of this threshold? How do your results change as this threshold is increased (i.e. when more accurate bounding boxes are required)? "}, "nonreaders": [], "details": {"replyCount": 0, "writable": false, "overwriting": [], "revisions": false, "forumContent": {"title": "Semi-Supervised Detection of Extreme Weather Events in Large Climate Datasets", "abstract": "The detection and identification of extreme weather events in large scale climate simulations is an important problem for risk management, informing governmental policy decisions and advancing our basic understanding of the climate system.\nRecent work has shown that fully supervised convolutional neural networks (CNNs) can yield acceptable accuracy for classifying well-known types of extreme weather events when large amounts of labeled data are available. However, there are many different types of spatially localized climate patterns of interest (including hurricanes, extra-tropical cyclones, weather fronts, blocking events, etc.)\nfound in simulation data for which labeled data is not available at large scale for all simulations of interest.\nWe present a multichannel spatiotemporal encoder-decoder CNN architecture for semi-supervised bounding box prediction and exploratory data analysis.\nThis architecture is designed to fully model multi-channel simulation data, temporal dynamics and unlabelled data within a reconstruction and prediction framework so as to improve the detection of a wide range of extreme weather events. \nOur architecture can be viewed as a 3D convolutional autoencoder with an additional modified one-pass bounding box regression loss. \nWe demonstrate that our approach is able to leverage temporal information and unlabelled data to improve localization of extreme weather events. Further, we explore the representations learned by our model in order to better understand this important data, and facilitate further work in understanding and mitigating the effects of climate change.", "pdf": "/pdf/2d086f27e4b8a6596725a5093860f01f15341506.pdf", "TL;DR": "Semi-supervised 3D CNN's improve bounding box detection of weather events in climate simulations compared to supervised approaches.", "paperhash": "racah|semisupervised_detection_of_extreme_weather_events_in_large_climate_datasets", "keywords": ["Semi-Supervised Learning", "Applications", "Computer vision"], "conflicts": ["lbl.gov", "polymtl.ca"], "authors": ["Evan Racah", "Christopher Beckham", "Tegan Maharaj", "Prabhat", "Christopher Pal"], "authorids": ["eracah@lbl.gov", "christopher.beckham@polymtl.ca", "tegan.maharaj@polymtl.ca", "prabhat@lbl.gov", "christopher.pal@polymtl.ca"]}, "tags": [], "invitation": {"rdate": null, "tddate": null, "ddate": null, "duedate": 1480741199000, "tmdate": 1480959231556, "id": "ICLR.cc/2017/conference/-/paper526/pre-review/question", "writers": ["ICLR.cc/2017/conference"], "signatures": ["ICLR.cc/2017/conference"], "readers": ["everyone"], "invitees": ["ICLR.cc/2017/conference/paper526/reviewers"], "noninvitees": ["ICLR.cc/2017/conference/paper526/AnonReviewer3", "ICLR.cc/2017/conference/paper526/AnonReviewer1"], "reply": {"forum": "SJ_QCYqle", "replyto": "SJ_QCYqle", "writers": {"values-regex": "ICLR.cc/2017/conference/paper526/AnonReviewer[0-9]+"}, "signatures": {"values-regex": "ICLR.cc/2017/conference/paper526/AnonReviewer[0-9]+", "description": "How your identity will be displayed with the above content."}, "readers": {"description": "The users who will be allowed to read the above content.", "values": ["everyone"]}, "content": {"title": {"order": 1, "description": "Brief summary of your question.", "value-regex": ".{1,500}"}, "question": {"order": 2, "description": "Your question", "value-regex": "[\\S\\s]{1,5000}"}}}, "nonreaders": [], "expdate": 1488517199000, "cdate": 1480959231556}}}], "count": 12}