{"notes": [{"ddate": null, "legacy_migration": true, "tmdate": 1364258160000, "tcdate": 1364258160000, "number": 1, "id": "vvzH6kFyntmsR", "invitation": "ICLR.cc/2013/-/submission/reply", "forum": "UUwuUaQ5qRyWn", "replyto": "FdwnFIZNOxF5S", "signatures": ["anonymous reviewer 6c04"], "readers": ["everyone"], "writers": ["anonymous"], "content": {"title": "", "reply": "Thanks for the updated version, I've re-read it quickly and it's indeed a bit clearer!"}, "nonreaders": [], "details": {"replyCount": 0, "overwriting": [], "revisions": false, "forumContent": {"title": "When Does a Mixture of Products Contain a Product of Mixtures?", "decision": "conferencePoster-iclr2013-workshop", "abstract": "We prove results on the relative representational power of mixtures of product distributions and restricted Boltzmann machines (products of mixtures of pairs of product distributions). Tools of independent interest are mode-based polyhedral approximations sensitive enough to compare full-dimensional models, and characterizations of possible modes and support sets of multivariate probability distributions that can be represented by both model classes. We find, in particular, that an exponentially larger mixture model, requiring an exponentially larger number of parameters, is required to represent probability distributions that can be represented by the restricted Boltzmann machines. The title question is intimately related to questions in coding theory and point configurations in hyperplane arrangements.", "pdf": "https://arxiv.org/abs/1206.0387", "paperhash": "montufar|when_does_a_mixture_of_products_contain_a_product_of_mixtures", "keywords": [], "conflicts": [], "authors": ["Guido F. Montufar", "Jason Morton"], "authorids": ["guidomontufar@googlemail.com", "jason.morton@gmail.com"]}, "tags": [], "invitation": {}}}, {"ddate": null, "legacy_migration": true, "tmdate": 1363384620000, "tcdate": 1363384620000, "number": 2, "id": "FdwnFIZNOxF5S", "invitation": "ICLR.cc/2013/-/submission/review", "forum": "UUwuUaQ5qRyWn", "replyto": "UUwuUaQ5qRyWn", "signatures": ["Guido F. Montufar, Jason Morton"], "readers": ["everyone"], "writers": ["anonymous"], "content": {"title": "", "review": "We thank all three reviewers for the helpful comments, which enabled us to improve the paper.  We have uploaded a revision to the arxiv taking into account the comments, and respond to some specific concerns below.\r\n\r\nWe were unsure as to whether we should make the paper longer by providing more in-line intuition around the steps of the proof of our main results. This would address the concerns of Reviewers 6c04 and 51ff, who thought some additional intuition throughout would be helpful, while Reviewer 51ff felt that the paper was perhaps too long as it was.  We elected to balance these concerns by making significant changes to improve clarity without greatly expanding the exposition, making a net addition of about a page of text. However, by moving some material to the appendix, the main portion of the paper has been reduced in length to 14 pages.\r\n\r\nResponding to specific comments:\r\n\r\nReviewer 6c04:\r\n\r\n>> Things I did not understand: \r\n>>- Fig. 1 (as a whole) \r\n\r\nWe have reworked this figure and improved the explanation in the caption; the intensity of the shading represents the value of log(k), that is the function $f(m,n) = min { log(k): mathcal{M}_{n,k}$ contains RBM_{n,m} }$. \r\n\r\n>>- Last paragraph of 1.1: why is this interesting? \r\n\r\nSince we are arguing that the sets of probability distributions representable by RBMs and MoPs are quite different, we thought it would be interesting to mention what is known about when these two sets do intersect.  We have added a comment about this.\r\n\r\n>>- Fig. 5 (not clear why it is in some kind of pseudo-3D and what is the meaning of all these lines -- also some explanations come after it is referenced, which does not help) \r\n\r\nWe have reworked the figure and added additional explanation in the text where the figure is referenced. This is a picture of the interior of a 3-dimensional simplex (a tetrahedron with vertices corresponding to the outcomes (0,0), (0,1), (1,0), (1,1)), with three sets of probability distributions depicted. The curved set is a 2-dimensional surface. The regions at the top and bottom are polyhedra, and the lines in the original figure were the edges of these polyhedra (the edges in back have now been removed to make the rendering clearer). Additionally, we linked to an interactive 3-d graphic object of Fig. 5.  Using Adobe Acrobat Reader 7 (or higher) the reader can rotate and slice this object in 3-d. \r\n\r\n>>- '(...) and therefore it contains distributions with (...)': I may be missing something obvious, but I did not follow the logical link ('therefore') \r\n\r\nWe expanded and rephrased this to hopefully be more clear.\r\n\r\n>>- I am unable to parse Remark 22, not sure if there is a typo (double 'iff') or I am just not getting it.  \r\n\r\nWe rewrote this remark, sorry for the confusion.  The meaning was that the three statements (X iff Y iff Z) are equivalent.\r\n\r\n>>Typos or minor points: \r\n>> - It seems like Fig. 3 and 4 should be swapped to match the order in which they appear in the text \r\n>>- 'Figure 3 shows an example of the partitions (...) defined by the models M_2,4 and RBM_2,3' -> mention also 'for some specific parameter values' to be really clear \r\n>>- Deptartment (x2) \r\n>>- Lebsegue \r\n>>- I believe the notation H_n is not explicitly defined (although it can be inferred from the definition of G_n) \r\n>>- There is a missing reference with a '?' on p. 9 after 'm <= 9' \r\n>>- It seems to me that section 6 is also related to the title of section 5. Should it be a subsection? \r\n>>- 'The product of mixtures represented by RBMs are (...)': products \r\n>>- 'Mixture model (...) generate': models\r\n\r\nThank you, we fixed these.\r\n\r\n\r\n\r\nReviewer 51ff:\r\n\r\n>>In conclusion, this paper tackles a problem which seems to be too contrived to be of general interest. Further, it is written in an unfriendly way which makes it more appropriate to a very technical crowd. \r\n>>- the fact that there are exponentially many inference regions for an RBM whereas there are only a linear number of them for a MoP seems quite obvious, merely by counting the number of hidden states configurations. I understand this is far from a proof but this is to me more representative of the fact that one does not want to use the hidden states as a new representation for a MoP, which we already knew.\r\n\r\nIn part this is simply a difference of philosophy.  Some place greater emphasis on an intuition or demonstration on a dataset, while others prefer to see a proof.  We recognize we may not have a lot to offer those comfortable relying upon their intuitive or empirical grasp of the situation, and instead aim to provide some mathematical proof to back up that intuition and satisfy the second group.\r\n\r\nIn trying to show that one class of models (RBMs or distributed representations) is better than another (here, non-distributed representations or naive Bayes models) at representing complex distributions, one must make a choice of criteria for comparison.  One can pick, inevitably arbitrarily, a dataset for comparison and produce an empirical comparison.  To provide a proof or theoretical comparison, one must choose a metric of complexity.  Of course, we always want larger and more natural datasets and broader metrics, but one must start somewhere.  We felt that in measuring the complexity of a distribution, the bumpiness of a probability distribution, or number of local maxima, modes, or strong modes in the Hamming topology was a reasonable place to start.  While we examined other metrics of distribution complexity, this was one that provided enough leverage to distinguish the models.  In the Discussion section, we talk about why multi-information, for example, is not suitable for making this distinction.  Making such a choice of metric is the unfortunate price of theoretical justifications.\r\n\r\nAdditionally, the number of inference regions was not claimed to be new, but part of the exposition about the widespread intuition regarding distributed representations.  We have added some exposition to clarify this.\r\n\r\nWhy we chose MoP: we wanted to compare distributed representations with non-distributed representations.  Since we are interested in learning representations, these should be two models with hidden variables that hold the representation.  For a non-distributed model with hidden variables and the same observables as an RBM, the na'ive Bayes or MoP model is canonical.  For example, a k-way interaction model might also be a good comparison, but it lacks hidden nodes.\r\n\r\n\r\n\r\n>>Additionnally, the paper is very heavy on definitions and gives very little intuition about the meaning of the results. Theorem 29 is a prime example as it takes a very long time to parse the result and I could really have used some intuition about the meaning of the result. This feeling is reinforced by the length of the paper (18 when the guidelines mentioned 9) and the inclusion of propositions which seem anecdotal (Prop.7, section 2.1, Corollary 18).\r\n\r\nSorry for the confusion.  The introduction, as well as Figure 1 is devoted to explaining and interpreting Theorem 29. The statements therein such as 'We find that the number of parameters of the smallest MoP model containing an RBM model grows exponentially in the number of parameters of the RBM for any fixed ratio $0!<!m/n!<!infty$, see Figure 1' are hopefully more-intuitive corollaries of Theorem 29.  The structure of the paper is to try to put the intuitive explanation of the results first, then give the (necessarily technical) proof showing how the results were obtained.  We have added a pointer before Theorem 29 to indicate this.\r\n\r\nIn the revision we added explanations providing additional intuition as to why we are making certain definitions, and a road map of how the main results are proved.\r\n\r\n>>Minor comments: \r\n>> - Definition 2, you have that C is included in {0, 1}^n. That makes C a vector, not a set. \r\n\r\nNo, a subset as we write $mathcal{C} subset mathcal{X}$ of the set of (binary) strings $mathcal{X}$ of length n is again a set of (binary) strings.  One could of course interpret it in terms of a vector of indicator functions, but this is not the approach needed here.\r\n\r\n>> - Proposition 8: I think that G_3 should be G_4.\r\n\r\nSorry for the confusion.  Again this is correct as is; G_4 would refer to binary strings of length 4, while the Proposition concerns strings of length 3."}, "nonreaders": [], "details": {"replyCount": 0, "overwriting": [], "revisions": false, "forumContent": {"title": "When Does a Mixture of Products Contain a Product of Mixtures?", "decision": "conferencePoster-iclr2013-workshop", "abstract": "We prove results on the relative representational power of mixtures of product distributions and restricted Boltzmann machines (products of mixtures of pairs of product distributions). Tools of independent interest are mode-based polyhedral approximations sensitive enough to compare full-dimensional models, and characterizations of possible modes and support sets of multivariate probability distributions that can be represented by both model classes. We find, in particular, that an exponentially larger mixture model, requiring an exponentially larger number of parameters, is required to represent probability distributions that can be represented by the restricted Boltzmann machines. The title question is intimately related to questions in coding theory and point configurations in hyperplane arrangements.", "pdf": "https://arxiv.org/abs/1206.0387", "paperhash": "montufar|when_does_a_mixture_of_products_contain_a_product_of_mixtures", "keywords": [], "conflicts": [], "authors": ["Guido F. Montufar", "Jason Morton"], "authorids": ["guidomontufar@googlemail.com", "jason.morton@gmail.com"]}, "tags": [], "invitation": {}}}, {"ddate": null, "legacy_migration": true, "tmdate": 1362582360000, "tcdate": 1362582360000, "number": 1, "id": "boGLoNdiUmbgV", "invitation": "ICLR.cc/2013/-/submission/review", "forum": "UUwuUaQ5qRyWn", "replyto": "UUwuUaQ5qRyWn", "signatures": ["anonymous reviewer 51ff"], "readers": ["everyone"], "writers": ["anonymous"], "content": {"title": "review of When Does a Mixture of Products Contain a Product of Mixtures?", "review": "This paper attempts at comparing mixture of factorial distributions (called product distributions) to RBMs. It does so by analyzing several theoretical properties, such as the smallest models which can represent any distribution with a given number of strong modes (or at least one of these distributions) or the smallest mixture which can represent all the distributions of a given RBM.\r\n\r\nThe relationship between RBMs and other models using hidden states is not fully understood and any clarification is welcome. Unfortunately, not only I am not sure the MoP is the most interesting class of models to analyze, but the theorems focus on extremely specific properties which severely limits their usefulness:\r\n- the definition of strong modes makes the proofs easier but it is hard to understand how they relate to 'interesting' distributions. I understand this is a very vague notion but I would have appreciated hints about how the distributions we care about tend to have a high number of strong modes.\r\n- the fact that there are exponentially many inference regions for an RBM whereas there are only a linear number of them for a MoP seems quite obvious, merely by counting the number of hidden states configurations. I understand this is far from a proof but this is to me more representative of the fact that one does not want to use the hidden states as a new representation for a MoP, which we already knew.\r\n\r\nAdditionnally, the paper is very heavy on definitions and gives very little intuition about the meaning of the results. Theorem 29 is a prime example as it takes a very long time to parse the result and I could really have used some intuition about the meaning of the result. This feeling is reinforced by the length of the paper (18 when the guidelines mentioned 9) and the inclusion of propositions which seem anecdotal (Prop.7, section 2.1, Corollary 18).\r\n\r\nIn conclusion, this paper tackles a problem which seems to be too contrived to be of general interest. Further, it is written in an unfriendly way which makes it more appropriate to a very technical crowd.\r\n\r\nMinor comments:\r\n- Definition 2, you have that C is included in {0, 1}^n. That makes C a vector, not a set.\r\n- Proposition 8: I think that G_3 should be G_4."}, "nonreaders": [], "details": {"replyCount": 0, "overwriting": [], "revisions": false, "forumContent": {"title": "When Does a Mixture of Products Contain a Product of Mixtures?", "decision": "conferencePoster-iclr2013-workshop", "abstract": "We prove results on the relative representational power of mixtures of product distributions and restricted Boltzmann machines (products of mixtures of pairs of product distributions). Tools of independent interest are mode-based polyhedral approximations sensitive enough to compare full-dimensional models, and characterizations of possible modes and support sets of multivariate probability distributions that can be represented by both model classes. We find, in particular, that an exponentially larger mixture model, requiring an exponentially larger number of parameters, is required to represent probability distributions that can be represented by the restricted Boltzmann machines. The title question is intimately related to questions in coding theory and point configurations in hyperplane arrangements.", "pdf": "https://arxiv.org/abs/1206.0387", "paperhash": "montufar|when_does_a_mixture_of_products_contain_a_product_of_mixtures", "keywords": [], "conflicts": [], "authors": ["Guido F. Montufar", "Jason Morton"], "authorids": ["guidomontufar@googlemail.com", "jason.morton@gmail.com"]}, "tags": [], "invitation": {}}}, {"ddate": null, "legacy_migration": true, "tmdate": 1362219240000, "tcdate": 1362219240000, "number": 3, "id": "dPNqPnWus1JhM", "invitation": "ICLR.cc/2013/-/submission/review", "forum": "UUwuUaQ5qRyWn", "replyto": "UUwuUaQ5qRyWn", "signatures": ["anonymous reviewer 6c04"], "readers": ["everyone"], "writers": ["anonymous"], "content": {"title": "review of When Does a Mixture of Products Contain a Product of Mixtures?", "review": "This paper compares the representational power of Restricted Boltzmann Machines\r\n(RBMs) with that of mixtures of product distributions. The main result is that\r\nRBMs can be exponentially more efficient (in terms of the number of parameters\r\nrequired) to represent some classes of probability distributions. This provides\r\ntheoretical justifications to the intuition behind the motivation for\r\ndistributed representations, i.e. that the combinations of an RBN's hidden\r\nunits can give rise to highly varying distributions, with a number of modes\r\nexponential in the model's size.\r\n\r\nThis paper is very dense, and unfortunately I had to fast-forward through it in\r\norder to be able to submit my review in time. Although most of the derivations\r\ndo not appear to be that complex, they build on existing results and concepts\r\nthat the typical machine learning crowd is typically unfamiliar with. As a\r\nresult, one can be quickly overwhelmed by the amount of new material to digest,\r\nand going through all steps of all proofs can take a long time.\r\n\r\nI believe the results are interesting since they provide a theoretical\r\nfoundation to ideas that have been motivating the use of distributed\r\nrepresentations. As a result, I think they are quite relevant to current\r\nresearch on learning representations, even if the practical insights seem\r\nlimited.\r\n\r\nThe maths appear to be solid, although I definitely did not check them in\r\ndepth. I appreciate the many references to previous work.\r\n\r\nOverall, I think this paper deserves being published, although I wish it was\r\nmade more accessible to the general machine learning audience, since in its\r\ncurrent state it takes a lot of motivation to go through it. Providing\r\nadditional discussion throughout the whole paper on the motivations and\r\ninsights behind these many theoretical results, instead of mostly limiting them\r\nto the introduction and discussion, would help the understanding and make the\r\npaper more enjoyable to read.\r\n\r\nPros: relevant theoretical results, (apparently) solid maths building on previous work\r\nCons: requires significant effort to read in depth, little practical use\r\n\r\nThings I did not understand:\r\n- Fig. 1 (as a whole)\r\n- Last paragraph of 1.1: why is this interesting?\r\n- Fig. 5 (not clear why it is in some kind of pseudo-3D and what is the meaning\r\nof all these lines -- also some explanations come after it is referenced, which\r\ndoes not help)\r\n- '(...) and therefore it contains distributions with (...)': I may be missing\r\nsomething obvious, but I did not follow the logical link ('therefore')\r\n- I am unable to parse Remark 22, not sure if there is a typo (double 'iff') or\r\nI am just not getting it.\r\n\r\nTypos or minor points:\r\n- It seems like Fig. 3 and 4 should be swapped to match the order in which they\r\nappear in the text\r\n- 'Figure 3 shows an example of the partitions (...) defined by the models\r\nM_2,4 and RBM_2,3' -> mention also 'for some specific parameter values' to be\r\nreally clear\r\n- Deptartment (x2)\r\n- Lebsegue\r\n- I believe the notation H_n is not explicitly defined (although it can be\r\ninferred from the definition of G_n)\r\n- There is a missing reference with a '?' on p. 9 after 'm <= 9'\r\n- It seems to me that section 6 is also related to the title of section 5.\r\nShould it be a subsection?\r\n- 'The product of mixtures represented by RBMs are (...)': products\r\n- 'Mixture model (...) generate': models"}, "nonreaders": [], "details": {"replyCount": 0, "overwriting": [], "revisions": false, "forumContent": {"title": "When Does a Mixture of Products Contain a Product of Mixtures?", "decision": "conferencePoster-iclr2013-workshop", "abstract": "We prove results on the relative representational power of mixtures of product distributions and restricted Boltzmann machines (products of mixtures of pairs of product distributions). Tools of independent interest are mode-based polyhedral approximations sensitive enough to compare full-dimensional models, and characterizations of possible modes and support sets of multivariate probability distributions that can be represented by both model classes. We find, in particular, that an exponentially larger mixture model, requiring an exponentially larger number of parameters, is required to represent probability distributions that can be represented by the restricted Boltzmann machines. The title question is intimately related to questions in coding theory and point configurations in hyperplane arrangements.", "pdf": "https://arxiv.org/abs/1206.0387", "paperhash": "montufar|when_does_a_mixture_of_products_contain_a_product_of_mixtures", "keywords": [], "conflicts": [], "authors": ["Guido F. Montufar", "Jason Morton"], "authorids": ["guidomontufar@googlemail.com", "jason.morton@gmail.com"]}, "tags": [], "invitation": {}}}, {"ddate": null, "legacy_migration": true, "tmdate": 1361559180000, "tcdate": 1361559180000, "number": 4, "id": "dYGvTnylo5TlF", "invitation": "ICLR.cc/2013/-/submission/review", "forum": "UUwuUaQ5qRyWn", "replyto": "UUwuUaQ5qRyWn", "signatures": ["anonymous reviewer 91ea"], "readers": ["everyone"], "writers": ["anonymous"], "content": {"title": "review of When Does a Mixture of Products Contain a Product of Mixtures?", "review": "The paper analyses the representational capacity of RBM's, contrasting it with other simple models.\r\n\r\nI think the results are new but I'm definitely not an expert on this field. They are likely to be interesting for people working on RBM's, and thus to people at ICLR."}, "nonreaders": [], "details": {"replyCount": 0, "overwriting": [], "revisions": false, "forumContent": {"title": "When Does a Mixture of Products Contain a Product of Mixtures?", "decision": "conferencePoster-iclr2013-workshop", "abstract": "We prove results on the relative representational power of mixtures of product distributions and restricted Boltzmann machines (products of mixtures of pairs of product distributions). Tools of independent interest are mode-based polyhedral approximations sensitive enough to compare full-dimensional models, and characterizations of possible modes and support sets of multivariate probability distributions that can be represented by both model classes. We find, in particular, that an exponentially larger mixture model, requiring an exponentially larger number of parameters, is required to represent probability distributions that can be represented by the restricted Boltzmann machines. The title question is intimately related to questions in coding theory and point configurations in hyperplane arrangements.", "pdf": "https://arxiv.org/abs/1206.0387", "paperhash": "montufar|when_does_a_mixture_of_products_contain_a_product_of_mixtures", "keywords": [], "conflicts": [], "authors": ["Guido F. Montufar", "Jason Morton"], "authorids": ["guidomontufar@googlemail.com", "jason.morton@gmail.com"]}, "tags": [], "invitation": {}}}, {"replyto": null, "ddate": null, "legacy_migration": true, "tmdate": 1357861500000, "tcdate": 1357861500000, "number": 10, "id": "UUwuUaQ5qRyWn", "invitation": "ICLR.cc/2013/conference/-/submission", "forum": "UUwuUaQ5qRyWn", "signatures": ["guidomontufar@googlemail.com"], "readers": ["everyone"], "content": {"title": "When Does a Mixture of Products Contain a Product of Mixtures?", "decision": "conferencePoster-iclr2013-workshop", "abstract": "We prove results on the relative representational power of mixtures of product distributions and restricted Boltzmann machines (products of mixtures of pairs of product distributions). Tools of independent interest are mode-based polyhedral approximations sensitive enough to compare full-dimensional models, and characterizations of possible modes and support sets of multivariate probability distributions that can be represented by both model classes. We find, in particular, that an exponentially larger mixture model, requiring an exponentially larger number of parameters, is required to represent probability distributions that can be represented by the restricted Boltzmann machines. The title question is intimately related to questions in coding theory and point configurations in hyperplane arrangements.", "pdf": "https://arxiv.org/abs/1206.0387", "paperhash": "montufar|when_does_a_mixture_of_products_contain_a_product_of_mixtures", "keywords": [], "conflicts": [], "authors": ["Guido F. Montufar", "Jason Morton"], "authorids": ["guidomontufar@googlemail.com", "jason.morton@gmail.com"]}, "writers": [], "details": {"replyCount": 5, "writable": false, "overwriting": [], "revisions": false, "tags": [], "invitation": {"rdate": null, "tddate": null, "ddate": null, "multiReply": null, "taskCompletionCount": null, "duedate": 1369422751717, "tmdate": 1496673673639, "cdate": 1496673673639, "tcdate": 1496673673639, "id": "ICLR.cc/2013/conference/-/submission", "writers": ["ICLR.cc/2013"], "signatures": ["OpenReview.net"], "readers": ["everyone"], "invitees": ["~"], "reply": {"forum": null, "replyto": null, "writers": {"values-regex": "~.*"}, "signatures": {"values-regex": "~.*", "description": "How your identity will be displayed with the above content."}, "readers": {"description": "The users who will be allowed to read the above content.", "values": ["everyone"]}, "content": {"pdf": {"required": true, "order": 5, "description": "Either upload a PDF file or provide a direct link to your PDF on ArXiv (link must begin with http(s) and end with .pdf)", "value-regex": "upload|(http|https):\\/\\/.+\\.pdf"}, "title": {"required": true, "order": 1, "description": "Title of paper.", "value-regex": ".{1,250}"}, "abstract": {"required": true, "order": 4, "description": "Abstract of paper.", "value-regex": "[\\S\\s]{1,5000}"}, "authors": {"required": true, "order": 2, "values-regex": "[^;,\\n]+(,[^,\\n]+)*", "description": "Comma separated list of author names, as they appear in the paper."}, "conflicts": {"required": true, "order": 100, "values-regex": "[^;,\\n]+(,[^,\\n]+)*", "description": "Comma separated list of email domains of people who would have a conflict of interest in reviewing this paper, (e.g., cs.umass.edu;google.com, etc.)."}, "keywords": {"order": 6, "description": "Comma separated list of keywords.", "values-dropdown": []}, "authorids": {"required": true, "order": 3, "values-regex": "[^;,\\n]+(,[^,\\n]+)*", "description": "Comma separated list of author email addresses, in the same order as above."}}}, "nonreaders": [], "noninvitees": [], "expdate": 1377198751717}}}], "count": 6}