{"notes": [{"ddate": null, "legacy_migration": true, "tmdate": 1394183340000, "tcdate": 1394183340000, "number": 6, "id": "9KMB9CLsoTqnD", "invitation": "ICLR.cc/2014/-/submission/conference/review", "forum": "z6PozRtCowzLe", "replyto": "z6PozRtCowzLe", "signatures": ["anonymous reviewer 9287"], "readers": ["everyone"], "writers": ["anonymous"], "content": {"title": "", "review": "I have read the authors' replies and skimmed the revised paper. The authors put some effort into improving and streamlining the paper (though the writing has issues, see below). Some main issues such as lack of significance remain.\r\n\r\nLike the other reviewers, I am not convinced that sampling from the model freely, without conditioning the visibles to some value, captures the experimental setup of [1]. That this is necessary to reproduce the relevant aspects of spontaneous activity appears to speak against the capability of the authors' model to capture the situation. Normatively, I don't see why spontaneous activity under lack of input should resemble the prior/model distribution, without further assumptions, such as active homeostatic mechanisms. Note that in the work of Berkes et al. that I mentioned earlier, they get around this by positing an additional global contrast variable that effectively renders the feature variables unobserved in darkness (they only mention this important aspect in the supporting material!).\r\n\r\nIn this context:\r\n\r\n'the authors reported to make the same findings during presenting a uniform gray screen to the cats as having the cats in a darkened room.'\r\n\r\n..but presumably the GDBM would *not* reproduce the results conditioned on a gray image as input?\r\n\r\nFinally, the revision of the paper has unfortunately introduced a lot of grammar issues as well as some typos, mostly wrong singular/plurals and missing/inappropriate articles (examples: 'expectated'; 'a brain learn to synthesize'; l23 of algorithm 1, y_model should be y_data). The paper should be proofread properly in case of its acceptance."}, "nonreaders": [], "details": {"replyCount": 0, "overwriting": [], "revisions": false, "forumContent": {"title": "Modeling correlations in spontaneous activity of visual cortex with centered Gaussian-binary deep Boltzmann machines", "decision": "submitted, no decision", "abstract": "Spontaneous cortical activity -- the ongoing cortical activities in absence of sensory input -- are considered to play a vital role in many aspects of both normal brain functions and mental dysfunctions. We present a centered Gaussian-binary deep Boltzmann machine (GDBM) for modeling the activity in visual cortex and relate the random sampling in DBMs to the spontaneous cortical activity. After training on natural image patches, the proposed model is able to learn the filters similar to the receptive fields of simple cells in V1. Furthermore, we show that the samples collected from random sampling in the centered GDBMs encompass similar activity patterns as found in the spontaneous cortical activity of the visual cortex. Specifically, filters having the same orientation preference tend to be active together during random sampling. Our work demonstrates the homeostasis learned by the centered GDBM and its potential for modeling visual cortical activity. Besides, the results support the hypothesis that the homeostatic mechanism exists in the cortex.", "pdf": "https://arxiv.org/abs/1312.6108", "paperhash": "wang|modeling_correlations_in_spontaneous_activity_of_visual_cortex_with_centered_gaussianbinary_deep_boltzmann_machines", "keywords": [], "conflicts": [], "authors": ["nan wang", "Laurenz Wiskott", "Dirk Jancke"], "authorids": ["nan.wang.28@googlemail.com", "laurenz.wiskott@rub.de", "jancke@neurobiologie.rub.de"]}, "tags": [], "invitation": {}}}, {"ddate": null, "legacy_migration": true, "tmdate": 1392779640000, "tcdate": 1392779640000, "number": 5, "id": "-unS-OOvqFPT3", "invitation": "ICLR.cc/2014/-/submission/conference/review", "forum": "z6PozRtCowzLe", "replyto": "z6PozRtCowzLe", "signatures": ["nan wang"], "readers": ["everyone"], "writers": ["anonymous"], "content": {"title": "", "review": "A revised version of this paper is now available at http://arxiv.org/abs/1312.6108."}, "nonreaders": [], "details": {"replyCount": 0, "overwriting": [], "revisions": false, "forumContent": {"title": "Modeling correlations in spontaneous activity of visual cortex with centered Gaussian-binary deep Boltzmann machines", "decision": "submitted, no decision", "abstract": "Spontaneous cortical activity -- the ongoing cortical activities in absence of sensory input -- are considered to play a vital role in many aspects of both normal brain functions and mental dysfunctions. We present a centered Gaussian-binary deep Boltzmann machine (GDBM) for modeling the activity in visual cortex and relate the random sampling in DBMs to the spontaneous cortical activity. After training on natural image patches, the proposed model is able to learn the filters similar to the receptive fields of simple cells in V1. Furthermore, we show that the samples collected from random sampling in the centered GDBMs encompass similar activity patterns as found in the spontaneous cortical activity of the visual cortex. Specifically, filters having the same orientation preference tend to be active together during random sampling. Our work demonstrates the homeostasis learned by the centered GDBM and its potential for modeling visual cortical activity. Besides, the results support the hypothesis that the homeostatic mechanism exists in the cortex.", "pdf": "https://arxiv.org/abs/1312.6108", "paperhash": "wang|modeling_correlations_in_spontaneous_activity_of_visual_cortex_with_centered_gaussianbinary_deep_boltzmann_machines", "keywords": [], "conflicts": [], "authors": ["nan wang", "Laurenz Wiskott", "Dirk Jancke"], "authorids": ["nan.wang.28@googlemail.com", "laurenz.wiskott@rub.de", "jancke@neurobiologie.rub.de"]}, "tags": [], "invitation": {}}}, {"ddate": null, "legacy_migration": true, "tmdate": 1392672840000, "tcdate": 1392672840000, "number": 1, "id": "CpiP7SSu0QN4Z", "invitation": "ICLR.cc/2014/-/submission/conference/reply", "forum": "z6PozRtCowzLe", "replyto": "xx3F9LbpiTMOy", "signatures": ["nan wang"], "readers": ["everyone"], "writers": ["anonymous"], "content": {"title": "", "reply": "Thanks for your helpful comments.\r\n\r\n1) “An important aspect of the solution learned by a DBM is the amount of sparsity. Authors do not use an explicit sparse penalty, but biases are shown in Algorithm 1 to be initialized to -4, suggesting that sparsity is still important.”\r\n\r\nWe agree that initializing the biases to -4 potentially encourage the sparse representation in the hidden layers. However, the claim that the learned representation is sparse needs further experiment supports. \r\n\r\n2) “The use of an unconstrained Gibbs sampler to compute spontaneous activities is questionable, as to my understanding, input should be deactivated. A more powerful result would be to show similar activation patterns when the input units are explicitly constrained to be inactive.”\r\n\r\nWe argue that it is not necessary to constrain the visible units to be inactive during modeling the spontaneous activity. Briefly, Spontaneous activity is the ongoing activity in the absence of intentional sensory input. Biologically, it is not necessary to cut off the bottom-up stimulus input [22] as in [6, 7]. See details in the response to the common comments C).\r\n\r\n3) “Conditional DBMs might be useful in this regard.”\r\n\r\nSorry for my limited knowledge. Could you please send me a link to the work on “conditional DBMs”?"}, "nonreaders": [], "details": {"replyCount": 0, "overwriting": [], "revisions": false, "forumContent": {"title": "Modeling correlations in spontaneous activity of visual cortex with centered Gaussian-binary deep Boltzmann machines", "decision": "submitted, no decision", "abstract": "Spontaneous cortical activity -- the ongoing cortical activities in absence of sensory input -- are considered to play a vital role in many aspects of both normal brain functions and mental dysfunctions. We present a centered Gaussian-binary deep Boltzmann machine (GDBM) for modeling the activity in visual cortex and relate the random sampling in DBMs to the spontaneous cortical activity. After training on natural image patches, the proposed model is able to learn the filters similar to the receptive fields of simple cells in V1. Furthermore, we show that the samples collected from random sampling in the centered GDBMs encompass similar activity patterns as found in the spontaneous cortical activity of the visual cortex. Specifically, filters having the same orientation preference tend to be active together during random sampling. Our work demonstrates the homeostasis learned by the centered GDBM and its potential for modeling visual cortical activity. Besides, the results support the hypothesis that the homeostatic mechanism exists in the cortex.", "pdf": "https://arxiv.org/abs/1312.6108", "paperhash": "wang|modeling_correlations_in_spontaneous_activity_of_visual_cortex_with_centered_gaussianbinary_deep_boltzmann_machines", "keywords": [], "conflicts": [], "authors": ["nan wang", "Laurenz Wiskott", "Dirk Jancke"], "authorids": ["nan.wang.28@googlemail.com", "laurenz.wiskott@rub.de", "jancke@neurobiologie.rub.de"]}, "tags": [], "invitation": {}}}, {"ddate": null, "legacy_migration": true, "tmdate": 1392672720000, "tcdate": 1392672720000, "number": 1, "id": "11cPC2SrPw-0t", "invitation": "ICLR.cc/2014/-/submission/conference/reply", "forum": "z6PozRtCowzLe", "replyto": "qqASqbr5SEqQm", "signatures": ["nan wang"], "readers": ["everyone"], "writers": ["anonymous"], "content": {"title": "", "reply": "Thanks for your helpful comments.\r\n1) \r\n1.1) “Receptive fields that resemble V1 and V2 (only a qualitative statement is made)”\r\n\r\nRemoved the statement suggesting that the model captures receptive field properties in V2. Please refer to the detailed discussion in the response to common comments 2).\r\n\r\n1.2) “Why are any of these results unexpected? … why is this model unique to the finding, or what does this teach me about the brain, or about the model?”\r\n\r\nClarified the contribution and conclusion of our work. See more details in the responses to common comments A). \r\n\r\nWe agree that a GDBM as a probabilistic model is expected to capture the statistical relationships in natural scene statistics. However, there two points we want to make here. \r\n\r\ni) The patterns found in the spontaneous visual cortical activity show similar properties as the prior distribution of the trained GDBMs, which has been mainly demonstrated in our paper. This suggests that a brain might learn to generate expectations of internal states as a generative model. \r\n\r\nii)  By comparing different models in modeling the spontaneous activity and different sampling procedures (, which is added in section 4 of the revised version), we suggest that the observed spontaneous activity patterns needs both bottom-up and top-down interactions. To be specific, we found that neither GRBMs nor DBNs can match the biological experiments as well as GDBMs. Besides, by clamping either the visible units or the second-layer hidden units to the centering offsets, we could not observe any activity patterns in the spontaneous frames even in the GDBMs. See more details in the responses to common comments E).\r\n\r\n2) “Another concern, is that the main result in Figure 3 is not very convincing.”\r\n\r\nClarified the purpose we plot Figure 4 (used to be Figure 3 in previous version) is to demonstrate that the spontaneous frames of centered GDBMs encompass similar properties as the spontaneous activity found in [1]. We wrote in section 3.2.3 of the revised version that “To establish the similarity between the single-condition maps and the spontaneous frames, we calculated the spatial correlation coefficients between them.”\r\n\r\n2.1) “Is there any statistical test to show the difference between the distributions in 3a? Why is the uncorrelated noise distribution the proper control?”\r\n\r\nIn Figure 4a, we have chosen the random generated activity patterns in order to show the correlations between the spontaneous frames and the orientation maps are stronger than expected by chance. We used t-test for checking the significance of the correlations, i.e. the threshold of significant correlation was chosen to be 0.182 (P<0.01) as described in the text. It can be seen in Figure 4a that the correlation coefficients between the spontaneous frames and the random generated patterns rarely exceed this threshold.\r\n\r\nWe added the description of statistical details of the distributions in Figure 4a and wrote '... the max correlation coefficient is 0.50+/-0.06, whereas the correlation coefficients between the spontaneous frames and the random generated pattern seldom reach 0.2'. \r\n\r\n2.2) “For Figure 3b, the max (solid blue line) looks pretty close to the relative occurrence line (solid red line), while the neural data seems to have larger divergence in these two measures. What is the important characteristic of this curve? Is there anything surprising about it? It peaks at 0 and 90, just like the neural data, but what makes this model unique to capturing this phenomenon?”\r\n\r\nAs for Figure 4b, we followed the convention in the Figure 3b in [1]. As in [1], the purpose is to show that i) states corresponding to cardinal orientations emerged with larger correlation coefficients than oblique ones, ii) the former emerged more often than the latter. As for the exact shape of the curves, it was highly variable as reported in [1]. Therefore, we argue that the spontaneous frames from the GDBMs show the same properties as the spontaneous activity in early visual cortex.\r\n\r\nWe added more interpretations of Figure 4b and wrote “The results match those from the cats; visual cortex in [1] fairly well, i.e. the spontaneous frames corresponding to the cardinal orientations emerged more often than those corresponding to the oblique ones and the former also have larger correlation coefficients.”\r\n\r\n3) \r\n3.1) “I find it most interesting that certain models show the observed behavior, while others do not (footnote 6). In fact, I would have preferred to see the entire paper revolve around this finding.”\r\n\r\nWe extended the footnote #6 into a new paragraphs in the discussion part to describe briefly the results from different models. Please refer to the common responses E). However, as for the detailed comparison of the results from different models, we find that they do not fit to the logic flow of current version and might exceed the page limits. Therefore we decide not to include them in the current ICLR version. But thanks for your tips. We will consider to include more details in the future.\r\n\r\n3.2) “Also, your title seems to indicate that a ‘centered Gaussian-binary DBM’ is necessary to fit the findings.”\r\n\r\nBy the current title, we want to emphasize two points, i) the centering is useful for training the proposed model, ii) the GDBM is a meaningful model for the spontaneous activity in early cortical visual areas. After revising the manuscript, we think the title fits the paper.\r\n\r\n4) “I am very confused about your use of the term ‘homeostatic’ '.\r\n\r\nRemoved the term “homeostasis” to avoid misunderstanding. See details in the response to the common comments D).\r\n\r\n5) “Why, in your model, isn't the spontaneous activity condition a situation where the input is black (or all zeros)? Isn't this the 'stimulus' condition that resembles the experiment? How should we model closing the eyes, going into a pitch black room, or severing the input from retina to LGN (or LGN to V1)?”\r\n\r\nClarified the reason why we do not clamp the visible units to zero in the discussion part. We argue that it is not necessary to constrain the visible units to be inactive during modeling the spontaneous activity. Briefly, Spontaneous activity is the ongoing activity in the absence of intentional sensory input. Biologically, it is not necessary to cut off the bottom-up stimulus input [22] as in [6, 7]. See details in the response to the common comments C).\r\n\r\n6) “Why did you use mean-field to approximate the response to the stimuli?”\r\n\r\nClarified we used mean-field estimation to estimate the response in order to be consistent with the way of estimating data-dependent term during learning. We have tried to use Gibb sampling in both cases, but we didn't observe any significant differences in our results. \r\n\r\n7) “I would prefer less detail on already published models and training algorithms, e.g. section 2.1 and Algorithm 1. and more detail on the experiment that you ran (sampling procedure, and explaining better the background of Figure 3b).”\r\n\r\n7.1) Although GDBM and centering have been published before, to our knowledge, it is first time to combine them together. Nevertheless, the formulas varies from the previous publication at several points, therefore we think it is reasonable and necessary to include the details of both the model and the algorithm.  \r\n\r\n7.2) Added more details of the samplings procedure in the section 3.2.1 and 3.2.2. An illustration of the sampling procedures is added in Figure 1.\r\n\r\n7.3) Added more interpretations of Figure 4. Please refer to 3) for details."}, "nonreaders": [], "details": {"replyCount": 0, "overwriting": [], "revisions": false, "forumContent": {"title": "Modeling correlations in spontaneous activity of visual cortex with centered Gaussian-binary deep Boltzmann machines", "decision": "submitted, no decision", "abstract": "Spontaneous cortical activity -- the ongoing cortical activities in absence of sensory input -- are considered to play a vital role in many aspects of both normal brain functions and mental dysfunctions. We present a centered Gaussian-binary deep Boltzmann machine (GDBM) for modeling the activity in visual cortex and relate the random sampling in DBMs to the spontaneous cortical activity. After training on natural image patches, the proposed model is able to learn the filters similar to the receptive fields of simple cells in V1. Furthermore, we show that the samples collected from random sampling in the centered GDBMs encompass similar activity patterns as found in the spontaneous cortical activity of the visual cortex. Specifically, filters having the same orientation preference tend to be active together during random sampling. Our work demonstrates the homeostasis learned by the centered GDBM and its potential for modeling visual cortical activity. Besides, the results support the hypothesis that the homeostatic mechanism exists in the cortex.", "pdf": "https://arxiv.org/abs/1312.6108", "paperhash": "wang|modeling_correlations_in_spontaneous_activity_of_visual_cortex_with_centered_gaussianbinary_deep_boltzmann_machines", "keywords": [], "conflicts": [], "authors": ["nan wang", "Laurenz Wiskott", "Dirk Jancke"], "authorids": ["nan.wang.28@googlemail.com", "laurenz.wiskott@rub.de", "jancke@neurobiologie.rub.de"]}, "tags": [], "invitation": {}}}, {"ddate": null, "legacy_migration": true, "tmdate": 1392671460000, "tcdate": 1392671460000, "number": 1, "id": "3L2EL04lEjLwS", "invitation": "ICLR.cc/2014/-/submission/conference/reply", "forum": "z6PozRtCowzLe", "replyto": "UXdhX88QhJXqm", "signatures": ["nan wang"], "readers": ["everyone"], "writers": ["anonymous"], "content": {"title": "", "reply": "Thanks for your helpful comments.\r\n1) “The centered GDBM.”\r\n\r\nClarified applying centering to Gaussian DBM is an extension of the previous work in [8]. The point we want to make here is that GDBM with centering can be trained without the pre-training procedure as described in [3]. In comparison, we followed the same setting in [3] with centered GDBM. The reconstruction error here is 41.6 +/- 0.40 compared to the results of about 40 in [3]. We agree that the minor differences are not sufficient to claim the advantages of centered GDBMs over the non-centered version. (This is also why we did not include this result in the previous version.) Importantly however, as shown in [8], centering leads to improved conditions. In our paper, we show that hidden units in both layers of the centered GDBM can learn meaningful features. Thus, our present results also show empirically that the centering helps to overcome the commonly observed difficulties during training of GDBMs. \r\n \r\nWe have added more details about the centering in the revised version. Because the main focus of this paper is to illustrate the capacity of GDBM in modeling spontaneous cortical activity, we did not include further analyses of the centering specifically for GDBMs. \r\n\r\n2) “Reproducing aspects of visual cortex”\r\n2.1) “I don't think it's possible to conclude that the model captures receptive field properties V2 well, just from looking at Figure 1b.”\r\n\r\nDone - We removed the statement suggesting that the model captures receptive field properties in V2. See more details in the responses to the common comments B). \r\n\r\n2.2) “What is missing is better motivating/explaining why these results are interesting/relevant. …. have we learned something new about the brain? Is the GDBM particularly well suited as a general model of visual cortex? Does the model make predictions? What about alternative, perhaps simpler models that could have been used instead? Etc. Also, are there related models or theoretical approaches to spontaneous activity?”\r\n\r\nWe mainly demonstrate that the GDBM is a meaningful model approach for basic receptive field properties and the emergence of spontaneous activity patterns in early cortical visual areas. Compared to other models for modeling spontaneous cortical activity, GDBMs (or DBMs in general) are not limited to simple, low-dimensional, non-hierarchical variables [7], but extend to generative, hierarchical-structured models with an unsupervised learning fashion.\r\n\r\nMoreover, by reproducing the findings in [1] with centered GDBMs, we suggest that i) the spontaneous activity in early visual cortex are the result of interactions between sensory inputs and feedbacks from higher areas, ii) thus, early visual areas are sufficient to generate the observed spontaneous activity patterns. \r\n\r\nTogether with the discussion of the failures to model the cortical activity with GRBMs and DBN (see details in the responses to the common comments E)), we have a new paragraph in the discussion to describe the interpretations of our results.\r\n\r\n2.3) “when collecting the spontaneous frames, presumably you are sampling from the full model distribution P(x,y,z) via Gibbs-sampling, with all layers unclamped, correct?”\r\n\r\nClarified - During collecting the spontaneous frames, we indeed ran sampling from the full model distribution P(X, Y, Z) via Gibbs-sampling with all layers unclamped. This sampling procedure is supposed to approximate the samples from the model’s prior distribution P(Y), which are the expected states of the Y without any knowledge of X and Z. And we use P(Y|x, z) from a single step during Gibbs sampling as an approximation of Y, which is referred as to a spontaneous frame.  We added more details of the samplings procedure in section 3.2.1 and 3.2.2. See more details in the responses to common comments C).\r\n\r\n3) “the connection between homeostasis and the author's model is unclear.”\r\n\r\nRemoved the term “homeostasis” to avoid misunderstanding. See more details in the responses to common comments D).\r\n\r\n4) “3.1 'sparse DBNs show worse match to the biological findings as reported in [1]. A quantitative comparison between centered GDBMs and sparse DBNs is still open for future studies.' Where was it shown to be a worse match then?”\r\n\r\nWe have attempted to use the (sparse) DBN to model the cortical activity. But the results show worse match to the biological results in [1] as the spontaneous frames show less correlation to the orientation maps. Both the comparison of results and the interpretation have been included in the revised discussion part. See more details in the responses to common comments E).\r\n\r\n5)\r\n* “Not sure why x,y,z are sometimes capitalized, sometimes not.”\r\n\r\nWe use the upper case letters to denote the un-instantiated variables, i.e. the values of variables are not given. In contrast, the lower case letters represent the instantiated variables.\r\n\r\n* “Figure 2: shouldn't the angles (figure titles) go from 0 to 180?”\r\n\r\nFigure 2: Done – Thanks for the hint, typo corrected. The angles should go from 0 to 180."}, "nonreaders": [], "details": {"replyCount": 0, "overwriting": [], "revisions": false, "forumContent": {"title": "Modeling correlations in spontaneous activity of visual cortex with centered Gaussian-binary deep Boltzmann machines", "decision": "submitted, no decision", "abstract": "Spontaneous cortical activity -- the ongoing cortical activities in absence of sensory input -- are considered to play a vital role in many aspects of both normal brain functions and mental dysfunctions. We present a centered Gaussian-binary deep Boltzmann machine (GDBM) for modeling the activity in visual cortex and relate the random sampling in DBMs to the spontaneous cortical activity. After training on natural image patches, the proposed model is able to learn the filters similar to the receptive fields of simple cells in V1. Furthermore, we show that the samples collected from random sampling in the centered GDBMs encompass similar activity patterns as found in the spontaneous cortical activity of the visual cortex. Specifically, filters having the same orientation preference tend to be active together during random sampling. Our work demonstrates the homeostasis learned by the centered GDBM and its potential for modeling visual cortical activity. Besides, the results support the hypothesis that the homeostatic mechanism exists in the cortex.", "pdf": "https://arxiv.org/abs/1312.6108", "paperhash": "wang|modeling_correlations_in_spontaneous_activity_of_visual_cortex_with_centered_gaussianbinary_deep_boltzmann_machines", "keywords": [], "conflicts": [], "authors": ["nan wang", "Laurenz Wiskott", "Dirk Jancke"], "authorids": ["nan.wang.28@googlemail.com", "laurenz.wiskott@rub.de", "jancke@neurobiologie.rub.de"]}, "tags": [], "invitation": {}}}, {"ddate": null, "legacy_migration": true, "tmdate": 1392671280000, "tcdate": 1392671280000, "number": 4, "id": "ArnEA1TfXQrHh", "invitation": "ICLR.cc/2014/-/submission/conference/review", "forum": "z6PozRtCowzLe", "replyto": "z6PozRtCowzLe", "signatures": ["nan wang"], "readers": ["everyone"], "writers": ["anonymous"], "content": {"title": "", "review": "=====Responses to the common comments from the Reviewers=====\r\nA)  Main contribution/importance of this work\r\nClarified in the conclusion that the contribution of this work has two folds:\r\n\r\ni) We applied centering trick to GDBMs and show empirically that centered GDBMs can be properly trained without layer-wise pretraining.\r\n\r\nii)  We mainly demonstrate that the GDBM is a meaningful model approach for basic receptive field properties and the emergence of spontaneous activity patterns in early cortical visual areas. We reproduced many aspects of the spontaneous activity with proposed model. Our results support hypotheses assuming that the brain learns to generate expectations of internal states as a generative model. The patterns of the spontaneous activity serve as such expectations. Furthermore, we gave some further insights into spontaneous activity patterns found in [1]. Please refer to E) for more details. \r\n  \r\nB) The statement of V2-like features in trained GDBMs\r\nRemoved the statement suggesting that the model captures receptive field properties in V2. \r\n\r\nHowever, we want to point out that the hidden units in the second hidden layer have the tendency to have strong connections to similar features in the first layer. We demonstrate that both hidden layers of the centered GDBMs are well trained and the centered GDBMs do not suffer from the problem reported in [9] in which the higher layers were not able to learn meaningful features.\r\n\r\nC) The sampling procedure used to generating spontaneous frames\r\nClarified sampling methods used in both generating orientation maps and collecting spontaneous frames.  An illustration of the sampling procedures used in this work has been added in Figure 1. We have included more details of the sampling procedure in section 3.2.1 and 3.2.2.\r\n\r\nClarified the reason why we do not clamp the visible units to zeroes, which is equivalent to clamp the units to the centering offsets in centered GDBMs, in the Discussion part. Briefly, there are two reasons. \r\n\r\ni) Spontaneous activity is the ongoing activity in the absence of intentional sensory input. Biologically, it is not necessary to cut off the bottom-up stimulus input [22] as in [6, 7], where the authors used DBMs to model the cortical activity with visual impairment or blindness. In [1], the authors reported to make the same findings during presenting a uniform gray screen to the cats as having the cats in a darkened room. \r\n\r\nii) From the perspective of modeling, we want to estimate samples from the model’s prior distribution over the first-hidden-layer units P(Y) by collecting from Gibbs sampling on the P(X, Y, Z). This sampling procedure bring us the samples that can be considered as the model’s expectation of Y without any bottom-up or top-down knowledge from X and Z. \r\nOur results suggest that both the bottom-up and the top-down inferences are critical in generating the presented spontaneous activity patterns. By setting the visible units to zeroes, a two-layer GDBM is equivalent to a restricted Boltzmann machine and show worse match to the biological findings in [1]. This is also the prediction we have included in the revised version, i.e. the observed spontaneous is a result of the interactions between the incoming stimulation and feedback from higher areas. Please refer to E) for more details. \r\n  \r\nD) The misleading usage of “homeostasis”\r\nRemoved the term “homeostasis” to avoid misunderstanding. \r\n\r\nWe agree that the term 'homeostasis' as used could be misleading as the term is nowadays often used in structural plasticity approaches. By 'homeostasis', we mean in a very general sense that the stable status of the internal milieu in the brain as suggested in the free-energy principle. To our understanding, Friston suggests two different environments, i.e. external and internal milieu, and the biological agents are supposed to keep the homeostasis in both cases. Please refer to the following reference for more details:\r\nKarl Friston. The free-energy principle: a unified brain theory? Nature Reviews Neuroscience, 1-12, 2010. \r\nIn current DBM frameworks, we lack the 'action' to interact with the external environment. Still, to learn generating a proper expectation of internal states appears a possible way to keep homeostasis of the internal milieu in the face of constantly changing sensory inputs. In contrast, [6, 7] refer 'homeostasis' as to homeostatic plasticity (see above), i.e.  neurons keep their firing rate at a certain level by adapting its bias term during inference. This can be considered as another alternative to keep homeostasis in the theory of free energy principle. Nevertheless, it is an interesting direction to point to the connection between GDBM and homeostatic plasticity in the context of the, admittedly very general, free-energy principle.\r\n\r\nE) Comparisons between different models for modeling spontaneous activity\r\nAdded descriptions of the experiment results with different models used on trial together with the further interpretations. \r\n\r\nIn our experiments, we compared different models (including GDBMs, GRBMs and DBNs) in modeling the spontaneous activity and found that only GDBMs can match the biological experiments faithfully.  The maximum correlation coefficient between spontaneous frames and the orientation maps was 0.50+/-0.06 in GDBMs. In comparison, other models seldom reached 0.2. Furthermore, less than 2% spontaneous frames were significantly in other models, compared with 18+/-9% in the case of GDBMs. \r\n\r\nA possible explanation is that GDBMs use both top-down and bottom-up interactions during inference. In comparison, GRBMs and DBN use either the bottom-up or the top-down inference, in which the samples collected from the model distribution do not show similar activity patterns as found in the spontaneous cortical activity. Besides, by clamping either the visible units or the second-layer hidden units to the centering offsets, we did not observe the reported activity patterns in the spontaneous frames from GDBMs. These results suggest that the spontaneous activity in visual cortex is a result of interaction between the incoming stimulation and feedback from higher areas."}, "nonreaders": [], "details": {"replyCount": 0, "overwriting": [], "revisions": false, "forumContent": {"title": "Modeling correlations in spontaneous activity of visual cortex with centered Gaussian-binary deep Boltzmann machines", "decision": "submitted, no decision", "abstract": "Spontaneous cortical activity -- the ongoing cortical activities in absence of sensory input -- are considered to play a vital role in many aspects of both normal brain functions and mental dysfunctions. We present a centered Gaussian-binary deep Boltzmann machine (GDBM) for modeling the activity in visual cortex and relate the random sampling in DBMs to the spontaneous cortical activity. After training on natural image patches, the proposed model is able to learn the filters similar to the receptive fields of simple cells in V1. Furthermore, we show that the samples collected from random sampling in the centered GDBMs encompass similar activity patterns as found in the spontaneous cortical activity of the visual cortex. Specifically, filters having the same orientation preference tend to be active together during random sampling. Our work demonstrates the homeostasis learned by the centered GDBM and its potential for modeling visual cortical activity. Besides, the results support the hypothesis that the homeostatic mechanism exists in the cortex.", "pdf": "https://arxiv.org/abs/1312.6108", "paperhash": "wang|modeling_correlations_in_spontaneous_activity_of_visual_cortex_with_centered_gaussianbinary_deep_boltzmann_machines", "keywords": [], "conflicts": [], "authors": ["nan wang", "Laurenz Wiskott", "Dirk Jancke"], "authorids": ["nan.wang.28@googlemail.com", "laurenz.wiskott@rub.de", "jancke@neurobiologie.rub.de"]}, "tags": [], "invitation": {}}}, {"ddate": null, "legacy_migration": true, "tmdate": 1391970120000, "tcdate": 1391970120000, "number": 3, "id": "xx3F9LbpiTMOy", "invitation": "ICLR.cc/2014/-/submission/conference/review", "forum": "z6PozRtCowzLe", "replyto": "z6PozRtCowzLe", "signatures": ["anonymous reviewer 299e"], "readers": ["everyone"], "writers": ["anonymous"], "content": {"title": "review of Modeling correlations in spontaneous activity of visual cortex with centered Gaussian-binary deep Boltzmann machines", "review": "This paper revisits on a simulated model learned from data, previous work by Kenet et al. 2003 in the journal Nature, on the statistics of spontaneous neural activities in the visual cortex, in particular, their correlations to orientation maps. The authors first learn to model image patches in an unsupervised fashion. In a second step, the spontaneous hidden activities produced by the learned model are recorded and compared to the ones observed by Kenet et al. 2003.\r\n\r\nThe authors build on the centered deep Boltzmann machines, adapting them to real-valued Gaussian-like inputs. An important aspect of the solution learned by a DBM is the amount of sparsity. Authors do not use an explicit sparse penalty, but biases are shown in Algorithm 1 to be initialized to -4, suggesting that sparsity is still important.\r\n\r\nActivation patterns produced by the proposed model are shown to be similar to measurements by Kenet et al. 2003 on real neural activity. The use of an unconstrained Gibbs sampler to compute spontaneous activities is questionable, as to my understanding, input should be deactivated. A more powerful result would be to show similar activation patterns when the input units are explicitly constrained to be inactive. Conditional DBMs might be useful in this regard."}, "nonreaders": [], "details": {"replyCount": 0, "overwriting": [], "revisions": false, "forumContent": {"title": "Modeling correlations in spontaneous activity of visual cortex with centered Gaussian-binary deep Boltzmann machines", "decision": "submitted, no decision", "abstract": "Spontaneous cortical activity -- the ongoing cortical activities in absence of sensory input -- are considered to play a vital role in many aspects of both normal brain functions and mental dysfunctions. We present a centered Gaussian-binary deep Boltzmann machine (GDBM) for modeling the activity in visual cortex and relate the random sampling in DBMs to the spontaneous cortical activity. After training on natural image patches, the proposed model is able to learn the filters similar to the receptive fields of simple cells in V1. Furthermore, we show that the samples collected from random sampling in the centered GDBMs encompass similar activity patterns as found in the spontaneous cortical activity of the visual cortex. Specifically, filters having the same orientation preference tend to be active together during random sampling. Our work demonstrates the homeostasis learned by the centered GDBM and its potential for modeling visual cortical activity. Besides, the results support the hypothesis that the homeostatic mechanism exists in the cortex.", "pdf": "https://arxiv.org/abs/1312.6108", "paperhash": "wang|modeling_correlations_in_spontaneous_activity_of_visual_cortex_with_centered_gaussianbinary_deep_boltzmann_machines", "keywords": [], "conflicts": [], "authors": ["nan wang", "Laurenz Wiskott", "Dirk Jancke"], "authorids": ["nan.wang.28@googlemail.com", "laurenz.wiskott@rub.de", "jancke@neurobiologie.rub.de"]}, "tags": [], "invitation": {}}}, {"ddate": null, "legacy_migration": true, "tmdate": 1391823840000, "tcdate": 1391823840000, "number": 2, "id": "qqASqbr5SEqQm", "invitation": "ICLR.cc/2014/-/submission/conference/review", "forum": "z6PozRtCowzLe", "replyto": "z6PozRtCowzLe", "signatures": ["anonymous reviewer 8f00"], "readers": ["everyone"], "writers": ["anonymous"], "content": {"title": "review of Modeling correlations in spontaneous activity of visual cortex with centered Gaussian-binary deep Boltzmann machines", "review": "In this paper the authors train a DBM model on natural image patches, conduct a pseudo-physiology experiment on the model, and show that the spontaneous correlation structure of the model resembles that in a V1 experiment.\r\n\r\nThe claimed results of the paper are:\r\n+ Receptive fields that resemble V1 and V2 (only a qualitative statement is made)\r\n+ Correlation structure that resembles spontaneous activity\r\n\r\nMy biggest concern relates to the question, 'Why are any of these results unexpected?'  The V1 and V2 receptive field results have been previously reported (ad nauseam for V1), and are not the focus of the paper, so I will ignore these.  The correlation structure also appears to be a result entirely expected by the model construction.  Isn't it the case that the DBM should be capturing statistical relationships in natural images and that co-linearity (and feature non-orthogonality, or high inner product) is a well known property of natural scene statistics?  Taking the results at face value, why is this model unique to the finding, or what does this teach me about the brain, or about the model?\r\n\r\nAnother concern, is that the main result in Figure 3 is not very convincing.  Is there any statistical test to show the difference between the distributions in 3a?  Why is the uncorrelated noise distribution the proper control?  For Figure 3b, the max (solid blue line) looks pretty close to the relative occurrence line (solid red line), while the neural data seems to have larger divergence in these two measures.  What is the important characteristic of this curve?  Is there anything surprising about it?  It peaks at 0 and 90, just like the neural data, but what makes this model unique to capturing this phenomena?\r\n\r\nSome of the most interesting statements in the paper are given in the footnotes or stated as ongoing work.  For example, I find it most interesting that certain models show the observed behavior, while others do not (footnote 6).  In fact, I would have preferred to see the entire paper revolve around this finding.  Far too many papers of this type propose one and only one model to account for the data.  The advancement of this type of work requires the comparison of models and the invalidation of models.  Also, your title seems to indicate that a 'centered Gaussian-binary DBM' is necessary to fit the findings.\r\n\r\nI am very confused about your use of the term 'homeostatic'.  You seem to refer to homeostatic as the condition where you sample from your model with the input unclamped.  However, in biology homeostasis is the regulation of variables (or machinery) such that some state is held fixed.  I thought that homeostasis in your model would be more related to learning, i.e. weight updates.\r\n\r\nWhy, in your model, isn't the spontaneous activity condition a situation where the input is black (or all zeros)?  Isn't this the 'stimulus' condition that resembles the experiment?  How should we model closing the eyes, going into a pitch black room, or severing the input from retina to LGN (or LGN to V1)?\r\n\r\nWhy did you use mean-field to approximate the response to the stimuli?  This means for one condition you run mean-field and the other you run sampling.  It seems that this just introduces discrepancy between the conditions.\r\n\r\nA note on exposition, I would prefer less detail on already published models and training algorithms, e.g. section 2.1 and Algorithm 1. and more detail on the experiment that you ran (sampling procedure, and explaining better the background of Figure 3b)."}, "nonreaders": [], "details": {"replyCount": 0, "overwriting": [], "revisions": false, "forumContent": {"title": "Modeling correlations in spontaneous activity of visual cortex with centered Gaussian-binary deep Boltzmann machines", "decision": "submitted, no decision", "abstract": "Spontaneous cortical activity -- the ongoing cortical activities in absence of sensory input -- are considered to play a vital role in many aspects of both normal brain functions and mental dysfunctions. We present a centered Gaussian-binary deep Boltzmann machine (GDBM) for modeling the activity in visual cortex and relate the random sampling in DBMs to the spontaneous cortical activity. After training on natural image patches, the proposed model is able to learn the filters similar to the receptive fields of simple cells in V1. Furthermore, we show that the samples collected from random sampling in the centered GDBMs encompass similar activity patterns as found in the spontaneous cortical activity of the visual cortex. Specifically, filters having the same orientation preference tend to be active together during random sampling. Our work demonstrates the homeostasis learned by the centered GDBM and its potential for modeling visual cortical activity. Besides, the results support the hypothesis that the homeostatic mechanism exists in the cortex.", "pdf": "https://arxiv.org/abs/1312.6108", "paperhash": "wang|modeling_correlations_in_spontaneous_activity_of_visual_cortex_with_centered_gaussianbinary_deep_boltzmann_machines", "keywords": [], "conflicts": [], "authors": ["nan wang", "Laurenz Wiskott", "Dirk Jancke"], "authorids": ["nan.wang.28@googlemail.com", "laurenz.wiskott@rub.de", "jancke@neurobiologie.rub.de"]}, "tags": [], "invitation": {}}}, {"ddate": null, "legacy_migration": true, "tmdate": 1391114880000, "tcdate": 1391114880000, "number": 1, "id": "UXdhX88QhJXqm", "invitation": "ICLR.cc/2014/-/submission/conference/review", "forum": "z6PozRtCowzLe", "replyto": "z6PozRtCowzLe", "signatures": ["anonymous reviewer 9287"], "readers": ["everyone"], "writers": ["anonymous"], "content": {"title": "review of Modeling correlations in spontaneous activity of visual cortex with centered Gaussian-binary deep Boltzmann machines", "review": "The authors use a Gaussian-binary deep Boltzmann machine (GDBM) to model aspects of visual cortex. Training of the GDBM involves the centering trick of [8]. The comparison to visual cortex is in terms of learned receptive field properties, and by reproducing experimentally observed properties of activity in V1 as reported by [1]. In particular, these findings relate spontaneous activity in the absence of external stimulation to evoked activity.\r\n\r\nOn the positive side, I think the issue of the nature of spontaneous activity is interesting, and the authors put effort into reproducing the experimental findings of [1]. On the negative side, the significance of the main contributions seems lacking to me, and the authors need to motivate better why their work is important or relevant. Quality and clarity need to be improved in several points as well.\r\n\r\n\r\nDetails:\r\n\r\nTo expand on the above, I'll discuss three main points: 1) The centered GDBM. 2) Reproducing aspects of visual cortex. 3) The connection to homeostasis.\r\n\r\n1) I wouldn't see this part as a major contribution of the paper. The centering trick was originally applied to a fully binary DBM. Applying the same trick to the GDBM (which only differs in having a Gaussian visible layer) seems a very natural thing to do. Moreover, there is no further analysis on the efficacy of the centering trick. The authors say that centering makes the GDBM easy to train compared to [15], but they don't actually evaluate the performance of the GDBM (other than comparing it to biological phenomenology), and only apply it to image patches. In [15], the GDBM was trained on images of faces and evaluated in terms of filling in missing parts of the image. Hence, it is not clear whether centering makes the more complicated training of [15] obsolete, as suggested by the authors.\r\n\r\nAlso, when it comes to clarity: given that the authors emphasize the importance of centering, they need to better explain what it is, why it works, and how the centering parameters are computed (the latter is only described in the algorithm float). These things are unclear to the reader unless they look at the reference.\r\n\r\n\r\n2) Reproducing aspects of visual cortex is the main contribution of the paper. First, the learned receptive fields are suggested to qualitatively resemble those in V1 and V2. Learning V1-like Gabor filters is of course a quite common result nowadays. I don't think it's possible to conclude that the model captures receptive field properties V2 well, just from looking at Figure 1b.\r\n\r\nHence, the main contribution here is the analysis of activity. I think the results are fine and somewhat interesting, though not surprising. What is missing is better motivating/explaining why these results are interesting/relevant. Sure, the GDBM reproduces certain experimental findings. But have we learned something new about the brain? Is the GDBM particularly well suited as a general model of visual cortex? Does the model make predictions? What about alternative, perhaps simpler models that could have been used instead? Etc.\r\n\r\nAlso, are there related models or theoretical approaches to spontaneous activity? For example, this comes to mind:\r\n\r\nBerkes, P., Orbán, G., Lengyel, M., & Fiser, J. (2011). Spontaneous cortical activity reveals hallmarks of an optimal internal model of the environment. Science (New York, N.Y.), 331(6013), 83–7. doi:10.1126/science.1195870\r\n\r\nAs for clarity: when collecting the spontaneous frames, presumably you are sampling from the full model distribution P(x,y,z) via Gibbs-sampling, with all layers unclamped, correct? Because writing that samples were collected from P(y|x,z) seems to suggest that you clamp to a specific x and z and collect multiple samples from the same conditional (not just as a step during Gibbs sampling). \r\n\r\n\r\n3) Lastly, the connection between homeostasis and the author's model is unclear. The authors mention homeostasis in the abstract, introduction and discussion, but do not explain homeostasis or how their results relate to it specifically. This needs to be explained better, especially to this audience. Personally, I know the literature somewhat (e.g. [4]), but am nevertheless unclear about what exactly the authors intend to say. \r\nSentences such as 'we are able to make the model learn the homeostasis from natural image patches' are unclear.\r\n\r\nWhen I first read the paper, I thought the authors were referring to the centering trick as something that can be understood as a homeostatic mechanism (i.e., a neuronal mechanism that maintains a certain average firing rate, see [4], [6,7]), which would make sense to me. However, on further reading it seems to me that the authors refer to the fact that spontaneous activity resembles evoked activity as an aspect of homeostasis? Why? For comparison, [6,7] clamped the input to empty images (to simulate blindness), and had an active homeostatic mechanism at play that led to spontaneous activity resembling evoked activity. In the authors' paper, spontaneous activity resembles evoked activity simply because the former is taken to be sampled from the unconditioned model distribution..? I'm not sure where homeostasis, i.e. being subject to an active self-regularity mechanism, comes into play at this point.\r\n\r\n(As an aside, I don't think the Friston reference [3] clears up what the authors' notion of homeostasis is, in particular as Friston talks about states of agents in their environments. Frankly, Friston's theoretical claims are often unclear to me, to say the least, in particular when it comes to mixing together internal models in the brain, and methods that should apply to the latter such as variational inference, and external probabilistic descriptions of agents and environments. Either way, if the authors would like to make a connection to Friston's theories in particular, then that connection should be explained better. Generative/predictive brain models and homeostatic mechanisms per se are not exclusive to Friston's theory.)\r\n\r\n\r\nFurther comments:\r\n\r\n* Abstract, 'Spontaneous cortical activity [...] are' -> is\r\n\r\n* 2.1 first para, 'consisted' -> consisting\r\n\r\n* Not sure why x,y,z are sometimes capitalized, sometimes not.\r\n\r\n* 3.1 'sparse DBNs show worse match to the biological findings as reported in [1]. A quantitative comparison between centered GDBMs and sparse DBNs is still open for future studies.' Where was it shown to be a worse match then?\r\n\r\n* Figure 2: shouldn't the angles (figure titles) go from 0 to 180?\r\n\r\n\r\nIn conclusion, I think this work could potentially be interesting, but in its current form quality and clarity are somewhat lacking and significance is not quite clear."}, "nonreaders": [], "details": {"replyCount": 0, "overwriting": [], "revisions": false, "forumContent": {"title": "Modeling correlations in spontaneous activity of visual cortex with centered Gaussian-binary deep Boltzmann machines", "decision": "submitted, no decision", "abstract": "Spontaneous cortical activity -- the ongoing cortical activities in absence of sensory input -- are considered to play a vital role in many aspects of both normal brain functions and mental dysfunctions. We present a centered Gaussian-binary deep Boltzmann machine (GDBM) for modeling the activity in visual cortex and relate the random sampling in DBMs to the spontaneous cortical activity. After training on natural image patches, the proposed model is able to learn the filters similar to the receptive fields of simple cells in V1. Furthermore, we show that the samples collected from random sampling in the centered GDBMs encompass similar activity patterns as found in the spontaneous cortical activity of the visual cortex. Specifically, filters having the same orientation preference tend to be active together during random sampling. Our work demonstrates the homeostasis learned by the centered GDBM and its potential for modeling visual cortical activity. Besides, the results support the hypothesis that the homeostatic mechanism exists in the cortex.", "pdf": "https://arxiv.org/abs/1312.6108", "paperhash": "wang|modeling_correlations_in_spontaneous_activity_of_visual_cortex_with_centered_gaussianbinary_deep_boltzmann_machines", "keywords": [], "conflicts": [], "authors": ["nan wang", "Laurenz Wiskott", "Dirk Jancke"], "authorids": ["nan.wang.28@googlemail.com", "laurenz.wiskott@rub.de", "jancke@neurobiologie.rub.de"]}, "tags": [], "invitation": {}}}, {"replyto": null, "ddate": null, "legacy_migration": true, "tmdate": 1387779720000, "tcdate": 1387779720000, "number": 25, "id": "z6PozRtCowzLe", "invitation": "ICLR.cc/2014/conference/-/submission", "forum": "z6PozRtCowzLe", "signatures": ["nan.wang.28@googlemail.com"], "readers": ["everyone"], "content": {"title": "Modeling correlations in spontaneous activity of visual cortex with centered Gaussian-binary deep Boltzmann machines", "decision": "submitted, no decision", "abstract": "Spontaneous cortical activity -- the ongoing cortical activities in absence of sensory input -- are considered to play a vital role in many aspects of both normal brain functions and mental dysfunctions. We present a centered Gaussian-binary deep Boltzmann machine (GDBM) for modeling the activity in visual cortex and relate the random sampling in DBMs to the spontaneous cortical activity. After training on natural image patches, the proposed model is able to learn the filters similar to the receptive fields of simple cells in V1. Furthermore, we show that the samples collected from random sampling in the centered GDBMs encompass similar activity patterns as found in the spontaneous cortical activity of the visual cortex. Specifically, filters having the same orientation preference tend to be active together during random sampling. Our work demonstrates the homeostasis learned by the centered GDBM and its potential for modeling visual cortical activity. Besides, the results support the hypothesis that the homeostatic mechanism exists in the cortex.", "pdf": "https://arxiv.org/abs/1312.6108", "paperhash": "wang|modeling_correlations_in_spontaneous_activity_of_visual_cortex_with_centered_gaussianbinary_deep_boltzmann_machines", "keywords": [], "conflicts": [], "authors": ["nan wang", "Laurenz Wiskott", "Dirk Jancke"], "authorids": ["nan.wang.28@googlemail.com", "laurenz.wiskott@rub.de", "jancke@neurobiologie.rub.de"]}, "writers": [], "details": {"replyCount": 9, "writable": false, "overwriting": [], "revisions": false, "tags": [], "invitation": {"rdate": null, "tddate": null, "ddate": null, "multiReply": null, "taskCompletionCount": null, "duedate": 1369422751717, "tmdate": 1496674357195, "id": "ICLR.cc/2014/conference/-/submission", "writers": ["ICLR.cc/2014"], "signatures": ["OpenReview.net"], "readers": ["everyone"], "invitees": ["~"], "reply": {"forum": null, "replyto": null, "writers": {"values-regex": "~.*"}, "signatures": {"values-regex": "~.*", "description": "How your identity will be displayed with the above content."}, "readers": {"description": "The users who will be allowed to read the above content.", "values": ["everyone"]}, "content": {"pdf": {"required": true, "order": 5, "description": "Either upload a PDF file or provide a direct link to your PDF on ArXiv (link must begin with http(s) and end with .pdf)", "value-regex": "upload|(http|https):\\/\\/.+\\.pdf"}, "title": {"required": true, "order": 1, "description": "Title of paper.", "value-regex": ".{1,250}"}, "abstract": {"required": true, "order": 4, "description": "Abstract of paper.", "value-regex": "[\\S\\s]{1,5000}"}, "authors": {"required": true, "order": 2, "values-regex": "[^;,\\n]+(,[^,\\n]+)*", "description": "Comma separated list of author names, as they appear in the paper."}, "conflicts": {"required": true, "order": 100, "values-regex": "[^;,\\n]+(,[^,\\n]+)*", "description": "Comma separated list of email domains of people who would have a conflict of interest in reviewing this paper, (e.g., cs.umass.edu;google.com, etc.)."}, "keywords": {"order": 6, "description": "Comma separated list of keywords.", "values-dropdown": []}, "authorids": {"required": true, "order": 3, "values-regex": "[^;,\\n]+(,[^,\\n]+)*", "description": "Comma separated list of author email addresses, in the same order as above."}}}, "nonreaders": [], "noninvitees": [], "expdate": 1377198751717, "cdate": 1496674357195}}}], "count": 10}