{"paper": {"title": "Prototypical Networks for Few-shot Learning", "authors": ["Jake Snell", "Kevin Swersky", "Richard Zemel"], "authorids": ["jsnell@cs.toronto.edu", "kswersky@twitter.com", "zemel@cs.toronto.edu"], "summary": "We learn a metric space in which few-shot classification can be performed by computing Euclidean distances to a single prototype representative of each class.", "abstract": "A recent approach to few-shot classification called matching networks has demonstrated the benefits of coupling metric learning with a training procedure that mimics test. This approach relies on a complicated fine-tuning procedure and an attention scheme that forms a distribution over all points in the support set, scaling poorly with its size. We propose a more streamlined approach, prototypical networks, that learns a metric space in which few-shot classification can be performed by computing Euclidean distances to prototype representations of each class, rather than individual points. Our method is competitive with state-of-the-art one-shot classification approaches while being much simpler and more scalable with the size of the support set. We empirically demonstrate the performance of our approach on the Omniglot and mini-ImageNet datasets. We further demonstrate that a similar idea can be used for zero-shot learning, where each class is described by a set of attributes, and achieve state-of-the-art results on the Caltech UCSD bird dataset.", "keywords": ["Deep learning", "Transfer Learning"]}, "meta": {"decision": "Reject", "comment": "The program committee appreciates the authors' response to concerns raised in the reviews. Unfortunately, reviews are not leaning sufficiently towards acceptance. Reviewers have concerns about the relationships of this work to existing work in literature (both in terms of a discussion to clarify the novelty, and in terms of more complete empirical comparisons). Authors are strongly encouraged to incorporate reviewer feedback in future iterations of the work."}, "review": {"BJBfN73Hl": {"type": "rebuttal", "replyto": "Hk8Jice4g", "comment": "Thank you very much for your review. Regarding the CUB result, we ran experiments where we replaced the AlexNet features with GoogLeNet features and obtained a result of 54.6% accuracy (please see Table 3 of our paper revision dated Dec 6, 2016). We believe this truly represents the state of the art at this point in time. Regarding Omniglot and miniImagenet, we originally reported the non-FCE/fine-tuned matching networks results because we wanted to keep the comparison limited to the basic models themselves. However, we agree that we should be thorough in our reporting and will include these results as well.\n\nRegarding the relevant literature, both our model and LMNNs are based on Neighborhood Component Analysis and we believe that our model is more similar to NCA than to LMNN, as we do not use a margin-based loss and do not pre-select a set of target neighbors. We believe that our model is closest in spirit to nonlinear NCA (from follow-up work by Salakhutdinov and Hinton, 2007). We are certainly happy to include your provided references from the metric learning literature as they are indeed relevant. We will also include a reference to the learning to rank literature as it relates to siamese networks, although we feel that this criticism applies to the current one-shot learning literature as opposed to just our paper.", "title": "Clarifications regarding results and related work"}, "B1uOZQnHg": {"type": "rebuttal", "replyto": "Sk8_1xWVx", "comment": "Thanks for taking the time to review our paper. Including pseudocode is a valuable suggestion -- we will update the paper to include this.", "title": "Thanks for your review"}, "rkJagQ2re": {"type": "rebuttal", "replyto": "ByaTpJBVx", "comment": "We thank Reviewer 2 for reviewing our paper. This review’s main criticism is that our approach is too similar to the matching networks model proposed by Vinyals et al. 2016. We will update the related work section of our paper to clarify the relationship between prototypical networks and matching nets. In the meantime, we would like to take this opportunity to elaborate upon some of the benefits of our approach relative to matching networks: better computational efficiency, a simpler form for the classifier, and a straightforward extension to the zero-shot setting.\n\nFirst and foremost, prototypical networks are computationally more efficient than matching networks. If there are K classes, each with N support examples, then computing distances for a query point will take O(K) time for prototypical networks vs. O(KN) for matching networks. This is indeed a 5x speedup for the 5-shot scenario, which though not enormous is also not insignificant. Even slightly larger scales such as N=10 or N=100 would lead to useful performance gains. We see favorable applications of our approach to tasks such as document tagging where it is important to quickly label new documents without needing to compute distances to multiple support examples per tag.\n\nSecond is the simpler expression of our classifier (see Section 3.2 of our paper) compared to the non-parametric form of matching networks. Not only does this require less storage (O(K) vs. O(KN)) but it also sets the stage for future work that explores the prediction of alternate classifiers beyond the linear ones we investigate here.\n\nFinally, our approach affords a straightforward extension to the zero-shot setting that matching networks do not. The matching networks approach is fundamentally about embedding support examples whereas prototypical networks focuses on learning an embedded representation for each class. For the few-shot scenario we chose our representation to be the mean of embedded points, while for the zero-shot scenario we utilized the embedded metadata. Such a generalization of the matching networks approach to zero-shot classification does not exist.", "title": "Clarification of relationship to matching networks"}, "HyIBmnNQe": {"type": "rebuttal", "replyto": "H1pDow0Gg", "comment": "Hi,\n\nThanks for your question. In light of the linked paper by Reed et al. 2016, we have updated the zero-shot CUB section of our paper with new results. We trained our model on GoogLeNet extracted features, as the DA-SJE/DS-SJE approach does. We continue to use the 312-dimensional continuous attribute vectors. We achieve accuracy of 54.6%, compared to DA-SJE which gets 50.9% on top of attribute vectors.\n\nCheers,\nJake", "title": "CUB section updated with new results"}, "H1pDow0Gg": {"type": "review", "replyto": "B1-Hhnslg", "review": "There is another paper reporting zero-shot classification on CUB that appears to use the same protocol and get a better (state-of-the-art) result, using text features instead of attributes:\n\nhttps://arxiv.org/pdf/1605.05395v1.pdf\n\nAlso, in the cited paper \"Evaluation of Output Embeddings for Fine-Grained Image Classification\", the best result is actually 50.1% using GoogLeNet features instead of AlexNet. Do you know how the proposed model performs with GoogLeNet features, or another more modern architecture such as an open-sourced VGG model or Inception model? Was there a reason for using AlexNet? Since the baselines in table 3 are not state of the art, it is not clear why AlexNet features would be used instead of something more modern.\nThis paper proposes an improved version of matching networks, with better scalability properties with respect to the support set of a few-shot classifier. Instead of considering each support point individually, they learn an embedding function that aggregates over items of each class within the support set (eq. 1). This is combined with episodic few-shot training with randomly-sampled partitions of the training set classes, so that the training and testing scenarios match closely.\n\nAlthough the idea is quite straightforward, and there are a great many prior works on zero-shot and few-shot learning, the proposed technique is novel to my knowledge, and achieves state-of-the-art results on several  benchmark datasets. One addition that I think would improve the paper is a clearer description of the training algorithm (perhaps pseudocode). In its current form the paper a bit vague about this.", "title": "Additional baselines for CUB", "rating": "6: Marginally above acceptance threshold", "confidence": "4: The reviewer is confident but not absolutely certain that the evaluation is correct"}, "Sk8_1xWVx": {"type": "review", "replyto": "B1-Hhnslg", "review": "There is another paper reporting zero-shot classification on CUB that appears to use the same protocol and get a better (state-of-the-art) result, using text features instead of attributes:\n\nhttps://arxiv.org/pdf/1605.05395v1.pdf\n\nAlso, in the cited paper \"Evaluation of Output Embeddings for Fine-Grained Image Classification\", the best result is actually 50.1% using GoogLeNet features instead of AlexNet. Do you know how the proposed model performs with GoogLeNet features, or another more modern architecture such as an open-sourced VGG model or Inception model? Was there a reason for using AlexNet? Since the baselines in table 3 are not state of the art, it is not clear why AlexNet features would be used instead of something more modern.\nThis paper proposes an improved version of matching networks, with better scalability properties with respect to the support set of a few-shot classifier. Instead of considering each support point individually, they learn an embedding function that aggregates over items of each class within the support set (eq. 1). This is combined with episodic few-shot training with randomly-sampled partitions of the training set classes, so that the training and testing scenarios match closely.\n\nAlthough the idea is quite straightforward, and there are a great many prior works on zero-shot and few-shot learning, the proposed technique is novel to my knowledge, and achieves state-of-the-art results on several  benchmark datasets. One addition that I think would improve the paper is a clearer description of the training algorithm (perhaps pseudocode). In its current form the paper a bit vague about this.", "title": "Additional baselines for CUB", "rating": "6: Marginally above acceptance threshold", "confidence": "4: The reviewer is confident but not absolutely certain that the evaluation is correct"}}}