{"paper": {"title": "Do Deep Generative Models Know What They Don't Know? ", "authors": ["Eric Nalisnick", "Akihiro Matsukawa", "Yee Whye Teh", "Dilan Gorur", "Balaji Lakshminarayanan"], "authorids": ["e.nalisnick@eng.cam.ac.uk", "amatsukawa@google.com", "ywteh@google.com", "dilang@google.com", "balajiln@google.com"], "summary": "", "abstract": "A neural network deployed in the wild may be asked to make predictions for inputs that were drawn from a different distribution than that of the training data.  A plethora of work has demonstrated that it is easy to find or synthesize inputs for which a neural network is highly confident yet wrong.  Generative models are widely viewed to be robust to such mistaken confidence as modeling the density of the input features can be used to detect novel,  out-of-distribution inputs.  In this paper we challenge this assumption.  We find that the density learned by flow-based models, VAEs, and PixelCNNs cannot distinguish images of common objects such as dogs, trucks, and horses (i.e. CIFAR-10) from those of house numbers (i.e. SVHN), assigning a higher likelihood to the latter when the model is trained on the former.  Moreover, we find evidence of this phenomenon when pairing several popular image data sets: FashionMNIST vs MNIST, CelebA vs SVHN, ImageNet vs CIFAR-10 / CIFAR-100 / SVHN.  To investigate this curious behavior, we focus analysis on flow-based generative models in particular since they are trained and evaluated via the exact marginal likelihood.  We find such behavior persists even when we restrict the flows to constant-volume transformations.  These transformations admit some theoretical analysis, and we show that the difference in likelihoods can be explained by the location and variances of the data and the model curvature. \n Our results caution against using the density estimates from deep generative models to identify inputs similar to the training distribution until their behavior for out-of-distribution inputs is better understood.", "keywords": ["deep generative models", "out-of-distribution inputs", "flow-based models", "uncertainty", "density"]}, "meta": {"decision": "Accept (Poster)", "comment": "This paper makes the intriguing observation that a density model trained on CIFAR10 has higher likelihood on SVHN than CIFAR10, i.e., it assigns higher probability to inputs that are out of the training distribution. This phenomenon is also shown to occur for several other dataset pairs. This finding is surprising and interesting, and the exposition is generally clear. The authors provide empirical and theoretical analysis, although based on rather strong assumptions. Overall, there's consensus among the reviewers that the paper would make a valuable contribution to the proceedings, and should therefore be accepted for publication."}, "review": {"HJl0-fqLeV": {"type": "rebuttal", "replyto": "BklXQj-R1V", "comment": "Thanks for your comment and question.\n\nPer the reviewers' requests for more evidence of the phenomenon on additional data sets, we wanted to bolster the 'motivating observations' section with experiments that better exhibit the curious out-of-distribution behavior.  We found that the FashionMNIST-vs-MNIST pair illustrated the phenomenon better (i.e. larger BPD gap) than the NotMNIST-vs-MNIST pair and hence we replaced those results in the main text.   We will also add the corresponding plots to Appendix B showing the asymmetric behavior for this pair as well (due to time constraints, we couldn't update all of the figures in the Appendix during the rebuttal period).  This was the only reason for the switch.  If you think the NotMNIST-vs-MNIST experiment is more interesting for some other reason, please do let us know your thoughts.     \n\nWe wouldn't claim the asymmetry \"solves\" the issue since (i) even for models trained on SVHN, there could be other datasets that lead to higher likelihood and (ii) it does not immediately reveal a procedure to correct the CIFAR10-vs-SVHN (or similar) issue.  The second-order analysis in Section 5 is still our best explanation for the asymmetric behavior.  That is, the interaction between the model curvature and the data set variance leads to the phenomenon, and when the sign of the difference in variances is switched (which occurs when the train and OOD sets are switched), then we expect the phenomenon behavior to flip as well.  ", "title": "Re: on point 5 and asymmetric behaviour"}, "rkxi_sW8kN": {"type": "rebuttal", "replyto": "HJxL_ysjC7", "comment": "(Apologies for late response, we missed this earlier)\n\nThanks for pointing us to your work.  We will incorporate it into our discussion of related work.\n\n\n", "title": "Re: Density Estimation Observation Appears Elsewhere "}, "B1eudmtWkN": {"type": "rebuttal", "replyto": "HJlpx-we1E", "comment": "Thank you for these suggestions, Reviewer #3.  We probably won't be able to add them in the next week---as many of us authors are traveling to / attending NeurIPS---but we will add them to the next iteration of the draft.", "title": "Re: Thank you for your feedback"}, "SkluvEgeJN": {"type": "rebuttal", "replyto": "HJg_Y9yYRX", "comment": "Hello Kimin,\n\nThanks for pointing us to your work.  We will incorporate it into our discussion of related work.", "title": "Re: Related work"}, "rJxBdmxxyV": {"type": "rebuttal", "replyto": "BJgniGai0m", "comment": "Thank you for your responses and continuing the discussion, Reviewer #3.  Our replies are below.\n\n2.  \"All I am asking is that the paper warns its readers of this shortcoming at the beginning of the analysis.\":\n\nFair point.  We will add a sentence at the beginning of Section 5 to make explicit that these expressions are approximations. \n\n\n4.  We perfectly agree with your 'better description': \"one of the terms encourages the sensitivity....But we tried and it's not working.\"  This is exactly what we wanted to convey in the draft, and we thought we clarified this point in our rebuttal by saying \"Our point is made in the context of volume term which is only one of the terms in the change-of-variable objective.\"  We'll revise the draft to further emphasize our remarks pertain to the volume term only.\n\n\n5.  \"...making it 150 which is huge (actual value is probably smaller)\"\n\nThe difference is certainly much smaller.  It would be 150 only if the histograms were perfectly separated to each end of the x-axis in Figure 6 (a) of the original draft, which is not the case at all.  What metric / plot would convince you?  Some statistic of the dimension-wise means?    ", "title": "Re: Comments on the rebuttal"}, "HylTaY-jAm": {"type": "rebuttal", "replyto": "SyedvzM9Am", "comment": "No, the BPD never becomes lower for CIFAR-10 than for SVHN under any setting of the training time, optimization strategy, regularization type / strength, and model size that we tried.  It depends on what you mean by ’not complex enough.’  We achieve sampling and BDP numbers on par with SOTA so we don’t think that the explanation is simply to use a bigger model.  In fact, the Glow model trained by the authors of “Generative Models for Robust Anomaly Detection” (https://openreview.net/forum?id=B1e8CsRctX) is as large as Kingma & Dhariwal's (2018), and they report the same phenomenon.  If by ’not complex enough’ you mean that Glow could possibly be generally improved to better represent the training density, then sure, perhaps some innovation applied to Glow could make the model richer and fix the issue.  We do not believe such an innovation is trivial though, given how persistent the phenomenon is across hyperparameters and when ensembling (Appendix F).", "title": "Re: Figure 4 d) "}, "rygFbvpYRX": {"type": "rebuttal", "replyto": "H1xwNhCcYm", "comment": "We have uploaded a revised draft in which we have attempted to incorporate the reviewers’ suggestions.  In particular, the new draft includes the following significant revisions:\n\n1.  Additional Data Sets:  In Section 3 we now report results for Glow trained and tested on the following data sets (in addition to CIFAR-10 vs SVHN): FashionMNIST (train) vs MNIST (test), CelebA (train) vs SVHN (test), ImageNet (train) vs CIFAR10/CIFAR100/SVHN (test).  The phenomenon of interest (i.e. higher likelihood on out-of-distribution test data) is observed for all of these new pairs.  Furthermore, we include the empirical means and variances of these data sets in the analysis in Section 5 and show that they agree with our original draft’s conclusions.\n\n2.  Related Work:  We discuss the Škvára et al. (2018) work (and other concurrent work) in Section 6, as suggested by Reviewer #3.  \n\n3.  Equation Spacing: We fix the spacing issue mentioned by Reviewer #1.\n\n4.  Revised Plot of Empirical Means: Reviewer #3 had doubts about to what degree the data set means overlap.  We believe this doubt was due to the range of the x-axis in what was formerly Figure 6 (a)---now Figure 5 (a).  We have revised the figure to have range 0-255 (normalized to 0-1) and added the additional data sets. \n\n5.  Removal of NotMNIST results: We have removed from the main text the NotMNIST vs MNIST experiment that was reported in the original draft.  However, the Appendix (most crucially Figures 8 and 13) still contains NotMNIST results and has not yet been updated with the new data sets.  We will fix this in the next draft.   ", "title": "Revised Draft"}, "Skgkfk6tRm": {"type": "rebuttal", "replyto": "HJx8SCQEn7", "comment": "Thanks again, Reviewer #3, for your thought-provoking critique.  We respond to your other comments below. \n\n1.  “In particular, Section 4 is a series of empirical analyses, based on one dataset pair….However, only 1 dataset pair is experimented -- there should be more to ensure the findings generalize, since Sections 3 and 4 rely completely on empirical analysis.”  \n\nSee general responses #1 and #3.\n\n\n2.  “It is good that Section 5 has some theoretical analysis. But I personally find it very disturbing to base it on a 2nd order approximation of a probability density function of images when modeling something as intricate as models that generate images. At least this limitation should be pointed out in the paper….Section 5 is based on a 2nd order expansion on the $log p(x)$ given by a deep network -- I shouldn't be the judge of this, but from a realistic perspective this does not mean much.”\n\nSee general response #2.  We emphasize that we are not trying to approximate the density function, only approximate the difference and characterize its sign.  Moreover, the special structure of CV-Glow makes these derivative-based approximations better behaved and more tractable than an expansion of a generic deep neural network.\n\n\n3.  “Some parts of the paper feel long-winded and aimless….In general, the paper is clear and easy to understand given enough reading time, but feels at times long-winded.  Section 2 background takes too much space.  Section 3 too much redundancy -- it just explains that SVHN has a higher likelihood when trained on CIFAR, and a few variations of the same experiment.”\n\nWe will attempt to make the writing more concise.  But we believe that most, if not all, of Section 2 is necessary in order to make the paper self-contained and accessible to someone who has never before seen invertible generative models.  While we are fastidious in our experimental description in Section 3, we think it is necessary since this is the foundational section of the paper.\n\n\n4.  “I don't think Glow necessarily is encouraged to increase sensitivity to perturbations. The bijection needs to map training images to a high-density region of the Gaussian, and that aspect would make the model think twice before making the volume term too large.”\n\nWe are not saying that the model will totally disregard the latent density and attempt to scale the input to very large or infinite values.  Our point is made in the context of volume term which is only one of the terms in the change-of-variable objective. The log volume term in the change-of-variable objective is maximizing the very quantity (the Jacobian’s diagonal terms) that the cited work on derivative-based regularization penalties has sought to minimize.  The maximization of the derivatives in the objective directly implies increased sensitivity to perturbations.\n\n\n5.  “Figure 6(a) [Figure 5(a) in revised draft] clearly suggests that the data mean for SVHN and CIFAR are very different, instead of similar.”\n\nWe are not sure how you are drawing this conclusion; perhaps from the scale of the x-axis? The histogram in Figure 6 (a) (original draft) has an x-axis covering the interval [0.4, 0.55], meaning the maximal difference between a mean in *any pair of dimensions* is 0.15.  Scaling back to pixel units, 0.15 * 255 = 38.25, meaning that 38.25 pixels is the maximum difference in means.  While this is not a difference of zero, we don’t see how you could say this “clearly suggests” that the means are “very different.”  In the latest draft, this figure---now Fig 5 (a)---has an x-axis that spans from 0-255.  Hopefully the overlap in the means in now conspicuous.  \n\n\n6.  “However, there are papers empirically analyzing novelty detection using generative model -- should analyze or at least cite: Vít Škvára et al. Are generative deep models for novelty detection truly better? at first glance, their AUROC is never under 0.5, indicating that this phenomenon did not appear in their experiments although a lot of inlier-novelty pairs are tried.”\n\nThank you for pointing us to this work.  We cite it in the revised draft.  It looks like they test on UCI data sets of dimensionality less than 200, and therefore their results speak to a much different data regime than the one we are studying.\n\n\n7.  “A part of the paper's contribution (section 5 conclusion) seem to overlap with others' work. The section concludes that if the second dataset has small variances, it will get higher likelihood. But this is too similar to the cited findings on page 6 (models assign high likelihood to constant images).”\n\nWhile we do also analyze constant images, we believe that our results for multiple data set pairs (FashionMNIST-MNIST, CIFAR10-SVHN, CelebA-SVHN, ImageNet-CIFAR10/CIFAR100/SVHN) and for multiple deep generative models (flow-based models, VAE, PixelCNN) is novel. Our conclusions are arrived at through focused experimentation and a novel analytical expression applied to CV-Glow. ", "title": "Response to Reviewer #3"}, "ByxeVRhY0m": {"type": "rebuttal", "replyto": "BJe__C5d3Q", "comment": "Thanks again, Reviewer #2, for your insightful feedback.  We respond to your other comments below. \n\n1.  “Why investigate a component specific to just flow-based models (the volume term)? It seems reasonable to suspect that the phenomenon may be due to a common cause in all three model types.” \n\nSee general response #3.\n\n\n2.  “For instance, the experiments seem to indicate that generalizing density estimation from CIFAR training set to CIFAR test set is likely challenging and thus the models underfit the true data distribution, resulting in the simpler dataset (SVHN) having higher likelihood.“\n\nWe do not believe our models are necessarily underfit.  In fact, we found that Glow had a tendency to *overfit,* and that one must carefully set Glow’s l2 penalty and choose its scale parametrization (exp vs sigmoid, see Appendix D) in order to prevent it from doing so.  We thought this overfitting to the training data could be a reason for the phenomenon and therefore we tuned our implementations to have reasonable generalization.    \n\n\n3.  “It would have been nice if this paper explored more than just MNIST vs NotMNIST and SVHN vs CIFAR10, so that the readers can gain a better feel for when generative models will be able to detect outliers.  For instance, a scenario where the data statistics (pixel means and variances) are nearly equivalent for both datasets would be interesting.”\n\nSee general response #1 in regards to data sets and additional results.  Thank you for the suggestion of looking at data sets with similar statistics.  We do this, in a way, with our second order analysis and the ‘gray-ing’ experiment in Figure 5 (b) (formerly Figure 6 (b) in the original draft).  Gray CIFAR-10 (blue dotted line) nearly overlaps with original SVHN (red solid line) in terms of their log p(x) evaluations.  Figure 12 (formerly Figure 13) then shows the latent (empirical) distribution of the gray images, and we see that the gray CIFAR-10 latent variables nearly overlap with the SVHN latent variables.  This is to be expected though, given the overlapping p(x) histograms, since the probability assigned by CV-Glow (in comparison to other inputs) is fully determined by the position in latent space.\n\n4.  “The second order analysis is good but it seems to come down to just a measure of the empirical variances of the datasets.” \n\nSee general response #2.", "title": "Response to Reviewer #2"}, "BygHqa2F0X": {"type": "rebuttal", "replyto": "r1eWc6qjnX", "comment": "Thanks again, Reviewer #1, for your thoughtful comments.  We respond to your other comments below.  \n\n1.  “It seems like one could detect most SVHN samples just by the virtue that there likelihoods are much higher than even the max threshold determined by the CIFAR-train histogram?”\n\nThis is an interesting idea, but we are not sure it is applicable.  If one looks closely at Figure 2 (b), there are still blue and black histogram bars (denoting CIFAR-10 train and test instances) covering the entirety of SVHN’s support (red bars).  \n\n\n2.  “[The constant input]’s mean (=0 trivially) is clearly different from the means of the CIFAR-10 images (Figure 6a) so the second order analysis of Section 5 doesn’t seem applicable.”\n\nSee general response #2.\n\n\n3.  “How much of this phenomena do you think is characteristic for images specifically? Would be interesting to test anomaly detection using deep generative models trained on modalities other than images.”\n\nWe have not tested non-image data, since images are the primary focus of work on generative models, but this is an interesting area for future work. \n\n\n4.  “Samples from a CIFAR model look nothing like SVHN. This seems to call the validity of the anomalous into question. Curious what the authors have to say about this.”\n\nThis is a very good point.  See our response to Shengyang Sun’s comment below.  We see think this phenomenon has to do with concentration of measure and typical sets, but we do not yet have a rigorous explanation. \n\n\n5.  “There seems to be some space crunching going on via Latex margin and spacing hacks that the authors should ideally avoid :)”\n\nWe have fixed the spacing in the latest draft :)", "title": "Response to Reviewer #1"}, "SygxWa3Y0m": {"type": "rebuttal", "replyto": "ByloTnnFRQ", "comment": "3.  Purpose / Direction of Section 4 [R2, R3]:  R2 asks “Why investigate a component specific to just flow-based models (the volume term)? It seems reasonable to suspect that the phenomenon may be due to a common cause in all three model types.”  While the phenomenon is common to multiple deep generative model classes, as Figure 3 shows, we found it very hard to analyze all three models simultaneously, on equal footing, due to their different structures and inference requirements.  For instance, how can we compare VAEs and PixelCNNs while controlling for the former’s approximate inference requirements?  How do we know any problems with densities / outlier detection aren’t due to a sub-optimal inference model or the variational approximation?  We thought we would make more headway by restricting the analysis to invertible models since they (i) admit exact likelihood calculations and (ii) have nice analytical properties stemming from the bijection constraint.  Having made this decision, we then thought the next natural step is to look at both terms in the change-of-variables objective---the density under p(z) and the volume term---to see if one of these in particular was the cause.  After seeing Figure 4 (c, d) (Figure 4 (a, b) in revised draft), we thought that the volume term is the culprit, which then lead to examination of constant-volume Glow (CV-Glow) (i.e. ‘constant volume’ across all inputs) as described on page 6.  While the volume term was a bit of a red herring, we thought the progression from {VAE, PixelCNN, NVP-Glow} → {NVP-Glow} → {CV-Glow} was a logical way to further examine the problem for an increasing tractable model class.          \n\nRelatedly, R3 writes of Section 4: “Section 4 is a series of empirical analyses, based on one dataset pair….However, only 1 dataset pair is experimented -- there should be more to ensure the findings generalize, since Sections 3 and 4 rely completely on empirical analysis….Section 4 seems to lack a high-level idea of what it want to prove -- the hypothesis around the volume term is dismissed shortly after, and it ultimately proves that we do not know what is the reason behind the high SVHN likelihood, making it look like a distracting side-experiment.”  The purpose of focusing on just CIFAR-10 vs SVHN in Section 4 is to drill-down and isolate why the phenomenon is happening in this one particular case.  We think this is an appropriate approach, as we didn’t want to introduce too many experimental variables, as explained above.  Furthermore, the presence of this phenomenon for SVHN vs CIFAR-10 alone warrants investigation since those data sets are extremely popular in the ML community.  Yet, we have since added additional data sets (see general response #1) and hope the reviewer is now satisfied with this additional evidence of the phenomenon's prevalence.", "title": "General Rebuttal (2/2) "}, "ByloTnnFRQ": {"type": "rebuttal", "replyto": "H1xwNhCcYm", "comment": "Thank you, reviewers, for your fair and helpful comments.  We’ve provided a general response below that addresses concerns common to multiple reviewers.  We’ll also respond to reviewers individually regarding issues particular to their review.\n\n1.  Limited Number of Data Sets [R2, R3]:  We have now added additional results to Section 3 (Figures 1 and 2) showing that the phenomenon (higher likelihood on non-train data) occurs for FashionMNIST (train) vs MNIST (test), CelebA (train) vs SVHN (test), ImageNet (train) vs CIFAR10/CIFAR100/SVHN (test).  Furthermore, we have included these data sets into our plot of the empirical means and variances (Section 5), showing that our second-order analysis and ‘sitting inside of’-conclusion agrees with these additional observations.   \n\n2.  Accuracy / Generality of Second-Order Analysis [R1, R2, R3]:  All reviewers bring up questions about the second-order analysis.  Starting with R1, they question how Equation 5 applies / can be interpreted for constant images.  To slightly correct R1’s statement, the constant image with high likelihood under the SVHN-trained model is x=128.  Normalizing by the number of pixels, i.e. 128/265=0.5, places this constant image almost in the exact center of the means plot in Figure 6 (a)---thus, the second-order analysis does apply.  Then turning to Equation 5 and plugging in the variance Var[\\delta(128)]=0, we have:\n\nE_q [log p(x)] - E_p* [log p(x)] \\approx ½ * (negative number for CV-Glow) * (0 - Sigma_p*) >= 0.\n\nHence the second-order analysis still holds for the delta function located at 128 and agrees with the empirical result.  We will add this derivation to the appendix.  \n\nMoving on to R2, they state that the second-order analysis reduces to “just a measure of the empirical variances of the datasets.”  This is true and was done so purposefully.  CV-Glow is the only generative model that we know of that (i) has high-capacity and (ii) is amenable to the second-order analysis.  For all other models mentioned (VAE, PixelCNN, NVP-Glow), the second-order equation depends on the second derivatives of the neural network w.r.t its input.  It’s hard, if not impossible, to say anything general about how these second derivatives behave across the input space, let alone across re-fittings of the model.  CV-Glow uniquely has second derivatives that simplify to a function of (i) the log-convexity of the latent distribution and (ii) the square of the 1x1 convolutional kernel’s parameters.  Since both of these terms have a constant sign, the interesting part of the equation does indeed boil down to “a measure of the empirical variances of the datasets.”  The complications introduced by the model have been taken out and what’s left is a function of the data statistics, which does allow for some general conclusions.  We will try to clarify this reasoning / motivation in the paper, as space permits.  Furthermore, the fact that our second-order analysis lead us to and agrees with the additional experiments (see general response #1) and the gray-ing attack (Figure 5 (b), formerly Figure 6 (b) in the original draft), we see this as evidence of its validity.\n\nLastly, we address R3’s comments that they “find it very disturbing to base [analysis] on a 2nd order approximation of a probability density function.”  We agree that trying to approximate a neural-network-based density with only a second-order representation is a tall order.  But this is not precisely what we are doing.  Rather, we are approximating *the difference* in density functions, and therefore we only care about *the sign* of the expression.  We believe the second-order expression is a useful representation for this.  Moreover, if we assume the data distributions have no cross-moments, then from Equation 11 we notice that the diagonal derivatives are zero for second-order and beyond, thus making the second-order expansion exact.  For these two reasons, we don’t believe our approximation is “disturbing.”  And since we are working with deep generative models, any analytical statements will require rather strong assumptions. ", "title": "General Rebuttal (1/2)"}, "HkgLWfveT7": {"type": "rebuttal", "replyto": "BJl6am8z37", "comment": "Thank you for your comment, Shengyang.  This is a good point and something we were a bit puzzled by as well.  Our current hypothesis is that the SVHN samples do not fall within the model’s typical set.  To elaborate, in high dimensions samples at or very near to the mode are unlikely.  See the high-dimensional Gaussian example discussed here: https://www.inference.vc/high-dimensional-gaussian-distributions-are-soap-bubble/  While you are correct in that the variances in data space are not drastically different, the variances of each data set’s latent variables (Figure 12, top column, middle) are well separated, with SVHN’s variance being much smaller.  Thus the distribution in latent space may be a better way to characterize the model’s typical set as samples are first drawn in latent space and then passed to the inverse function. \n", "title": "Re: Image Samples"}, "r1eWc6qjnX": {"type": "review", "replyto": "H1xwNhCcYm", "review": "I really enjoyed reading the paper! The exposition is clear with interesting observations, and most importantly, the authors walk the extra mile in doing a theoretical analysis of the observed phenomena.\n\nQuestions for the authors:\n1. (Also AREA CHAIR NOTE): Another parallel submission to ICLR titled “Generative Ensembles for Robust Anomaly Detection” makes similar observations and seemed to suggest that ensembling can help counter the observed CIFAR/SVHN phenomena unlike what we see in Figure 10. Their criteria also accounts for the variance in model log-likelihoods and is hence slightly different.\n2. Even though Figure 2b shows that SVHN test likelihoods are higher than CIFAR test likelihoods, the overlap in the histograms of CIFAR-train and CIFAR-test is much higher than the overlap in CIFAR-train and SVHN-test. If we define both maximum and minimum thresholds based on the CIFAR-train histogram, it seems like one could detect most SVHN samples just by the virtue that there likelihoods are much higher than even the max threshold determined by the CIFAR-train histogram?\n3. Why does the constant image (all zeros) in Figure 9 (appendix) have such a high likelihood? It’s mean (=0 trivially) is clearly different from the means of the CIFAR-10 images (Figure 6a) so the second order analysis of Section 5 doesn’t seem applicable.\n4. How much of this phenomena do you think is characteristic for images specifically? Would be interesting to test anomaly detection using deep generative models trained on modalities other than images.\n5. One of the anonymous comments on OpenReview is very interesting: samples from a CIFAR model look nothing like SVHN. This seems to call the validity of the anomalous into question. Curious what the authors have to say about this.\n\nMinor nitpick: There seems to be some space crunching going on via Latex margin and spacing hacks that the authors should ideally avoid :)", "title": "Interesting work and analysis", "rating": "7: Good paper, accept", "confidence": "4: The reviewer is confident but not absolutely certain that the evaluation is correct"}, "BJe__C5d3Q": {"type": "review", "replyto": "H1xwNhCcYm", "review": "\nThis paper displays an occurrence of density models assigning higher likelihood to out-of-distribution inputs compared to the training distribution. Specifically, density models trained on CIFAR10 have higher likelihood on SVHN than CIFAR10. This is an interesting observation because the prevailing assumption is that density models can distinguish inliers from outliers. However, this phenomenon is not encountered when comparing MNIST and NotMNIST. The SVHN/CIFAR10 phenomenon has also been shown in concurrent work [1].\n\nGiven that you observed that SVHN has higher likelihood on all three model types (PixelCNN, VAE, Glow), why investigate a component specific to just flow-based models (the volume term)? It seems reasonable to suspect that the phenomenon may be due to a common cause in all three model types. For instance, the experiments seem to indicate that generalizing density estimation from CIFAR training set to CIFAR test set is likely challenging and thus the models underfit the true data distribution, resulting in the simpler dataset (SVHN) having higher likelihood. \n\nGiven the title of the paper, it would have been nice if this paper explored more than just MNIST vs NotMNIST and SVHN vs CIFAR10, so that the readers can gain a better feel for when generative models will be able to detect outliers. For instance, a scenario where the data statistics (pixel means and variances) are nearly equivalent for both datasets would be interesting. The second order analysis is good but it seems to come down to just a measure of the empirical variances of the datasets. \n\nThis paper is well written. I think the presentation of this density modelling shortcoming is a good contribution but leaves a bit to be desired. \n\n[1] Choi, H. and Jang, E. Generative Ensembles for Robust Anomaly Detection. https://arxiv.org/abs/1810.01392\n\n\nPros:\n- Interesting observation of density modelling shortcoming \n- Clear presentation\n\nCons:\n- Lack of a strong explanation for the results or a solution to the problem \n- Lack of an extensive exploration of datasets\n", "title": "Interesting example of density modelling shortcoming", "rating": "6: Marginally above acceptance threshold", "confidence": "4: The reviewer is confident but not absolutely certain that the evaluation is correct"}, "HJx8SCQEn7": {"type": "review", "replyto": "H1xwNhCcYm", "review": "Pros:\n- The finding that SVHN has larger likelihood than CIFAR according to networks is interesting. \n- The empirical and theoretical analyses are clear, seem thorough, and make sense.\n- Section 5 can provide some insight when the model is too rigid and too log-concave (e.g. Gaussian).\nCons:\n- The premises of the analyses are not very convincing, limiting the significance of the paper.\n- In particular, Section 4 is a series of empirical analyses, based on one dataset pair. In 3/4 of the pairs the author tried, this phenomenon is not there. Whether the findings generalize to other situations where the phenomenon appears is uncertain. \n- It is good that Section 5 has some theoretical analysis. But I personally find it very disturbing to base it on a 2nd order approximation of a probability density function of images when modeling something as intricate as models that generate images. At least this limitation should be pointed out in the paper.\n- Some parts of the paper feel long-winded and aimless.\n\n[Quality]\nSee above pros and cons.\nA few less important disagreement I have with the paper:\n- I don't think Glow necessarily is encouraged to increase sensitivity to perturbations. The bijection needs to map training images to a high-density region of the Gaussian, and that aspect would make the model think twice before making the volume term too large.\n- Figure 6(a) clearly suggests that the data mean for SVHN and CIFAR are very different, instead of similar.\n\n[Clarity]\nIn general, the paper is clear and easy to understand given enough reading time, but feels at times long-winded.\nSection 2 background takes too much space.\nSection 3 too much redundancy -- it just explains that SVHN has a higher likelihood when trained on CIFAR, and a few variations of the same experiment.\nSection 4 seems to lack a high-level idea of what it want to prove -- the hypothesis around the volume term is dismissed shortly after, and it ultimately proves that we do not know what is the reason behind the high SVHN likelihood, making it look like a distracting side-experiment.\nA few editorial issues:\n- On page 4 footnote 2, as far as I know the paper did not define BPD.\n- There are two lines of text between Fig. 4 and Fig. 5, which is confusing.\n\n[Originality]\nI am not an expert in this specific field (analyzing generative models), but I believe this analysis is novel.\nHowever, there are papers empirically analyzing novelty detection using generative model -- should analyze or at least cite:\n    Vít Škvára et al. Are generative deep models for novelty detection truly better? \n    ^ at first glance, their AUROC is never under 0.5, indicating that this phenomenon did not appear in their experiments although a lot of inlier-novelty pairs are tried.\nA part of the paper's contribution (section 5 conclusion) seem to overlap with others' work. The section concludes that if the second dataset has small variances, it will get higher likelihood. But this is too similar to the cited findings on page 6 (models assign high likelihood to constant images).\n\n[Significance] \nThe paper has a very interesting finding; pointing out and in-depth analysis of negative results should benefit the community greatly.\nHowever, only 1 dataset pair is experimented -- there should be more to ensure the findings generalize, since Sections 3 and 4 rely completely on empirical analysis. According to the conclusions of the paper, such dataset pairs should be easy to find -- just find a dataset that \"lies within\" another. Did you try e.g. CIFAR-100 train and CIFAR-10 test?\nSection 5 is based on a 2nd order expansion on the $log p(x)$ given by a deep network -- I shouldn't be the judge of this, but from a realistic perspective this does not mean much.\n", "title": "Very interesting finding; insufficient empirical analysis, theory with approximations too bold", "rating": "7: Good paper, accept", "confidence": "3: The reviewer is fairly confident that the evaluation is correct"}, "BkgNd7oT3m": {"type": "rebuttal", "replyto": "ByefSPJRsm", "comment": "Thanks for your questions, comments, and compliments.  As for considering other divergences / discrepancies, indeed using these for either parameter estimation or evaluation could lead to different results.  It is an area of future work.  Given the prevalence of fitting models via maximum likelihood (KLD[p_empirical || p_model]), we thought reporting the result for just this divergence a worthy contribution.  \n\nAs for your second question, we’re not certain we completely understand your point.  Can you clarify a bit more, please?  A perceived mismatch between distance in pixel space vs semantic space may be due to natural images having a common global structure.  The models then extract mostly the shared structure and not the details that we visually cue upon.", "title": "Re: Measurement and distribution"}}}