{"paper": {"title": "BIOACOUSTIC SEGMENTATION BY HIERARCHICAL DIRICHLET PROCESS HIDDEN MARKOV MODEL", "authors": ["Vincent Roger", "Marius Bartcus", "Faicel Chamroukhi", "Hervé Glotin"], "authorids": ["vincent-roger@etud.univ-tln.fr", "marius.bartcus@gmail.com", "faicel.chamroukhi@unicaen.fr", "glotin@univ-tln.fr"], "summary": "", "abstract": "Understanding the communication between different animals by analysing their acoustic signals is an important topic in bioacoustics. It can be a powerful tool for the preservation of ecological diversity. We investigate probabilistic models to analyse signals issued from real-world bioacoustic sound scenes. We study a Bayesian non-parametric sequential models based on Hierarchical Dirichlet Process Hidden Markov Models (HDP-HMM). The model is able to infer hidden states, that are referred here as song units. However, using such a model raise one main issue: defining the number of hidden states the model has to learn. In bioacoustic problems we often do not know the number of song units (unlike in human speech recognition). Hence, we work with the Hierarchical Dirichlet Process (HDP)-HMM, which is a Bayesian non-parametric (BNP) model that offers a way to tackle this challenging problem. We focus our work on unsupervised learning from bioacoustic data. It consists in simultaneously finding the structure of hidden song units and automatically infer the unknown number of the hidden states to represent the data. Two real bioacoustic sound scene applications are investigated in this work: on whale and multi-species birds segmentation. The learning of these models is proceeded by using Markov-Chain Monte Carlo (MCMC) sampling techniques on Mel Frequency Cepstral Coefficients (MFCC) of audio signals. The results show an interesting song unit segmentation of the bioacoustic signals and open new insights for unsupervised analysis of such signals. This paper illustrates the potential of chunking non-human animal signals into structured parts. This can yield to a new species representation and help experts to better understand the behaviour of such species as Kershenbaum et al. (2014) wanted.", "keywords": []}, "meta": {"decision": "Reject", "comment": "The paper studies an unusual and (apparently) challenging application -- segmentation of whale and bird songs. Though the authors claim that the applications is much more challenging than previous applications of the proposed techniques (in speech processing), the evaluation is very questionable (as there is no gold standard), there is no convincing comparison with other (potentially simpler techniques). Overall, the reviewers believe the work is not mature enough to be accepted at ICLR.\n \n + interesting dataset / task \n \n - novelty is limited\n - evaluation is weak\n - writing is poor"}, "review": {"B1GZ27x4x": {"type": "rebuttal", "replyto": "rJbuoMvQl", "comment": "Yes, the technique itself as mentioned in the paper was proposed and studied by E. Fox et al. (2007, 2009) for dynamical systems including speech recognition problems (speaker  diarization). However, we think that the problem of bioacoustic signals analysis is much more challenging compared standard speech recognition problems, since the data heterogeneity comes from different complex and unknown sources (unknown species, unknown dynamics for each species, mixed species, etc), things which are not common for speech recognition models and for which flexible and completely unsupervised and non-parametric models are needed. This is we think what is offered by the HDP-HMM algorithm. On the other hand, we agree with you that in Bayesian analysis in general, the problem of choosing the hyper-parameter is ans issue. But we wish to argue that here the aspect of the flexibility of the model is privileged, for a reasonable computing time, regarding the one of choosing the hyper-parameters for which a solid experimental protocol is need, and thus leads to a strong computational load, especially in this large-scale context. But we are of course concious that this job mus be done, but is stated as a future work for which current phd students are already working on.", "title": "Response on novelty and initialization"}, "rJbuoMvQl": {"type": "review", "replyto": "Hk1l9Xqxe", "review": "What is a novel aspect of this technique? It seems that the technique itself is not novel (but application to bioacoustic segmentation is novel)?\nAlso, I'm curious about how the algorithm is sensitive to an initialization and hyper-parameter. Please describe these in more details, and possibly provide further experimental results by changing the initialization and hyper-parameters.This paper applies HDP-HMM to challenging bioacoustics segmentation problems including humpback whole sound and bird sound segmentation. Although the technique itself is not novel, the application of this data-driven method to bioacoustics segmentation is quite challenging, and may yield some scientific findings, and this is a valuable contribution to the bioacoustics field. My concern for this paper is that it does not have fair comparison of the other simple methods including BIC and AIC, and it is better to provide such comparisons. Especially, as the authors pointed out, the computational cost of HDP-HMM is a big issue, and the other simple methods may solve this issue.", "title": "novelty and initialization", "rating": "5: Marginally below acceptance threshold", "confidence": "3: The reviewer is fairly confident that the evaluation is correct"}, "rkDZJLcEl": {"type": "review", "replyto": "Hk1l9Xqxe", "review": "What is a novel aspect of this technique? It seems that the technique itself is not novel (but application to bioacoustic segmentation is novel)?\nAlso, I'm curious about how the algorithm is sensitive to an initialization and hyper-parameter. Please describe these in more details, and possibly provide further experimental results by changing the initialization and hyper-parameters.This paper applies HDP-HMM to challenging bioacoustics segmentation problems including humpback whole sound and bird sound segmentation. Although the technique itself is not novel, the application of this data-driven method to bioacoustics segmentation is quite challenging, and may yield some scientific findings, and this is a valuable contribution to the bioacoustics field. My concern for this paper is that it does not have fair comparison of the other simple methods including BIC and AIC, and it is better to provide such comparisons. Especially, as the authors pointed out, the computational cost of HDP-HMM is a big issue, and the other simple methods may solve this issue.", "title": "novelty and initialization", "rating": "5: Marginally below acceptance threshold", "confidence": "3: The reviewer is fairly confident that the evaluation is correct"}, "r14KC-4Qg": {"type": "rebuttal", "replyto": "rycEGT1Xl", "comment": "Thank you for your review;\nas you noticed, there is no gold standard label. We modify our paper and add an evaluation part, where we use the segmentation from an expert as a baseline to compare our results with his annotation (using NMI). Our approach differs from current approaches in bioacoustic because we use a Bayesian non-Parametric formulation to infer the number of clusters.", "title": "Answer question 1"}, "rycEGT1Xl": {"type": "review", "replyto": "Hk1l9Xqxe", "review": "This seems to be a task in which the data doesn't have a gold standard label, you mention that \"experts have not yet decided how to chunk the signals of species\". During your evaluation, you say that your approach shows promise because a bioacoustic expert analyzed your results and validated the proposed representation, but it is not clear what the baseline is? How does your approach compare to current approaches in the field?This paper presented an unsupervised approach for the automatic segmentation of bioacoustic data. The authors applied an existing approach (Hierarchical Dirichlet Process Hidden Markov Models) to their task. The originality of their work is the investigation of this approach on a new task, which they argue is more difficult, namely bioacoustic segmentation. They provide evidence that this is a difficult task by explaining that there doesn't exist a consensus among human experts on how this should be done. However, they do not provide convincing results that their approach is successful, as it fails in many cases to replicate the correct segmentations as defined by their baseline: human experts. In addition, the clarity of the writing is extremely poor, including many grammatical errors and awkward sentences. ", "title": "Regarding evaluation", "rating": "4: Ok but not good enough - rejection", "confidence": "3: The reviewer is fairly confident that the evaluation is correct"}, "r1xlhmfVe": {"type": "review", "replyto": "Hk1l9Xqxe", "review": "This seems to be a task in which the data doesn't have a gold standard label, you mention that \"experts have not yet decided how to chunk the signals of species\". During your evaluation, you say that your approach shows promise because a bioacoustic expert analyzed your results and validated the proposed representation, but it is not clear what the baseline is? How does your approach compare to current approaches in the field?This paper presented an unsupervised approach for the automatic segmentation of bioacoustic data. The authors applied an existing approach (Hierarchical Dirichlet Process Hidden Markov Models) to their task. The originality of their work is the investigation of this approach on a new task, which they argue is more difficult, namely bioacoustic segmentation. They provide evidence that this is a difficult task by explaining that there doesn't exist a consensus among human experts on how this should be done. However, they do not provide convincing results that their approach is successful, as it fails in many cases to replicate the correct segmentations as defined by their baseline: human experts. In addition, the clarity of the writing is extremely poor, including many grammatical errors and awkward sentences. ", "title": "Regarding evaluation", "rating": "4: Ok but not good enough - rejection", "confidence": "3: The reviewer is fairly confident that the evaluation is correct"}}}