{"paper": {"title": "Doubly Reparameterized Gradient Estimators for Monte Carlo Objectives", "authors": ["George Tucker", "Dieterich Lawson", "Shixiang Gu", "Chris J. Maddison"], "authorids": ["gjt@google.com", "jdl404@nyu.edu", "shanegu@google.com", "cmaddis@google.com"], "summary": "Doubly reparameterized gradient estimators provide unbiased variance reduction which leads to improved performance.", "abstract": "Deep latent variable models have become a popular model choice due to the scalable learning algorithms introduced by (Kingma & Welling 2013, Rezende et al. 2014). These approaches maximize a variational lower bound on the intractable log likelihood of the observed data. Burda et al. (2015) introduced a multi-sample variational bound, IWAE, that is at least as tight as the standard variational lower bound and becomes increasingly tight as the number of samples increases. Counterintuitively, the typical inference network gradient estimator for the IWAE bound performs poorly as the number of samples increases (Rainforth et al. 2018, Le et al. 2018). Roeder et a. (2017) propose an improved gradient estimator, however, are unable to show it is unbiased. We show that it is in fact biased and that the bias can be estimated efficiently with a second application of the reparameterization trick. The doubly reparameterized gradient (DReG) estimator does not suffer as the number of samples increases, resolving the previously raised issues. The same idea can be used to improve many recently introduced training techniques for latent variable models. In particular, we show that this estimator reduces the variance of the IWAE gradient, the reweighted wake-sleep update (RWS) (Bornschein & Bengio 2014), and the jackknife variational inference (JVI) gradient (Nowozin 2018). Finally, we show that this computationally efficient, drop-in estimator translates to improved performance for all three objectives on several modeling tasks.", "keywords": ["variational autoencoder", "reparameterization trick", "IWAE", "VAE", "RWS", "JVI"]}, "meta": {"decision": "Accept (Poster)", "comment": "The paper is well written and easy to follow. The experiments are adequate to justify the usefulness of an identity for improving existing multi-Monte-Carlo-sample based gradient estimators for deep generative models. The originality and significance are acceptable, as discussed below.\n\nThe proposed doubly reparameterized gradient estimators are built on an important identity shown in Equation (5). This identity appears straightforward to derive by applying both score-function gradient and reparameterization gradient to the same objective function, which is expressed as an expectation. The AC suspects that this identity might have already appeared in previous publications / implementations, though not being claimed as an important contribution / being explicitly discussed. While that identity may not be claimed as the original contribution of the paper if that suspicion is true, the paper makes another useful contribution in applying that identity to the right problem: improving three distinct training algorithms for deep generative models. The doubly reparameterized versions of IWAE and reweighted wake-sleep (RWS) further show how IWAE and RWS are related to each other and how they can be combined for potentially further improved performance. \n\nThe AC believes that the paper makes enough contributions by well presenting the identity in (5) and applying it to the right problems. "}, "review": {"r1lc8Cd-ZN": {"type": "rebuttal", "replyto": "Bye_rmJWlV", "comment": "Thank you for pointing out this source of confusion. Indeed, the identity has been used extensively in previous publications and we are not claiming it as an original contribution of the paper. We introduce the identity in Eq. 5 as a \"well-known equivalence\".  As the AC notes, our contribution is in the application of the identity, the experimental evaluation, and the theoretical asymptotic analysis.", "title": "RE:"}, "HJe9Sh_--N": {"type": "rebuttal", "replyto": "rJlMEiAnam", "comment": "We have uploaded the final version with a link to the source code used for the experiments ( https://sites.google.com/view/dregs ).", "title": "Camera ready update"}, "rJlMEiAnam": {"type": "rebuttal", "replyto": "HkG3e205K7", "comment": "We have updated the manuscript based on reviewer feedback. Apart from clarifying edits, we have rewritten the derivation in Appendix 8.1 and included a plot of variance for several values of K as Appendix Figure 8.", "title": "Updated manuscript"}, "rygSDcRhaQ": {"type": "rebuttal", "replyto": "S1gF1q36j7", "comment": "Recent work on reparameterizing mixture distributions has shown that the necessary gradients can be computed with the implicit reparameterization trick (Graves 2016, Jankowiak & Obermeyer 2018; Jankowiak & Karaletsos 2018; Figurnov et al. 2018).  Using this approach to reparameterize the mixture, DReGs readily apply when q is a Gaussian mixture model. We mention this explicitly in the text now.\n\nEq. 6 explicitly characterizes the bias in STL. There is no reason to believe this term analytically vanishes, and we confirm numerically that it is non-zero in the toy Gaussian example. We believe this is sufficient to support our claim of bias.\n\nWe present the K ELBO results in these plots to be consistent with previous work (Rainforth et al. 2018). We agree that it can be misleading for the reasons you indicated, so we now explicitly call this out in the maintext.\n\nYes, the color assignment is the same. We note this in the caption for both figures now.", "title": "Author response"}, "SJluWc0npX": {"type": "rebuttal", "replyto": "Hyle7iIF27", "comment": "Thank you for the helpful suggestions.\n\n1. Thank you for pointing out this source of confusion. The correctness of the proof is related to the fact that \\frac{\\partial}{\\partial \\phi} g(\\phi, \\tilde{\\phi}) |_{\\tilde{\\phi} = \\phi} != \\frac{\\partial}{\\partial \\phi} g(\\phi, \\phi). On the left hand side the derivative is taken first, which results in a function of \\phi and \\tilde{\\phi}, which we then evaluate. As you note, this is not equivalent to setting \\tilde{\\phi} = \\phi, and then taking the derivative. We want the former. Following your suggestion, we have completely rewritten the proof to avoid this confusing step.\n\n2. We used the trace of the Covariance matrix (normalized by the number of parameters) to summarize the variance, and we implemented this by maintaining exponential moving average statistics. SNR was computed as the mean of the estimator divided by the standard deviation (as in Rainforth et al. 2018). We added this information as footnotes in the maintext.\n\n3. We have added a plot of the variance of the gradient estimator as K changes (Appendix Fig. 8). We found that as K increases, for IWAE and JVI, the variance of the doubly reparameterized gradient estimator slowly decreases relative to the variance of the original gradient estimator. On the other hand for RWS, we found that as K increases, the variance of the doubly reparameterized gradient estimator gradually increases relative to the variance of the original gradient estimator. However, we emphasize that in all cases, the variance of the doubly reparameterized gradient estimator was less than the variance of the original gradient estimator.\n\n4. Yes, intuitively, the right hand side directly takes advantage of the gradient of f whereas the left hand side ends up computing something akin to finite differences. We have added a sentence explaining this intuition in the maintext.\n", "title": "Author response"}, "HyelqKC2pX": {"type": "rebuttal", "replyto": "Hkx5PKC3hX", "comment": "Thank you for checking the derivations. We appreciate the positive comments.", "title": "Author response"}, "Hkx5PKC3hX": {"type": "review", "replyto": "HkG3e205K7", "review": "This paper applies a reparameterization trick to estimate the gradients objectives encountered in variational autoencoder based frameworks with continuous latent variables.  Especially the authors use this double reparameterization trick on Importance Weighted Auto-Encoder (IWAE) and Reweighted Wake-Sleep (RWS)  methods. Compared to IWAE, the developed method's SNR does not go to zero with increasing the number of particles.\n\nOverall, I think the idea is nice and the results are encouraging. I checked all the derivations, and they seem to be correct. Thus I recommend this paper to be accepted in its current form.", "title": "Doubly Reparameterized Gradient Estimators for Monte Carlo Objectives", "rating": "7: Good paper, accept", "confidence": "3: The reviewer is fairly confident that the evaluation is correct"}, "Hyle7iIF27": {"type": "review", "replyto": "HkG3e205K7", "review": "The paper observes the gradient of multiple objective such as IWAE, RWS, JVI are in the form of some “reward” multiplied with score function which can be calculated with one more reparameterization step to reduce the variance. The whole paper is written in a clean way and the method is effective.\n\nI have following comments/questions:\n\n1. The conclusion in Eq(5) is correct but the derivation in Sec. 8.1. may be arguable. Writing \\phi and \\tilde{\\phi} at the first place sets the partial derivative of \\tilde{\\phi}  to \\phi as 0. But the choice of \\tilde{\\phi} in the end is chosen as \\phi. If plugging  \\phi to \\tilde{\\phi}, the derivation will change. The better way may be calculating both the reparameterization and reinforce gradient without redefining a \\tilde{\\phi}.\n\n2. How does the variance of gradient calculated where the gradient is a vector? And how does the SNR defined in the experiments?\n\n3. How does the variance reduction from DReG changes with different value of K?\n\n4. Is there any more detailed analysis or intuition why the right hand side of Eq(5) has lower variance than the left hand side?", "title": "Good paper", "rating": "7: Good paper, accept", "confidence": "5: The reviewer is absolutely certain that the evaluation is correct and very familiar with the relevant literature"}, "S1gF1q36j7": {"type": "review", "replyto": "HkG3e205K7", "review": "Overall:\nThis paper works on improving the gradient estimator of the ELBO. Author experimentally found that the estimator of the existing work(STL) is biased and proposed to reduce the bias by using the technique like  REINFORCE.\nThe problem author focused on is unique and the solution is simple, experiments show that proposed method seems promising.\n\nClarity:\nThe paper is clearly written in the sense that the motivation of research is clear, the derivation of the proposed method is easy to understand.\n\nSignificance:\nI think this kind of research makes the variational inference more useful, so this work is significant. But I cannot tell the proposed method is really useful, so I gave this score.\nThe reason I doubt the reason is that as I written in the below, the original STL can handle the mixture of Gaussians as the latent variable but the proposed method cannot. So I do not know which is better and whether I should use this method or use the original STL with flexible posterior distribution to tighten the evidence lower bound. I think additional experiments are needed. I know that motivation is a bit different for STL and proposed method but some comparisons are needed.\n\nQuestion and minor comments:\nIn the original paper of STL, the author pointed out that by freezing the gradient of variational parameters to drop the score function term, we can utilize the flexible variational families like the mixture of Gaussians.\nIn this work, since we do not freeze the variational parameters, we cannot utilize the mixture of Gaussians as in the STL. IWAE improves the lower bound by increasing the samples, but we can also improve the bound by specifying the flexible posteriors like the mixture of Gaussians in STL.\nFaced on this, I wonder which strategy is better to tighten the lower bound, should we use the STL with the mixture of Gaussians or use the proposed method?  \nTo clarify the usefulness of this method, I think the additional experimental comparisons are needed.\n\nAbout the motivation of the paper, I think it might be better to move the Fig.1 about the Bias to the introduction and clearly state that the author found that the STL is biased \"experimentally\".\n\nFollowings are minor comments.\nIn experiment 6.1, I'm not sure why the author present the result of K ELBO estimator in the plot of Bias and Variance.\nI think author want to point that when K=1, STL is unbiased with respect to the 1 ELBO, but when k>1, it is biased with respect to IWAE estimator.\nHowever, the objective of K ELBO and IWAE are different, it may be misleading. So this should be noted in the paper.\n\nIn Figure 3, the left figure, what each color means? Is the color assignment is the same with the middle figure?\n(Same for Figure 4)", "title": "Proposed method is interesting but additional experiments are needed", "rating": "6: Marginally above acceptance threshold", "confidence": "4: The reviewer is confident but not absolutely certain that the evaluation is correct"}}}