{"paper": {"title": "Learning to Adapt in Dynamic, Real-World Environments through Meta-Reinforcement Learning", "authors": ["Anusha Nagabandi", "Ignasi Clavera", "Simin Liu", "Ronald S. Fearing", "Pieter Abbeel", "Sergey Levine", "Chelsea Finn"], "authorids": ["nagaban2@berkeley.edu", "iclavera@berkeley.edu", "simin.liu@berkeley.edu", "ronf@berkeley.edu", "pabbeel@berkeley.edu", "svlevine@eecs.berkeley.edu", "cbfinn@eecs.berkeley.edu"], "summary": "A model-based meta-RL algorithm that enables a real robot to adapt online in dynamic environments", "abstract": "Although reinforcement learning methods can achieve impressive results in simulation, the real world presents two major challenges: generating samples is exceedingly expensive, and unexpected perturbations or unseen situations cause proficient but specialized policies to fail at test time. Given that it is impractical to train separate policies to accommodate all situations the agent may see in the real world, this work proposes to learn how to quickly and effectively adapt online to new tasks. To enable sample-efficient learning, we consider learning online adaptation in the context of model-based reinforcement learning. Our approach uses meta-learning to train a dynamics model prior such that, when combined with recent data, this prior can be rapidly adapted to the local context. Our experiments demonstrate online adaptation for continuous control tasks on both simulated and real-world agents. We first show simulated agents adapting their behavior online to novel terrains, crippled body parts, and highly-dynamic environments. We also illustrate the importance of incorporating online adaptation into autonomous agents that operate in the real world by applying our method to a real dynamic legged millirobot: We demonstrate the agent's learned ability to quickly adapt online to a missing leg, adjust to novel terrains and slopes, account for miscalibration or errors in pose estimation, and compensate for pulling payloads.", "keywords": ["meta-learning", "reinforcement learning", "meta reinforcement learning", "online adaptation"]}, "meta": {"decision": "Accept (Poster)", "comment": "The authors consider the use of MAML with model based RL and applied this to robotics tasks with very encouraging results. There was definite interest in the paper, but also some concerns over how the results were situated, particularly with respect to the related research in the robotics community. The authors are strongly encouraged to carefully consider this feedback, as they have been doing in their responses, and address this as well as possible in the final version.\n"}, "review": {"ByxoVJewyN": {"type": "rebuttal", "replyto": "S1lzTCLUJN", "comment": "In the real-robot data collection is expensive, training a single model for the different terrains and conditions allows us to make a more efficient use of the data. Instead, in simulation we have separate experiments to have a more controlled comparison.\n\nThe task distribution during training and testing does indeed need to match in theory. However, generating sufficiently diverse tasks requires a considerable engineering effort. It's often hard to get the kind of task diversity needed to evaluate things effectively with distributions that truly match. For instance, in the disabled half-cheetah task the agent just has 6 joints, so if we want one held-out joint there will be inevitably some distribution mismatch. While this is certainly a shortcoming in our experiments, we believe this setup overall is reasonable, and the comparison to prior methods is informative about overall performance of each method.\n\nRegarding the neural network size, we used a 3 layer NN with 512 units per layer and ReLU activations for all the feed-forward models, and a LSTM with 512 hidden units for the recurrent models. We will incorporate it to the paper.\n\nPlease, let us know if you have further doubts or questions. And, thanks for pointing out the typo!", "title": "Thank you for your comment"}, "BJxo8zPU67": {"type": "review", "replyto": "HyztsoC5Y7", "review": "The paper proposes using meta-learning and fast, online adaptation of models to overcome the mismatch between simulation and the real world, as well as unexpected changes and dynamics. This paper proposes two model-based meta-learning reinforcement algorithms, one based on MAML and the other based on recurrence, and experimentally shows how they are more sample efficient and faster at adapting to test scenarios than prior approaches, including prior model-free meta-learning approaches.\n\nI do have an issue with the way this paper labels prior work as model-free meta-learning algorithms, since for example, MAML is a general algorithm that can be applied to model-free and model-based algorithms alike. It would be more accurate in my opinion to label the contributions of this paper as model-based instantiations of prior existing algorithms, rather than new algorithms outright.\n\nI’m a bit confused with equation 3, as the expectation is over a single environment, and the trajectory of data is also sampled from a single environment. But in the writing, the paper describes the setting as a potentially different environment at every timestep. Equation 3 seems to assume that the  subsequence of data comes from a single environment, which contradicts what you say in the text. As described, equation 3 is then not really much different from previous episodic or task based formulations.\n\nThe results themselves are not unexpected, as there has already been prior work that this paper also mentions showing that model-based RL algorithms are more sample efficient than model-free.\n\nSection 6.1, I like this comparison and showing how the errors are getting better.\n\nFor section 6.2, judging from the plots, it doesn’t seem you are doing any meta-learning in this experiment, so then are you just basically running a model-based RL algorithm? I’m very confused what you are trying to show. Are you trying to show the benefit of model-based vs model-free? Prior work has already done that. Are you trying to show that even just using a meta-learning algorithm in an online setting results in good online performance? Then you should be comparing your algorithm to just a model-based online RL algorithm. You also mention that the asymptotic performance falls behind, is this because your model capacity is low, or maybe your MPC method is insufficient? If so, then wouldn’t it be more compelling to, like prior work, combine this with a model-free algorithm and get the best of both worlds?\n\nSection 6.3 results look good.\n\nSection 6.4, I really like the fact you have results on a real robot.\n\nOverall I think the paper does successfully show the sample complexity benefits and fast adaptation of model-based meta-RL methods. The inclusion of a real world robot experiment is a plus. However the result is not particularly surprising or insightful, as prior work has already shown the massive sample complexity improvement of model-based RL methods.\n\nUPDATE (Dec 4, 2018):\n\nI have read the author response and they have addressed the specific concerns I have brought up. I am overall positive about this paper and the new changes and additions so I will slightly increase my score, though I am still concerned about the significance of the results themselves.\n", "title": "Shows superior sample complexity of model-based Meta RL, but not much further insight", "rating": "7: Good paper, accept", "confidence": "3: The reviewer is fairly confident that the evaluation is correct"}, "rkl7x9ea3X": {"type": "review", "replyto": "HyztsoC5Y7", "review": "The authors introduce an algorithm that addresses the problem of online policy adaptation for model-based RL. The main novelty of the proposed approach is that it defines an effective algorithm that can easily and quickly adapt to the changing context/environments. It borrows the ideas from model-free RL (MAML) to define the gradient/recursive updates of their approach, and it incorporates it efficiently into their model-based RL framework. The paper is well written and the experimental results on synthetic and real world data show that the algorithm can quickly adapt its policy and achieve good results in the tasks, when compared to related approaches. \n\nWhile applying the gradient based adaptation to the model-free RL is trivial and has  previously been proposed, in this work the authors do so by also focusing on the \"local\" context (M steps within a K-long horizon, allowing the method to  recover quickly if learning from contaminated data, and/or its global policy cannot generalize well to the local contexts. Although this extension is trivial it seems that it has not been applied and measured in terms of the adaptation \"speed\" in previous works. Theoretically, I see more value in their second approach where they investigate the application of fast parameter updates within model-based RL, showing that it does improve over the MAML-RL and non-adaptive model-based RL approaches. This is expected but  to my knowledge has not been investigated to this extent before. \n\nWhat I find is lacking in this paper is insight into how sensitive the algorithm is in terms of the K/M ratio, and also how it affects the adaptation speed vs performance (tables 3-5 show an analysis but those are for different tasks); no theoretical analysis was performed to provide deeper understanding of it. The model does solve a practical problem (reducing the learning time and having more robust model), however, it would add more value to the current state of the art in RL if the authors proposed a method for optimal selection of the recovery points and also window ratio R/L depending on the target task. This would make a significant theoretical contribution and the method could be easily applicable to a variety of tasks. where the gains in the adaptation speed are important.", "title": "This paper proposes a novel algorithm for online adaptation of a model-based RL approach, showing significant improvements in terms of speed, and also in terms of performance compared to standard approaches such as MAML-RL and non-adaptive model-based RL.   ", "rating": "7: Good paper, accept", "confidence": "5: The reviewer is absolutely certain that the evaluation is correct and very familiar with the relevant literature"}, "r1eBKWeYCX": {"type": "rebuttal", "replyto": "HyztsoC5Y7", "comment": "We believe that we addressed all of the reviewer's concerns. We would appreciate if the reviewers could take a look at our changes and let us know if they would like to revise their rating or request additional changes that would alleviate their concerns.\n\nIn summary, here are the main changes that we made to the paper:\n- Ran a sensitivity analysis over the parameters K and M, and added a discussion section in the appendix regarding the selection of these values (R3)\n- Edited the experiments section to clarify our main empirical insights (R4)\n- Fixed the notational discrepancy in section 3 and added an explanation in section 4 regarding environments and rollouts (R4)\n- Edited and added to the plot in section 6.2 to now include all experiments/comparisons of interest (R1, R4)\n- Edited the related work to clarify the technical contributions of our method over MAML and prior work (R1, R4)\n- Extended the related work section work to incorporate citations for model-based RL, adapting inverse dynamic models, and the suggested recent model-based RL citation (R1)\n- Edited introduction to scope the claims more carefully (R1)\n- Edited the experiments section's text and citations to clarify the misunderstanding regarding our choice of MPC controllers for each method of our comparisons (R1)\n- Edited and clarified the methods and experiments to address all 4 of R1’s requested experimental comparisons (explicitly including #1/2/4, and running experiments to confirm that #3 does indeed fail) (R1)\n- Edited the text to make it clear that we do already perform the suggested model-bootstrapping (R1)\n- Edited the experiments to clearly differentiate meta-training time from test time (R1)\n", "title": "Paper updated to address reviewer feedback"}, "SJeiiK_NAm": {"type": "rebuttal", "replyto": "ByeKOSYJRm", "comment": "Regarding prior work, as requested, we have extended the related work section by incorporating prior work on model-based control. In particular, we have added references on adaptive control methods [1-7], and online system identification [8]. Please let us know if we should include any specific paper, we will be happy to include it and discuss it.\n\n\n[1] Sastry, Sosale Shankara and Isidori, Alberto. Adaptive control of linearizable systems.IEEE Transactions on Automatic Control, 1989.\n[2] Meier, Franziska and Schaal, Stefan. Drifting Gaussian Processes with Varying Neighborhood Sizes for Online Model Learning. ICRA 2016.\n[3] Meier, Franziska and Kappler, Daniel and Ratliff, Nathan and Schaal, Stefan. Towards Robust Online Inverse Dynamics Learning. IROS 2016.\n[4] P. Pastor and Ludovic Righetti and M. Kalakrishnan and S Schaal. Online movement adaptation based on previous sensor experiences. IROS 2011.\n[5] Underwood, Samuel J and Husain, Iqbal. Online parameter estimation and adaptive control of permanent-magnet synchronous machines. Transactions on Industrial Electronics 2010\n[6] Kelouwani, Sousso and Adegnon, Kokou and Agbossou, Kodjo and Dube, Yves. Online system identification and adaptive control for PEM fuel cell maximum efficiency tracking. Transactions on Energy Conversion 2012.\n[7] Rai, Akshara and Sutanto, Giovanni and Schaal, Stefan and Meier, Franziska. Learning Feedback Terms for Reactive Planning and Control. ICRA 2017. \n[8] Manganiello, Patrizio and Ricco, Mattia and Petrone, Giovanni and Monmasson, Eric and Spagnuolo, Giovanni. Optimization of Perturbative PV MPPT Methods Through Online System Identification. Transactions on Industrial Electronics 2014.", "title": "Regarding related work"}, "rkxmhBF10Q": {"type": "rebuttal", "replyto": "rkl7x9ea3X", "comment": "We thank the reviewer for their valuable feedback and agree that the strength of our approach comes from being able to adapt the dynamics model to the local dynamics. We do include a model-free RL algorithm in our experiments, but this is a prior method that is included only for comparison: we clarify that both of our approaches are model-based, and neither are model-free.\n\nWe also clarify that we do not choose \"M steps within a K-long horizon.\" We have edited section 4 to paper to properly specify it. We use information from the past M steps to adapt the meta-learned model and predict the future K steps; this is done at every time-step of the rollout. In this setup, K and M are simply hyperparameters\n\nWe have added to the appendix D a sensitivity analysis of the values K and M for GrBAL. The results show that our approach is not particularly sensitive to those values. We also added a discussion in Appendix D of how the values can be determined -- the optimal values depend on various task details, such as the amount of information present in the state (a fully-informed state variable precludes the need for additional past timesteps) and the duration of a single timestep (a longer timestep duration makes it harder to predict more steps into the future).\n\nLastly, given our clarifications, it would really help us if the reviewer could clarify what they meant by \"optimal selection of the recovery points\" -- what does \"recovery points\" mean in this context?", "title": "Thank you for your feedback!"}, "ByeKOSYJRm": {"type": "rebuttal", "replyto": "SJeknkUiTQ", "comment": "Thank you for taking the time to respond, we really appreciate your detailed feedback. We believe that we can address all of your concerns, please let us know if the revisions and modifications we describe below have addressed these issues. Thanks again for helping us improve the paper!\n\n(i) Meta-learning for online adaptation to dynamics has not been proposed in prior work. [1] trains for episodic adaptation, rather than online adaptation, showing good adaptation performance after several trials rather than several timesteps. We have clarified the introduction to scope the claims more carefully, but we do believe this is a novel contribution. However, if there is any other citation that covers this approach, we would be happy to reference it and discuss. We have made a best faith attempt to cover all topics you referenced in your comment.\nRegarding prior work on model based meta-RL, to our knowledge [1] is the only prior work that uses both meta-learning and model-based RL together. If there are any others, we would be happy to cite and discuss them as well. While we agree that [1] makes a valuable contribution, the technique is very different from ours and is specific to non-parametric latent variable models, while our method addresses parametric models. Further, we explicitly train for online adaptation (i.e., using only M timesteps of data for adaptation). Instead, their approach trains for episodic adaptation (i.e. using around M trajectories). Finally, we evaluate our approach on a real-world robotic system, while the prior paper evaluates on cart-pole and pendulum.\n\n(ii) We have edited sections 2 and 4 to highlight the technical contributions over MAML. Our method is not a straightforward application of MAML to model-based RL. MAML requires a distribution over tasks to be hand-specified in advance. Our method removes this assumption by developing an online formulation of meta-learning where “tasks” correspond to segments of time and are provided implicitly by the environment. In addition with the empirical contributions, we believe that this does constitute a novel conceptual contribution.\n\n(iii)\n- Regarding section 6.2 & MPPI: we added learning curves of MB and MB+DE to the plots. We edited all of the plot legends to clarify which planner is used for each method. All simulated comparisons use MPPI for all methods. We have fixed the citation of Nagabandi et. al. 2017a by replacing it with [2].\n\n- Regarding model bootstrapping: Sorry for the misunderstanding on our end. We edited the paper to clarify the following --- at training time, we iteratively collect and aggregate data using the MPPI with MPC for all model-based methods (our method, MB, and MB+DE), collecting data in the loop of training. As a result, our “MB” and “MB+DE” comparisons corresponds to MPPI with model-bootstrapping [2], with and without adaptation (respectively) when collecting roll-outs during training & run-time. For our method, we also use bootstrapping, meta-learning the dynamics models iteratively (see line 5 and 6 of Alg. 1). We therefore believe that our comparison is set up properly and that the paper adequately communicates this, but we would appreciate any feedback you might have here, and we would be happy to alter the comparison if needed.\n\n- “make it very explicit”: We edited the paper to make it clear that there is a training and run-time phase (which we refer to as meta-training and testing).\n\nFinally, we would emphasize that results on difficult problems, including substantial performance gains on 5 distinct tasks and including real-world robotic control problems, are also a contribution of our work. Algorithms that improve on prior work in terms of efficiency and generalization are of interest to the community, even when they build on ideas that were presented in prior work. If this were not the case, then most papers on model-based RL (a very old idea in itself) and RL for robotics would not be publishable. Therefore, we do not think that the criticism that there are other model-based RL papers, other meta-learning papers, or even other meta-learning model-based RL papers by itself precludes publication. We do however strongly agree with the reviewer that citing and discussing all relevant prior work, and appropriately scoping the claims, is critical, and we have endeavored to do so. We are grateful for any help and advice to do this better.\n\n[1] Meta Reinforcement Learning with Latent Variable Gaussian Processes, UAI 2018\n[2] MPPI with model-bootstrapping: Information Theoretic MPC for Model-Based Reinforcement Learning , ICRA 2017", "title": "Thanks again for the feedback"}, "H1x4xrK1Rm": {"type": "rebuttal", "replyto": "BJxo8zPU67", "comment": "We thank the reviewer for the valuable feedback, and we clarify the individual points below. We have edited the paper to address each of the concerns raised in the review, and we would appreciate additional feedback regarding whether we have addressed the reviewer's concerns about the paper or if the reviewer has anything else they would like us to improve. \n\n\"Results not unexpected\":\nWe agree that the sample efficiency of model-based RL is generally known, and we have revised Section 6.2 to explicitly state it. Our intent is not to claim that model-based RL is more sample-efficient than model-free RL (which, as the reviewer stated, is well known), but rather to show that meta-training for fast adaptation can improve over directly running online model updates with a model trained with standard model-based RL. Note that the comparison to \"MB-DE\" in Section 6.3 is precisely this comparison: adapting our meta-trained models outperforms adapting these standard model-based RL models by a large margin.\n\nThe takeaway of this work is fast adaptation of expressive dynamics models. For instance, a real robot adapting online (in milliseconds) to unseen and drastic dynamics changes has not been shown in prior work that we know of. We emphasize that our meta-trained model can adapt in less than a second, whereas model-based RL from scratch takes minutes or hours.\n\nRelation to MAML/prior work:\nWe have edited section 2 of the paper to clarify the relation to MAML. In summary: MAML assumes access to a hand-designed distribution of tasks. Instead, one of our primary contributions is the online formulation of meta-learning, where tasks correspond to temporal segments, enabling “tasks” to be constructed automatically from the experience in the environment; MAML is a very general algorithm, but it has not been previously demonstrated on online learning problems.\n\nEquation 3:\nWe have fixed the discrepancy and added several clarifications in Section 4. Our method uses M consecutives steps to predict the next K steps, which makes the assumption that the environment is constant for M+K timesteps. As a result, only a fraction of the roll-out, i.e. M+K timesteps, has to correspond to the same environment. The underlying assumption is that the subsequence of data does indeed come from the same environment. In our experiments, M+K is 0.5 seconds, making this assumption true most of the time. The fast adaptation (F.A.) environments in Section 6.3 show this adaptation occurring as the environment keeps changing within the rollouts.\n\nSection 6.2:\nWe fixed the typo that was originally in the caption: GrBAL and ReBAL are our proposed meta-learning algorithms, so there is indeed meta-learning in this experiment. In this plot, we aim to show that our model-based meta-learning approaches achieve high performance while using 1000x less data than the two model-free approaches. Finally, we edited this plot by adding two more comparisons to further clarify the benefit of our model-based meta-learning approach over standard non-meta-learned model-based approaches.\n\nThe reviewer's comment about the asymptotic performance is very relevant, so we added it to the text in section 6.2. We agree that the development of some model-based/model-free hybrid would be great, and plan to do this in future work.\n", "title": "Thank you for the feedback!"}, "ryx-_D6z67": {"type": "rebuttal", "replyto": "rJlYYIcC2X", "comment": "We thank the reviewer for the feedback.\n\nThe main concern of the reviewer is that we did not control for the choice of controller. This is a misunderstanding. We implemented the same controller for all of the model-based comparisons; hence, all comparisons reported in the paper are fair. To be precise, we used MPPI for all simulation experiments, and random-shooting MPC for all real-world experiments (since the action spaces were of lower dimension and did not need iterations of refinement). We updated the paper to clarify this.\n\nRelated work:\nWe thank the reviewer for pointing out these recent works. We updated the paper to incorporate citations for model-based RL, adapting inverse dynamic models, and the suggested recent model-based RL citation.\n\nSample efficiency:\nIn this section, we do both of the things the reviewer mentions: we compare our MB meta-learning method against a state-of-the-art MF meta-learning method to show the benefit of model-based over model-free, and against a state-of-the-art MF method to show the benefit of meta-learning.\n\nEvaluation:\nThe reviewer suggested 4 points to evaluate. Points (1) and (2) are exactly the results we show in Section 6.3: (1) corresponds to our full GrBAL/ReBAL, meta-learning with adaptation, and (2) corresponds to our MB baseline, which has neither meta-learning nor adaptation. We further have a DE baseline, which addresses the combination of adaptation without meta-learning.\n\nPoint (3) suggests metalearning the prior with the adaptation objective, but then not adapting it at test-time. We ran this experiment on the real robot, and it performed worse than (1) and (2), failing to solve the task. This is expected; the meta-learned model parameters (theta*) were optimized to be used only after adapting them. We can add these numerical results to our results. \n\nThe difference between the requested point (4) and our existing point (2) is the collection of expert data for initializing the training data set. Being able to collect expert samples is a strong assumption, requiring either human demonstrations or knowledge of the ground truth model, and does not fall under the assumptions of our problem setting.\n\nContribution:\nOur contribution is a new model-based meta-RL algorithm that incorporates elements of meta-learning and model-based RL. While our method is relatively simple, we are not aware of prior works that show that meta-learning can be used to enable online adaptation to varying dynamics in the context of model-based RL. Further, our experiments, which include domains that are more complex than the cartpole and double pendulum in [1], demonstrate the effectiveness of the approach. If we are mistaken regarding prior works, please let us know!\n\nWe would like to emphasize that our work presents an extensive comparative evaluation, and we believe that these results should be taken into consideration in evaluating our work. We compare multiple approaches across more than 6 simulated tasks as well as 4 tasks on a real-world robotic locomotion task. Hopefully our clarifications are convincing in terms of explaining why the evaluation is fair and rigorous, and we would of course be happy to modify it as needed.", "title": "Thank you for the feedback!"}, "rJlYYIcC2X": {"type": "review", "replyto": "HyztsoC5Y7", "review": "This work addresses the problem of online adapting dynamics models in the context of model-based RL. Learning globally accurate dynamics model is impossible if we consider that environments are dynamic and we can't observe every possible environment state at initial training time. Thus learning dynamics models that can be adapted online fast, to deal with unexpected und never seen before events is an important research problem.\n\nThis paper proposes to use meta-learning to train an update policy that can update the dynamics model at test time in a sample efficient manner. Two methods are proposed\n- GrBAL: this method uses MAML for meta-learning\n- ReBAL: this method trains a recurrent network during meta-training such that it can update the dynamics effectively at test time when the dynamics  change\n\nBoth methods are evaluated on several simulation environments, which show that GrBAL outperforms ReBAL (on average). GrBAL is then evaluated on a real system. \n\nThe strengths of this paper are:\n\n- this work addresses an important problem and is well motivated\n- experiments on both simulated and on a real system are performed\n\nThe weaknesses:\n\n- the related work section is biased towards the ML community. There is a ton of work on adapting (inverse) dynamics models in the robotics community. This line of work is almost entirely ignored in this paper. Furthermore some important recent references for model-based RL are not provided in the related work section (PETS [3] and MPPI [2]), although MPPI is the controller that is used in this work as a framework for model-based RL. Additionally, existing work on model-based RL with meta-learning [1] has not been cited. This is unacceptable. \n- There is no significant technical contribution - the \"contribution\" is that existing meta-learning methods have been applied to the model-based RL setting. Even if no-one has had that idea before - it would be a minor contribution, but given that there is prior work on meta-learning in the context of model-based RL, this idea itself is not novel anymore.\n- Two methods are provided, without much analysis. Often authors refer to \"our approach\" - but it's actually not clear what they mean by our approach. The authors can't claim \"model-based meta RL\" as their approach. \n- While I commend the authors for performing both simulation and real-world experiments, I find the that experiments lack a principled evaluation. More details below.\n\nFeedback on experiments:\n\nSection 6.2 (sample efficiency)\n\nYou compare apples to oranges here. I have no idea whether your improvements in terms of sample-efficiency are due to using a model-based RL approach or because your deploying meta-learning. It is well known that model-based RL is more sample efficient, but often cannot achieve the same asymptotic performance as model-free RL. Since MPPI is your choice of model-based RL framework, you would have to include an evaluation that shows results on MPPI with model bootstrapping (as presented in [2]) to give us an idea of how much more sample-efficient your approach is.\n\nSection 6.3 (fast adaptation and generalization)\n\nWhile in theory one can choose the meta-learning approach independently from the choice of model-based controller, in practice the choice of the MPC method is very important. MPPI can handle model inaccuracies very well - almost to the point where sometimes adaptation is not necessary. You CANNOT evaluate MPPI with online adaptation to another MPC approach with another model-learning approach. This does not give me any information of how your meta-learning improves model-adaptation. In essence these comparisons are meaningless. To make your results more meaningful you need to use the same controller setup (let's say MPPI) and then compare the following:\n1. MPPI with your meta-trained online adaptation\n2. MPPI results with a fixed learned dynamics model - this shows us whether online adaptation helps\n3. results of MPPI with the initial dynamics model (trained in the meta-training phase) -without online adaptation. This will tell us whether the meta-training phase provides a dynamics model that generalizes better (even without online adaptation)\n4. MPPI with model bootstrapping (as presented in [2]). This will show whether your meta-trained online adaptation actually outperforms simple online model bootstrapping in terms of sample-efficiency\n\nThe key here is that you need to use the same model-based control setup (whether its MPPI or some other method). Otherwise you cannot detangle the effect of controller choice from your meta-learned online adaptation.\n\n6.4 Real-world: same comments as above, comparisons are not meaningful\n\n[1] Meta Reinforcement Learning with Latent Variable Gaussian Processes, UAI 2018\n[2] MPPI with model-bootstrapping: Information Theoretic MPC for Model-Based Reinforcement Learning , ICRA 2017\n[3] Deep Reinforcement Learning in a Handful of Trials using Probabilistic Dynamics Models, NIPS 2018", "title": "Important problem, minor technical contribution, missing related work and poor evaluation.", "rating": "2: Strong rejection", "confidence": "5: The reviewer is absolutely certain that the evaluation is correct and very familiar with the relevant literature"}, "BJeoWBEghm": {"type": "rebuttal", "replyto": "S1gLnA52oQ", "comment": "Thank you for your suggestions. The biggest clarification that we would like to offer is that our method adapts online (in less than a second), and not minutes/hours. For example, when the agent sees a new terrain, when it encounters a slope, or when the system's pose estimation system become miscalibrated, we don't need to run multiple trials in this new setting (and we don't need an external reward signal like \"distance travelled\" to trigger/guide the adaptation). Instead, the agent constantly uses its past few data points, in a self-supervised way, to perform online adaptation of its dynamics model. Note that it successfully does this even when it encounters tasks that it did not see during training. This ability to adapt model parameters using such few data points is crucial, and we achieve it through meta-learning.\n\nWe will add discussion of these works in the next version of our paper, to be thorough. We would, however, like to emphasize that the purpose of our work is not adapting to damage. The purpose of our work is an algorithm that uses meta-learning to enable *online* model adaptation. Although recovering from damage is included in our experiments, it is merely one example in this category of experiencing unexpected disturbances at test time: We also evaluate other tasks such as a pier of differing buoyancy from that seen during training, slopes that were never seen during training, and pulling an unknown payload. A big difference between our work and the suggested work is that we are not performing trial and error learning. The problem statement itself is very different, and thus it does not make sense to perform such a comparison.", "title": "Thank you for your suggestions. Our work considers the problem of online adaptation (in less than a second) to various disturbances, rather than a trial-and-error method of adaptation (in minutes/hours) to damage."}}}