{"paper": {"title": "Learning Neural Generative Dynamics for Molecular Conformation Generation", "authors": ["Minkai Xu", "Shitong Luo", "Yoshua Bengio", "Jian Peng", "Jian Tang"], "authorids": ["~Minkai_Xu1", "~Shitong_Luo1", "~Yoshua_Bengio1", "~Jian_Peng1", "~Jian_Tang1"], "summary": "A novel probabilistic framework to generate valid and diverse molecular conformations. Reaching state-of-the-art results on conformation generation and inter-atomic distance modeling.", "abstract": "We study how to generate molecule conformations (i.e., 3D structures) from a molecular graph. Traditional methods, such as molecular dynamics, sample conformations via computationally expensive simulations. Recently, machine learning methods have shown great potential by training on a large collection of conformation data. Challenges arise from the limited model capacity for capturing complex distributions of conformations and the difficulty in modeling long-range dependencies between atoms. Inspired by the recent progress in deep generative models, in this paper, we propose a novel probabilistic framework to generate valid and diverse conformations given a molecular graph. We propose a method combining the advantages of both flow-based and energy-based models, enjoying: (1) a high model capacity to estimate the multimodal conformation distribution; (2) explicitly capturing the complex long-range dependencies between atoms in the observation space. Extensive experiments demonstrate the superior performance of the proposed method on several benchmarks, including conformation generation and distance modeling tasks, with a significant improvement over existing generative models for molecular conformation sampling.", "keywords": ["Molecular conformation generation", "deep generative models", "continuous normalizing flow", "energy-based models"]}, "meta": {"decision": "Accept (Poster)", "comment": "The paper combines flow-based and energy-based models to generate molecular conformations given a molecular graph.\nFor this, a continuous flow model is used to map the graph-based molecular representation into a distribution over conformations. \nAn energy-based model (EBM) is used to further help the model capture long-range atomic interactions. The proposed method is compared with strong baselines: CVGAE, GraphDG, and RDKit.\n\nThe authors addressed most of the reviewers' concerns in the rebuttal.\n\nAll the reviewers agree on acceptance."}, "review": {"PeQs67uJBHa": {"type": "review", "replyto": "pAbm1qfheGk", "review": "The authors of this manuscript proposed a generative dynamics system for the modelling and generation of 3D conformations of molecules. Specifically, there are three components: (1) conditional graph continuous flow (CGCF) to transform random noise to distances,  (2)a closed-form distribution p(R|d, G), and (3) an energy-based tilting model (ETM) to capture long-range interactions and correct the position matrix distribution. The proposed framework was compared with two deep learning methods for conformation generations -- CVGAE & GraphDG, as well as the computational chemistry tool RDKit on GEOM-QM9, GEOM-Drugs, and ISO17 data sets. Comparisons in terms of COV and MAT scores show that the proposed method (particularly the one enhanced with ETM) can outperform baselines. Further comparisons of distances densities show that CGCF (but without ETM) worked best over baselines. \n\nOverall, I think it is an interesting work. The major novelty is the use of continuous flow to model the conditional distribution of the distances and an energy-based model to correct the conditional distribution of positions. However, I have the following concerns.\n\n1. The presentation of this paper can be significantly improved. A few typos need to be corrected:\nsection x -? Section X\na optimization -> an optimization\nwhich a ...-> which is a...\ndemotes -> denotes\nreferences should be further formatted\n\n2. A bit more precise description about the force-fields algorithms in RDKit is needed.\n \n3. From results in Table 2, CGCF combined with the ETM component does work better than GraphDG, although the authors state that it is because the sharpness of the distance distribution. Clear justifications should be given to show the benefits, if any, of this phenomenon. ", "title": "Novel use of continuous flow in molecular conformation generation", "rating": "7: Good paper, accept", "confidence": "4: The reviewer is confident but not absolutely certain that the evaluation is correct"}, "qJJSA7lulX-": {"type": "rebuttal", "replyto": "LnQoFGQTj5y", "comment": "Thanks for your constructive comments and suggestions. The response to your concerns are listed below:\n\nQ1: COV and MAT do not appear to measure false positives — the CGCF+ETM approach could be generating many junk conformations and this would not be captured by the COV/MAT. Can the authors report a statistic over the generated distribution (instead of over the test set)?  \nA1: This is a great point! We have added two experiments in the updated version to address your concern.   \n1. Since the COV and MAT score do not appear to explicitly measure the generated false samples, we additionally define **Junk** rate measurement. Intuitively, JUNK measures the fraction of generated conformations that are far away from all the conformations in the reference set. For each conformation in the generated set, it will be marked as a false sample if its RMSD to all the conformations of the reference set are above a given threshold. Typically, a lower JUNK rate means better generated quality. The results are as follows:  \nModel & QM9-Mean & QM9-Median & Drugs-Mean & Drugs-Median  \nCVGAE & 71.59 & 100.00 & 100.00 & 100.00   \nGraphDG & 61.25 & 66.26 & 97.83 & 100.00   \nCGCF & 55.24 & 57.24 & 77.82 & 90.00   \nCGCF+ETM & 52.15 &  54.23 &  75.81 & 88.64  \nRDKit & 17.07 & 5.90 & 45.51 & 45.94  \nCVGAE + FF & 62.92 & 71.21 & 72.01 & 78.44  \nGraphDG + FF & 45.53 & 46.35 & 55.50 & 61.54  \nCGCF+FF & 43.01 & 46.69 & 37.48 & 36.63  \nCGCF+ETM+FF & 41.63 &  43.97 & 36.16 & 33.05  \nAs shown in the table, our CGCF model can already outperform the existing state-of-the-art baselines with an obvious margin. The results are further improved when combined with ETM to explicitly incorporate the long-range correlations.  \n2. We follow Mansimov et al. to add a new experiment to measure the diversity of generated conformations, which is a statistic over the generated distribution instead of over the test set. The results (on ISO17) are measured by calculating the mean and standard deviation of the pairwise RMSD between each pair of generated conformations per molecule. The results are summarized as follows:  \nMetric & RDKit & CVGAE & GraphDG & CGCF & CGCF+ETM  \nMean & 0.083 & 0.207 & 0.249 & 0.810 & 0.741  \nStd & 0.054 & 0.187 & 0.104 & 0.223 & 0.206  \nThe results demonstrate that while our method can achieve the lowest MMD for distance distribution, it does not collapse to generating extremely similar conformations.  \n\nQ2: The abstract/introduction focuses on the computational expense of competing approaches. Can the authors comment on the computationally expense for generating each conformation?  \nA2: Actually the computational cost of Molecular Dynamics (MD) mentioned in the abstract/introduction is not comparable to deep generative models, including CVGAE, GraphDG and our method. Our deep generative models can generate a conformation in seconds, while the conventional methods typically take several hours to predict a geometry, or even days for larger ones.  \n\nQ3: How do the molecular properties of the generated distribution compare to the test distribution (e.g. small molecule properties in Simm & Hernandez-Lobato Table 2)?  \nA3: We follow Axelrod et al. to add an experiment on two quantities related to conformational property. In practice, we first pretrain a SchNet for energy prediction, and then take the pretrained model to estimate the energy of conformations generated from different methods. For evaluation, the first quantity is the average conformational energy <E>, which is calculated by averaging the energy of generated conformations for each molecule. And the second quantity is the lowest-energy E_L, which is defined with respect to the lowest-energy conformer for each molecule. Similar to Simm et al., due to the poor generated quality, we could not compute the properties for CVGAE, and thus this baseline is excluded from this analysis. We calculate the Mean Absolute Error (MAE) in energy properties between ground truth and generated conformations from different methods.The results are shown as follows:  \nmethods & E_L & <E>  \nRDKit & 0.01255 & 2.60450  \nGraphDG & 0.01265 & 3.13825  \nCGCF & 0.01253 & 3.14391  \nCGCF+ETM & 0.01250 & 3.13799  \nIt can be seen that different methods perform similarly. For the deep generative models, our method can achieve slightly better performance than GraphDG.  \n\nQ4: Can the authors clarify if any of the test set molecules from GEOM-QM9 or GEOM-DRUGS are in the training set? It was unclear from the writing.  \nA4: No, the training set and test set are totally different. We have added these details in the updated version.  ", "title": "Response to the AnonReviewer2"}, "bCwwKaf4vH-": {"type": "rebuttal", "replyto": "OQopXt-Z89F", "comment": "Thank you very much for pointing out the related work! Our work is indeed related to these works, and we have added the suggested references in the updated version. However, our work is fundamentally different from these works.\n\nDifferent from the previous works, we concentrate on molecular geometry generation, and propose a novel and principled probabilistic framework to address the domain-specific problems. More specifically, we first predict the atomic distances through the continuous normalizing flow, and then convert them to the desired 3D conformation and optimize it with the energy-based model. This procedure enables us to keep the rotational and translational invariance property. Besides, to the best of our knowledge, we are the first one to combine neural ODE with EBMs. We take the ODE model to improve the training of EBM, and combine both to conduct the two-stage sampling dynamics.", "title": "Thank you very much for pointing out the related work!"}, "cF4hoy-JvMH": {"type": "rebuttal", "replyto": "PeQs67uJBHa", "comment": "Thanks for your constructive comments and suggestions. The response to your concerns are listed below:\n\nQ1: The presentation of this paper can be significantly improved. A few typos need to be corrected: section x -? Section X a optimization -> an optimization which a ...-> which is a... demotes -> denotes references should be further formatted  \nA1: Thanks for pointing them out and we’ve already corrected them in the updated version.\n\nQ2: A bit more precise description about the force-fields algorithms in RDKit is needed.  \nA2: In MMFF, the energy expression is constituted by seven terms: bond stretching, angle bending, stretch-bend, out-of-plane bending, torsional, van der Waals and electrostatic. The detailed functional form of individual terms can be found in the original literature. To build the force field for a given molecular system, the first step is to assign correct types to each atom. At the second step, atom-centered partial charges are computed according to the MMFF charge model. Then, all bonded and non-bonded interactions in the molecular system under study, depending on its structure and connectivity, are loaded into the energy expression. Optionally, external restraining terms can be added to the MMFF energy expression, with the purpose of constraining selected internal coordinates during geometry optimizations. Once all bonded and non-bonded interactions, plus optional restraints, have been loaded into the MMFF energy expression, potential gradients of the system under study can be computed to minimize the energy.  \nWe have added the above detailed description of the MMFF force field algorithm in the updated version.\n\nQ3: From results in Table 2, CGCF combined with the ETM component does work better than GraphDG, although the authors state that it is because of the sharpness of the distance distribution. Clear justifications should be given to show the benefits, if any, of this phenomenon.   \nA3:   \n1. Tab.2 shows that generally CFCF+ETM works better than GraphDG, but worse than CGCF itself. Here we give a discussion about why ETM will slightly hurt the performance and its benefits:  \nThis phenomenon is natural because typically ETM will sharpen the generated distribution towards the stable conformations with local minimal energy. By contrast, the ISO17 dataset consists of snapshots of molecular dynamics where the structures are not equilibrium conformations but samples from the density around the equilibrium state. Therefore, ETM will slightly hurt the results. \nActually this phenomenon is also consistent with the observations for RDKit. Instead of generating unbiased samples from the underlying distribution, RDKit will also generate the stable ones with local minimal energy by involving the hand-designed molecular force field (Simm et al.). And as shown in the results, though highly competitive in Tab.1, RDKit also suffers much weaker results in Tab.2. Therefore, similarly to RDKit, the benefits of the sharpness of the generated distribution can be found in Tab.1, where ETM can obviously boost the performance of CGCF by generating more stable conformations.  \nWe have refined our statement and added the above discussion in the updated version.  \n2. We also follow Mansimov et al. to add a new experiment to measure the diversity of generated conformations. The results are measured by calculating the mean and standard deviation of the pairwise RMSD between each pair of generated conformations per molecule. The results are summarized as follows:  \nMetric & RDKit & CVGAE & GraphDG & CGCF & CGCF+ETM  \nMean & 0.083 & 0.207 & 0.249 & 0.810 & 0.741  \nStd & 0.054 & 0.187 & 0.104 & 0.223 & 0.206  \nWe can observe that ETM will slightly hurt the diversity of CGCF, which verifies our statement that ETM will sharpen the generated distribution towards the stable conformations with local minimal energy.  \n\n&nbsp; &nbsp; &nbsp; &nbsp; \n\nReference:  \n(Simm et al.) Simm G N C, Hernández-Lobato J M. A generative model for molecular distance geometry[J]. arXiv preprint arXiv:1909.11459, 2019.  \n(Mansimov et al.) Mansimov E, Mahmood O, Kang S, et al. Molecular geometry prediction using a deep generative graph neural network[J]. Scientific reports, 2019, 9(1): 1-13.", "title": "Response to the AnonReviewer4"}, "jmYvdtUD7te": {"type": "rebuttal", "replyto": "TgmbFYL30tU", "comment": "Q4: In Table 1, the EBM improves performance on the conformation generation tasks. However, in Table 2, the EBM decreases performance on the distribution over distances task. I would have liked to see more investigation or discussion of why this is the case.  \nA4:   \n1). This phenomenon is natural because typically ETM will sharpen the generated distribution towards the stable conformations with local minimal energy. By contrast, the ISO17 dataset consists of snapshots of molecular dynamics where the structures are not equilibrium conformations but samples from the density around the equilibrium state. Therefore, ETM will slightly hurt the results.   \nActually this phenomenon is also consistent with the observations for RDKit. Instead of generating unbiased samples from the underlying distribution, RDKit will also generate the stable ones with local minimal energy by involving the hand-designed molecular force field ((Simm et al.)). And as shown in the results, though highly competitive in Tab.1, RDKit also suffers much weaker results in Tab.2.  \nWe have refined our statement and added the above discussion in our paper.  \n2). We also follow Mansimov et al. to add a new experiment to measure the diversity of generated conformations. The results are measured by calculating the mean and standard deviation of the pairwise RMSD between each pair of generated conformations per molecule. The results are summarized as follows:  \nMetric & RDKit & CVGAE & GraphDG & CGCF & CGCF+ETM  \nMean & 0.083 & 0.207 & 0.249 & 0.810 & 0.741  \nStd & 0.054 & 0.187 & 0.104 & 0.223 & 0.206  \nWe can observe that ETM will slightly hurt the diversity of CGCF, which verifies our statement that ETM will sharpen the generated distribution towards the stable conformations with local minimal energy.  \n\nQ5: The RDKit baseline is not included in Table 2. It is included in the GraphDG paper and should be included here as well.  \nA5: Actually we have included RDKit as a baseline : )  \n\n&nbsp; &nbsp; &nbsp; &nbsp; \n\nReference:  \nSimm et al. Simm G N C, Hernández-Lobato J M. A generative model for molecular distance geometry[J]. arXiv preprint arXiv:1909.11459, 2019.  ", "title": "Response to the AnonReviewer1 cont."}, "AWPNGlczfPx": {"type": "rebuttal", "replyto": "TgmbFYL30tU", "comment": "Thanks for your constructive comments and suggestions. The response to your concerns are listed below:\n\nQ1: While the model performs better than neural baselines, it does not yet approach RDKit, which is based on expert knowledge features. This means the proposed model is not yet practically useful.  \nA1: 1. As also claimed in Simm et al., methods such as RDKit just aim to produce a low-energy conformation, not to generate unbiased samples from the underlying distribution at a certain temperature. By contrast, our deep generative models can model the underlying distribution and generate samples from it. This advantage can be observed from distribution Tab 2, where both GraphDG and our method can outperform RDKit with a significant margin.  \n2. Besides, on the large molecule dataset Drugs, when combined with the force field (FF), our method achieved very good results (COV 92.41 and MAT 0.77), which is much better than RDKit.  Moreover, the Drugs dataset is also more challenging than QM9, which indicates that the proposed method is already practically useful for the large and complex conformations.  \n\nQ2: Only two tasks were investigated, and only one or two datasets within each task. The empirical evaluation of this paper could be improved by including more experiments (e.g. along the lines of Mansimov et al. 2019)  \nA2: Thanks for your suggestions and we have added three experiments:  \n1). In Section 4.3, we follow Mansimov et al. to add a new experiment to measure the diversity of generated conformations, which is a statistic over the generated distribution instead of over the test set. The results (on ISO17) are measured by calculating the mean and standard deviation of the pairwise RMSD between each pair of generated conformations per molecule.  \n2). In Appendix J, we follow Axelrod et al. to add an experiment on two quantities related to conformational property prediction.  \n3). In Appendix J, we additionally define **Junk** rate measurement, which Intuitively  measures the fraction of generated conformations that are far away from all the conformations in the reference set.  \n\nQ3: The paper attributes the advantage in RDKit to its inclusion of a force field. Therefore, the authors combine a force field with their model and assess the difference (good!) However, the conclusion in the paper seems misguided - looking at Table 1, including the force field does not result in a significant change in their model's performance. In fact, this experiment was also done in the CVGAE paper (Mansimov et al. 2019).  \nA3: Firstly, on the Drugs dataset, our method improved a lot when combined with force field (FF), and achieved impressive results (COV 92.41 and MAT 0.77). Because the molecules in Drugs are much larger and challenging, actually these results are more convincing than the results on the QM9 dataset where the improvement is marginal.  \nSecondly, on the QM9 dataset, though the improvement of our method is kind of limited, FF still boosts the performance of our method, which still outperforms the baselines. And the improvement of FF for other models (CVGAE and GraphDG) are still obvious.  \nThus we draw the conclusion in the paper that: 1) FF plays a vital role in generating more realistic structures, and 2) our method has a strong capacity to generate high-quality initial coordinates.  ", "title": "Response to the AnonReviewer1"}, "Il56hIlxdEE": {"type": "rebuttal", "replyto": "LnQoFGQTj5y", "comment": "Q5: Which bonds are in the set of interatomic distances? The authors define distances as the set of all covalent bonds in the molecule in the methods section, but later mention auxiliary angle/dihedral bonds. This was confusing in the first read.   \nA5: Since the bonds existing in the molecular graph are not sufficient to characterize a conformation, we pre-process the graphs by extending \\textit{auxiliary} edges. Specifically, the atoms that are $2$ or $3$ hops away are connected with \\textit{virtual bonds}, labeled differently from the real bonds of the original graph. These extra edges contribute to reducing the degrees of freedom in the 3D coordinates, with the edges between second neighbors helping to fix the angles between atoms, and those between third neighbors fixing dihedral angles.  \nWe have added contents to mention this procedure in the updated version.  \n\nReference:  \n(Mansimov et al.) Mansimov E, Mahmood O, Kang S, et al. Molecular geometry prediction using a deep generative graph neural network[J]. Scientific reports, 2019, 9(1): 1-13.  \n(Axelrodet al.) Axelrod S, Gomez-Bombarelli R. GEOM: Energy-annotated molecular conformations for property prediction and molecular generation[J]. arXiv preprint arXiv:2006.05531, 2020.  \n(Simm et al.) Simm G N C, Hernández-Lobato J M. A generative model for molecular distance geometry[J]. arXiv preprint arXiv:1909.11459, 2019.    ", "title": "Response to the AnonReviewer2 cont."}, "NVYvFeg_CUA": {"type": "rebuttal", "replyto": "pAbm1qfheGk", "comment": "We would like first to thank all the reviewers and readers for your constructive reviews.  \nWe’ve revised the paper according to your reviews. Specifically, we have made the following changes: \n\n1). We have added three experiments:\n1. In Section 4.3, we follow Mansimov et al. to add a new experiment to measure the diversity of generated conformations, which is a statistic over the generated distribution instead of over the test set. The results (on ISO17) are measured by calculating the mean and standard deviation of the pairwise RMSD between each pair of generated conformations per molecule.\n2. In Appendix J, we follow Axelrod et al. to add an experiment on two quantities related to conformational property prediction.\n3. In Appendix J, we additionally test **Junk** rate measurement, which intuitively measures the fraction of generated conformations that are far away from all the conformations in the reference set.\n\n2). In Section 4.3, we add discussions and experiments on why EBM slightly decreases performance on the distribution over distances task.\n\n3). In Appendix A, we add the suggested references and discuss the difference between our work and previous related works for computer vision.\n\n4). We add more description about the data processing procedure, and more information about the experiment details (the training and testing data setting). \n\n&nbsp;&nbsp;&nbsp;&nbsp;\n\nReference:  \n(Mansimov et al.) Mansimov E, Mahmood O, Kang S, et al. Molecular geometry prediction using a deep generative graph neural network[J]. Scientific reports, 2019, 9(1): 1-13.  \n(Axelrodet al.) Axelrod S, Gomez-Bombarelli R. GEOM: Energy-annotated molecular conformations for property prediction and molecular generation[J]. arXiv preprint arXiv:2006.05531, 2020.\n", "title": "General response to all the reviewers and readers"}, "TgmbFYL30tU": {"type": "review", "replyto": "pAbm1qfheGk", "review": "This paper combines flow-based and energy-based models to generate molecular conformations from a molecular graph.\n\nStrengths\n- The modeling is well-motivated and creative. A continuous flow model maps a graph-based molecular representation into a distribution over conformations. The continuous flow is well-motivated; it factors out the distance calculations to resolve concerns in previous works where pairwise distances are modeled independently. \n- Additionally, an energy-based model (EBM) is used to further help the model capture long-range atomic interactions. Recent advancements in EBMs are deployed for stable training, such as a lavengin dynamics.\n- The paper is well-written, clear and easy to follow, despite the complexity of the model\n- Strong baselines: CVGAE, GraphDG, and RDKit. Results are slightly better than CVGAE for conformation generation, and slightly better for distance distribution. \n\nWeaknesses\n- While the model performs better than neural baselines, it does not yet approach RDKit, which is based on expert knowledge features. This means the proposed model is not yet practically useful.\n- Only two tasks were investigated, and only one or two datasets within each task. The empirical evaluation of this paper could be improved by including more experiments (e.g. along the lines of Mansimov et al. 2019)\n- The paper attributes the advantage in RDKit to its inclusion of a force field. Therefore, the authors combine a force field with their model and assess the difference (good!) However, the conclusion in the paper seems misguided - looking at Table 1, including the force field does not result in a significant change in their model's performance. In fact, this experiment was also done in the CVGAE paper (Mansimov et al. 2019).\n- In Table 1, the EBM improves performance on the conformation generation tasks. However, in Table 2, the EBM decreases performance on the distribution over distances task. I would have liked to see more investigation or discussion of why this is the case.\n- The RDKit baseline is not included in Table 2. It is included in the GraphDG paper and should be included here as well.\n\nOverall, this paper presents a creative model that performs better than existing neural models. However, the evaluation feels preliminary compared to what we see in earlier works.", "title": "Creative modeling ", "rating": "6: Marginally above acceptance threshold", "confidence": "3: The reviewer is fairly confident that the evaluation is correct"}, "LnQoFGQTj5y": {"type": "review", "replyto": "pAbm1qfheGk", "review": "This paper presents an approach to generate diverse small molecule conformations given its graph by combining a conditional flow-based model with an energy-based model. Sampling is performed in two separate stages: 1) a normalizing flow produces a distribution over interatomic distances (which is then postprocessed into cartesian coordinates), 2) sampled coordinates are refined by Langevin dynamics with gradient signal produced from an energy-based model. The models are trained separately.\n\nI thought that this was an interesting, principled approach that advances the state of the art in generative models for molecular conformation sampling.  This approach (CGCF+ETM) appears to generate better samples than the VAE-based baselines, though all methods are still improved by a final refinement step with traditional forcefields (esp. for larger drug-like molecules) which suggests room for improvement. The general sampling strategy is potentially relevant in many other domains.\n\nThere were some aspects of the evaluation that could be improved/clarified:\n- COV and MAT do not appear to measure false positives — the CGCF+ETM approach could be generating many junk conformations and this would not be captured by the COV/MAT.  Can the authors report a statistic over the generated distribution (instead of over the test set)?\n- The abstract/introduction focuses on the computational expense of competing approaches. Can the authors comment on the computationally expense for generating each conformation?\n- How do the molecular properties of the generated distribution compare to the test distribution (e.g. small molecule properties in Simm & Hernandez-Lobato Table 2)?\n- Can the authors clarify if any of the test set molecules from GEOM-QM9 or GEOM-DRUGS are in the training set? It was unclear from the writing.\n- Which bonds are in the set of interatomic distances? The authors defines distances as the set of all covalent bonds in the molecule in the methods section, but later mention auxiliary angle/dihedral bonds. This was confusing in the first read.\n- Typo in Eq (9) ‘==‘", "title": "Interesting new generative model for molecular conformations with strong results; Some questions on evaluation", "rating": "6: Marginally above acceptance threshold", "confidence": "3: The reviewer is fairly confident that the evaluation is correct"}}}