{"paper": {"title": "Deep Perm-Set Net: Learn to predict sets with unknown permutation and cardinality using deep neural networks", "authors": ["S. Hamid Rezatofighi", "Roman Kaskman", "Farbod T. Motlagh", "Qinfeng Shi", "Daniel Cremers", "Laura Leal-Taixé", "Ian Reid"], "authorids": ["hamid.rezatofighi@adelaide.edu.au", "roman.kaskman@tum.de", "farbod.motlagh@student.adelaide.edu.au", "javen.shi@adelaide.edu.au", "cremers@tum.de", "leal.taixe@tum.de", "ian.reid@adelaide.edu.au"], "summary": "We present a novel approach for learning to predict sets with unknown permutation and cardinality using feed-forward deep neural networks.", "abstract": "Many real-world problems, e.g. object detection, have outputs that are naturally expressed as sets of entities. This creates a challenge for traditional deep neural networks which naturally deal with structured outputs such as vectors, matrices or tensors. We present a novel approach for learning to predict sets with unknown permutation and cardinality using deep neural networks. Specifically, in our formulation we incorporate the permutation as unobservable variable and estimate its distribution during the learning process using alternating optimization. We demonstrate the validity of this new formulation on two relevant vision problems: object detection, for which our formulation outperforms state-of-the-art detectors such as Faster R-CNN and YOLO, and a complex CAPTCHA test, where we observe that, surprisingly, our set based network acquired the ability of mimicking arithmetics without any rules being coded.", "keywords": ["Set learning", "Permutation invariant", "Object detection", "CAPTCHA test"]}, "meta": {"decision": "Reject", "comment": "Strengths:\nThe method extends [21], which proposes an unordered set prediction model for multi-class classification.\nThe submission proposes a formulation to learn the distribution over unobservable permutation variables based on deep networks and uses a MAP  estimator for inference.\nWhile the failure of NMS to detect overlapping objects is expected, the experiments showing that perm-set prediction handles them well is interesting and promising. \n\nWeaknesses:\n\nReviewer 1: \"I find the paper still too scattered, trying to solve diverse problems with a hammer without properly motivating / analyzing key details of this hammer. So I keep my rating.\"\nReviewer 2: \"I'm glad that the authors are seeing good performance and seem to have an effective method for matching outputs to fixed predictions, however the quality of the paper is too poor for publication.\"\n\nPoints of contention:\n\n Although there was one reviewer who gave a high rating, they were not responsive in the rebuttal phase.  The other two reviewers took into account the author responses, and a contributed comment by an unaffiliated reviewer, and both concluded that the paper still had serious issues.  The main issues were: lack of clear methodology and poor clarity (AnonReviewer2), and poor organization and lack of motivation for modeling choices (AnonReviewer1)."}, "review": {"ryl0dgqwam": {"type": "rebuttal", "replyto": "H1eoH7T167", "comment": "We appreciate your clarification. ", "title": "Thank you "}, "rkxaglcwTm": {"type": "rebuttal", "replyto": "r1x0cUg5nm", "comment": "We thank Maxwell for some clarification. We believe AnonReviewer2 misunderstood some of the concepts and we will try to clarify them here and update the paper accordingly.  \n\n- predicting unordered sets\nThe assumption is what is available as GT is a set. This means we cannot infer any specific ordering from GT. The proposed framework is very flexible as we don’t need to enforce the problem to be necessarily orderless  (although it can be). The reason we would like to learn  p_m(\\pi | x_i, w) is to infer the nature of the problem. However, excluding the main experiment in supplementary material, we did enforce the problem to be orderless by removing O2 and the permutation loss. This is equivalent to assume p_m(\\pi | x_i, w) is uniform (order does not matter) in Eq.2 and you can see O2 and its loss will be eliminated from Eq. 5 and 6. However, we still require to solve Eq. 5 to find the best permutation based on f1 only, which is equivalent to use Hungarian to solve the assignments. \n \nWe also disagree with R3 that the problem is either unordered sets or there exist only one order to be correct. There can exist multiple orders to be true, but not all. This can be inferred by learning p_m(\\pi | x_i, w) from samples derived during training by Eq. 5. \n\n- permutation in the likelihood (2) does not make sense:\nIn addition to what is explained by Maxwell, I add this clarification:\np_y(y_1 | x, w, (1, 2)) means the first output is assigned to the first ground truth, while p_y(y_1 | x, w, (2, 1)) mean the first output is assigned to the second ground truth. These two scenarios are acctally generate very different gradient.  The same argument can be extended to p_y(y_2 | x, w, (1, 2)) and p_y(y_2 | x, w, (2, 1)). \n\n- the dependence on \\pi drops out when getting a MAP estimate of outputs: \nThe permutation takes into the account when there is loss and a GT to compare as GT  annotations are permutated to be assigned to the outputs. During inference, we don’t have loss and GT. We just have the predicted outputs, e.g. cardinality, states and premutation and the order which we want to show the states will not change the value of the states. \n\n\nWe hope to have clarified all the technical misunderstandings. We would like to point the reviewer again to our impressive results in the detection problem and ask him/her to reconsider his/her rating if the technical concerns are now clear.", "title": "Clarifying the formulation"}, "SkxrcuFw6m": {"type": "rebuttal", "replyto": "S1l5N7S53X", "comment": " U^m in Eq 1:\nThis term is clearly defined at the beginning of section 3, first paragraph, line 6 “U is the unit of hyper-volume in ...” . U^m is simply U powered by the cardinality variable. \nIn section 3.3, in the paragraph after Eq.7 line 2, we explain the mechanism to obtain U. For each experiment, we also report the tuned value for U. \n\n- The term p(w) in Eq 2:\nNote Eq. 2 calculates the posterior, i.e., p(w|D) and according to the Bayes theorem, it is p(w|D) \\propto p(D|w)p(w) which is simply Eq. 1.\n\n- Eq 5 confusion :\nTo explain Eq.5 and Eq. 6, the training works as follows:\nAt each iteration k-1, the network predicts the outputs, i.e., O1, O2 and \\alpha. We first solve a discrete optimization to find the permutation (matching) between the predictions at k-1 and the ground truth (GT). Then, we use this permutation to order GT and back-propagate the losses to update w at iteration k. Please note that cardinality loss does not depend on this permutation variable.\n\n- The network architecture :\nNote that our described methodology can be applied to any network architecture. In ALL our experiments, we use Res-net 101 (mentioned several times on page 6 and 8). \nWe only need to define the number of outputs and use the set loss defined in Eq. 5 and 6. For example, for the set size with maximum cardinality 4, we need 5 outputs ( \\alpha) for cardinality m = {0, 1,...4}. If the state of each set is 5 for the detection experiment, we need 4*5=20 outputs for the state  loss (O1). For the permutation (O2), we need 4!=24 outputs.\nFor each output we have a loss defined for each experiment in the text.\n\n- the permutation to benefit training:\nWe refer the reviewer to the experiment we have already included in Appendix titled “An additional baseline experiment”, which unfortunately we could not include in the main manuscript due to space constraints.\n We use a baseline model with no permutation, which is exactly same as [21], to train the network for the detection task. The results show the model is not able to learn this task, hence highlighting the need for permutation prediction for a complete set prediction network.\nEven if we remove the permutation head, O2, from our model, we still need to calculate the permutation using Eq. 5 and use it for backpropagation in Eq. 6. However the model in [21] completely ignore the permutation in its formulation. Therefore, it cannot learn the detection task.  \n\n- Term f2 in Eq5 uses w~ estimates: \nYour interpretation is indeed correct. Given the predictions of O1 and O2 using statistics from past SGD runs, we want to find the best permutation. There are indeed m! way to assign GT set elements to the predictions. We solve this optimization to find the best one. \n\n- the significance of the permutation:\nEven if we don’t use f2 for the estimation of the best permutation, we can use \\pi* as ground truth for updating its loss in Eq. 6.\n\n- classifying permutations:\nClassifying the permutations provides the extra information about the structure of the problem, e.g. there exist a single order which matters or it can be several different orders or the problem is orderless. We simply do not ignore the permutations from Hungarian by allowing the network to learn them. We refer you to the experiment we have already included in Appendix titled “Detection & Identification results”, where we used the predicted permutations to identify the bounding boxes for similar looking objects across different test images\n\n-  larger images and many instances:\nWe agree. We leave this as future work, as it would require an engineering effort that departs from the main purpose of our paper, which is to show theoretically how to construct a network that can work with sets instead of tensors.\n\n- sensitivity to seeing a certain cardinality:\nDuring the training, we do the data augmentation (by cropping, flipping etc) to ensure the network sees enough sample for each cardinality. We will include this detail in the text.\n\n- Related work \nWe are happy to include these references. But these works are orthogonal to the main subject of our paper. In our paper the goal is to introduce a framework to output a set using neural networks and we used the detection task as one of the set prediction examples.\nWe would like to add few comment about these two works:\nThese approaches try to learn a pairwise relationship between the boxes outputted using the conventional proposal based detection approaches. First a) they need to introduce extra pairwise network or heavier computation to learn these pairwise relationship b) they assume the relationship is pairwise between bounding boxes. Out framework is a single stage approach which uses a conventional convnet backbones with no extra computation. Since it is end-to-end prediction of boxes, we don’t enforce any pairwise or higher order relationships between the outputs. We all rely on the layer of neural nets to capture high level relationship between outputs before predicting them. ", "title": "Clarifying all key details"}, "ryx3iYPDam": {"type": "rebuttal", "replyto": "rJegAZu6nQ", "comment": "We appreciate AnonReviewer3’s recognition of our work. \n\n- Network details\nWe only replace the last fc layer of ResNet-101 with a new fc layer mapping to 49 (5+20+24 = 49) outputs for calculating cardinality, states and permutation (the choice of these numbers explained in our response to R2). \n\n- inference time\nWe also performed extra experiment on accuracy and inference time between different detectors (on the same machine and GPU) reported here:\n\nFaster R-CNN: AP=0.68, Inference time=101 ms\nYOLO v2: AP=0.68, Inference time=12.3 ms\nYOLO v3: AP=0.70, Inference time=18.2 ms\nOur network: AP=0.75, Inference time=15.1 ms\n\n- test on PASCAL VOC\nWe observed PASCAL VOC dataset include many images with more than 4 persons. Considering the images include up to 4 persons only, we might not have enough training data to train ResNet-101 network. ", "title": "Network details and inference time"}, "rJegAZu6nQ": {"type": "review", "replyto": "rJVoEiCqKQ", "review": "\nThe paper is really interesting. Set prediction problem has lots of applications in AI applications and the problem has not been conquered by deep networks. \n\nThe paper proposes a formulation to learn the distribution over unobservable permutation variables based on deep networks and uses a MAP  estimator for inference.  It has object detection applications. The results show that it can outperform YOLOv2 and Faster R-CNN in a small pedestrian detection dataset which contains heavy occlusions. \n\nThe limitation is clearly stated in the last part of the paper that the number of possible permutations exponentially grows with the maximum set size (cardinality). \n\nIn the author response period, I would like the author give more details about the pedestrian detection experiments, such as how many dense layers are used after ResNet-101, what are the training and inference time, is it possible to report results on PASCAL VOC (only the person class).\n\nThe method is exciting for object detection funs.  I would like to encourage the authors to release the code and let the whole object detection community overcome the limitation in the paper. \n\n\n\n", "title": "novel, potentially significant & with limitation on large-scale problem", "rating": "7: Good paper, accept", "confidence": "3: The reviewer is fairly confident that the evaluation is correct"}, "S1l5N7S53X": {"type": "review", "replyto": "rJVoEiCqKQ", "review": "— Summary\nThe method extends [21], which proposes an unordered set prediction model for multi-class classification. For that problem, [21] can assume logistic outputs for all distinct classes. This work extends set prediction to the object detection task, where box identity is not distinct — this is handled by an additional model output that reasons about the most likely object permutations. The permutation predictions are used during training, but are not needed at inference time — as shown in Fig1 and Eq 7. Results are on detection of overlapping objects and a CAPTCHA toy summation example.\n\n— Clarity \nThe exposition is not particularly clear in several places: \n - U^m in Eq 1 is undefined and un-discussed. What probability term does it correspond to? It is supposed to make probabilities of different cardinalities comparable, but the exact mechanism is unclear. \n - The term p(w) disappears on the left hand side of Eq 2. \n - Notation in Sec. 3.2 is very cumbersome, making it hard to follow. Furthermore, I found the description ambiguous, preventing me from understanding how exactly the permutation head output is used in Eq 5. Specifically, there is some confusion about estimation of w~, which seems based on frequency estimation from past SGD iterations (Eq 3). If so, why does term f2 in Eq 5 contain the permutation head output O2 and how do the two relate? \n - The network architecture is never described, especially the transition from Conv to Dense and the layer sizes, making the work hard to reproduce. The dimensions of the convolutional feature map matter (probably need to be kept tractable). \n\n— Significance\nKey aspects of the model are not particularly clear, specifically about how the permutation prediction ( the key novelty here) is used to benefit training. \n— Term f2 in Eq5 uses w~ estimates, which appeared to be based on statistics from past SGD runs, yet also depends on the output of the permutation head O2. Am I misinterpreting the method?\n— In the paragraph right after Eq5, it’s claimed that “Empirically, in our applications, we found out that estimation of the permutations from just f1 [in Eq5] is sufficient to train properly … by using the Hungarian algorithm”. So then f2 term is not even used in. Eq5? If so, what is the significance of the permutation head other than adding an auxiliary loss? \n\nFurthermore, there are no experimental results demonstrating the effect of the permutation head and the design choices above — if we could get by with only using the Hungarian algorithm, why bother classifying an exponential number of permutations? Do they help when added as an auxiliary loss?  \n\nWhile the failure of NMS to detect overlapping objects is expected, the experiments showing that perm-set prediction handles them well is interesting and promising. Solving the general case with larger images and many instances would increase the impact significantly — and likely require a combination of perm-set prediction and image tiling, although this is just a hypothesis. The Captcha toy example also shows some interesting behavior emerging — without digit-specific annotations (otherwise it would be multi-class classification setup from [21]), the model can handle the majority of summations correctly. \n\n— Experimental results\nThe results are interesting proofs-of-concept but a few more experiments/answers would be helpful:\n- It still appears that PR curve in the high-precision regime (fig 3b) has lower precision than FRCNN/YOLO. Any idea as to why? \n- Ablation results on the effect of the permutation predictions vs Hungarian algorithm, etc would be helpful, as discussed above. \n- How sensitive is the method to seeing a certain cardinality? What if it never sees 3 pedestrians in an image, but only 1,2,4 will it fail to predict 3? Or alternatively, if we train a model that can handle up to 5-6 entities with examples than have <=4? What is the right way of data augmentation for this model (was there any and should there be?)\n- Given that values for U differ across applications, how sensitive is the output / how much sweeping did you have to do?\u2028\n\n-- Related work\nTo the best of my knowledge it's representative. It would help to cite more recent work that decreases detector dependence on NMS. For example, \"Learning Non-Maximum Suppression\", Hosang, Benenson, Schiele, CVPR 2017 or \"Relation Networks for Object Detection\", by Hu et al, CVPR 2018 and references therein. ", "title": "Interesting results on object detection for overlapping objects and CAPTCHA toy problem, but key details seem unclear", "rating": "3: Clear rejection", "confidence": "3: The reviewer is fairly confident that the evaluation is correct"}, "r1x0cUg5nm": {"type": "review", "replyto": "rJVoEiCqKQ", "review": "This paper looks to predict \"unstructured\" set output data. It extends Rezatofighi et al 2018 by modeling a latent permutation.\n\nUnfortunately, there is a bit of an identity crisis happening in this paper. There are several choices that do not follow based on the data the paper considers. \n1) The paper claims to want to predict unordered sets, yet the model is clearly indicating a dependence in the order of the outputs and the input p_m(\\pi | x_i, w) (1); this feels like a very odd choice to me. The outputs are either unordered sets, where you would have a permutation invariant (or exchangeable) likelihood, or they are ordered sequence where the order of the outputs does matter, as some are more likely than others.\n2) The paper still makes very odd choices even if one ignores the above and wants to model some orderings as more likely than others. The way the permutation, or the order of the data, accounts in the likelihood (2) does not make sense. Conditioned on the permutation of the set, the points are exchangeable. Let's just consider a 2 element \"set\" at the moment Y = (y_1, y_2). Order matters, so either this is being observed as pi=(1, 2) or pi=(2, 1), both of which depend on the input x. However, the likelihood of the points does not actually depend on the order in any traditional sense of the word. we have:\np_\\pi((1, 2) | x, w) p_y(y_1 |  x, w, (1, 2)) p_y(y_2 |  x, w, (1, 2)) + p_\\pi((2, 1) | x, w) p_y(y_1 |  x, w, (2, 1)) p_y(y_2 |  x, w, (2, 1))\n*Note that in here (as in eq. 2) the output distribution p_y does not know what the index is of what it is outputting, since it is iid.* So what does this mean? It means that the order (permutation) can only affect the distribution in an iid (exchangeable, order invariant) way. Essentially the paper has just written a mixture model for the output points where there are as many components as permutations. I don't think this makes much sense, and if it was an intentional choice, the paper did a poor job of indicating it.\n3) Supposing even still that one does want a mixture model with as many components as permutations, there are still some issues. It is very unclear how the dependence on \\pi drops out when getting a MAP estimate of outputs in section 3.3. This needs to be justified.\n\nThere are some stylistic shortcomings as well. For example, the related works paper would read better if it wasn't one long block (i.e. break it into several paragraphs). Also, the paper claims that it will use a super script m to denote a known cardinality, yet omits \\mathcal{Y}_i^{m_i} in the training set of the first sentence in 3.1. But these and other points are minor.\n\nThe paper should not be published until it can resolve or make sense of the methodological discrepancies between what it says it looks to do and what it actually does as described in points 1), 2), and 3) above.", "title": "Lacks clarity of methodology.", "rating": "3: Clear rejection", "confidence": "4: The reviewer is confident but not absolutely certain that the evaluation is correct"}}}