{"paper": {"title": "Variational inference for diffusion modulated Cox processes", "authors": ["Prateek Jaiswal", "Harsha Honnappa", "Vinayak Rao"], "authorids": ["~Prateek_Jaiswal1", "~Harsha_Honnappa1", "~Vinayak_Rao1"], "summary": "This paper proposes a variational inference method for computing an approximate smoothing posterior path measure of a Cox process with intensity as a solution to a stochastic differential equation.", "abstract": "This paper proposes a stochastic variational inference (SVI) method for computing an approximate posterior path measure of a Cox process. These processes are widely used in natural and physical sciences, engineering and operations research, and represent a non-trivial model of a wide array of phenomena. In our work, we model the stochastic intensity as the solution of a diffusion stochastic differential equation (SDE), and our objective is to infer the posterior, or smoothing, measure over the paths given Poisson process realizations. We first derive a system of stochastic partial differential equations (SPDE) for the pathwise smoothing posterior density function, a non-trivial result, since the standard solution of SPDEs typically involves an It\\^o stochastic integral, which is not defined pathwise. Next, we propose an SVI approach to approximating the solution of the system. We parametrize the class of approximate smoothing posteriors using a neural network, derive a lower bound on the evidence of the observed point process sample-path, and optimize the lower bound using stochastic gradient descent (SGD). We demonstrate the efficacy of our method on both synthetic and real-world problems, and demonstrate the advantage of the neural network solution over standard numerical solvers.", "keywords": ["Cox process", "variational inference", "stochastic differential equation", "smoothing posterior density"]}, "meta": {"decision": "Reject", "comment": "The paper presents a stochastic variational inference method for posterior estimation in a Cox process with intensity given by the solution to a diffusion stochastic differential equation. The reviewers highlight the novelty of the approach. Some of the concerns with regards to clarity have been addressed by the authors satisfactorily. \n\nHowever, an important issue of the approach is that of estimating model parameters, which the authors do not address explicitly by simply referring to that as the task of the modeller. I believe this is an important issue and, although some of the parameters can be estimated along with the neural network parameters, this has not been shown empirically. Along a similar vein, the paper only presents results on a single real dataset (the bike-sharing dataset), which questions the applicability of the approach and no other baseline method is presented. At the very least, the authors should have provided an objective evaluation to other doubly stochastic point process models, e.g. based on Gaussian processes, where modern stochastic variational inference algorithms have been presented. \n"}, "review": {"6um-uRxyGxd": {"type": "rebuttal", "replyto": "gushUQKdu19", "comment": "We agree that often, the functions $b(\\cdot), \\sigma(\\cdot)$ and $h(\\cdot)$ are known only up to an unknown parameter (say $\\theta$) that needs to be learnt in a data-driven manner. Learning the parameters of $h$ and $b$ is relatively straightforward, they can be learnt along with the neural network weights using stochastic gradient descent. Learning the parameters of $\\sigma$ presents a slightly greater challenge since the path measures for different settings of $\\sigma$ are singular. Learning this is a topic for future research. We have added a paragraph before Sec 5.2 on page 8 in the updated draft to clarify more on this point.", "title": "Thank you for your comment"}, "xZHOtFZSujK": {"type": "rebuttal", "replyto": "keGz9unhkJE", "comment": "Please find our response  to your questions/comments below:\n\n##### Major points\n1. It is not clear how equation (13) is a .......be nice here. \\\nR. Thank you for your comments. You are correct in pointing out that the class of measures induced by (13), denoted as $\\mathcal{Q}$$\\bar b$, cannot be a subset of the measures induced by the SDE in (2); and we are also not claiming this, as this is false. In the sentence above eq (13), we say that $\\mathcal{Q}_{\\bar b}$ is a subset of all absolutely continuous measure with respect to $\\Pi_0$, which is a larger class of measures that also includes $\\Pi_0$. Since the measure induced by SDE (13) is absolutely continuous with respect to $\\Pi_0$, therefore it is also included in set $\\mathcal{P}(\\mathcal{C})$. We have updated the paragraph after eq. (13) to clarify this fact.\n2. The proposed framework requires to ...... in more detail.\\\nR. Thank you for your comments. $b(\\cdot)$,  $\\sigma(\\cdot)$, and $h(\\cdot)$ are the parameters of the model. Setting parameters is the task of the modeler, while our focus is mostly on inference given the model. In the interest of clarity, we decided not to include learning these in our paper. Instead, we heuristically set $\\sigma(x)$ to $1.1$ in the Bike sharing experiment as the count observations had higher variance than the first experiment as evident from the last plots in Figures 1 and 2 respectively. Moreover, we should point out that the target drift is not $b$, but in fact the target is the intractable drift derived for the smoothing SDE in eq. (11). \n3. Similarly to the previous points,.......explain why?\\\nR. Please refer to our response above.\n\n##### Minor points\nThank you for pointing these minor but important errors. We have corrected all of them in the revised paper.\n\nR1. We have added an original reference. (page 1)\\\nR2. Removed 'that'. (page 2, para 4, line  2)\\\nR3. Defined VBSP (page 2, para 4, line  4)\\\nR4. Corrected: 'Wiener' . (line 2 after eq.(2))\\\nR5. Definition of $\\mathbb{E}^{\\dagger}$ added. (line 2 after eq.(3)) \\\nR6. We have added the definition of the Indicator function. (line 1 after eq.(4))\\\nR7. This is a typo, it should be $\\bar v_t(x)$. We have corrected it. (line 1 on page 4) \\\nR8. Corrected reference to $h(\\cdot)$. (line 1 after eq.(6))\\\nR9. We have used two separate notations now $f$ and $F$. (line 1 after eq.(7))\\\nR10. We have ensured that eqref is used to refer equations.\\\nR11. Defined VB. (line 1 after eq.(17))\\\nR12. Specified the class of parametric functions used in Sutter et al. (Sec 4, para 1, line 6)\\\nR13. Defined $\\Psi_t'$ . (line 5 on page 7)\n\nNote: We have uploaded the revised paper incorporating all your comments and a copy (as supplementary) with changes highlighted in blue.", "title": "Thank you for your comments and positive feedback."}, "ObdL0M4CSQy": {"type": "rebuttal", "replyto": "BpJCfvKaThx", "comment": "We have uploaded the revised paper incorporating all the comments and a copy (as supplementary) with changes highlighted in blue. Please let us know if you have any questions or comments.", "title": "Thank you for your positive comments about our work. "}, "3S9O1xujXTc": {"type": "rebuttal", "replyto": "BL6joWsS59", "comment": "Please find our response below:\n1.  Sometimes...... $\\mathbb{E}$ and E, $\\mathbb{R}$ and R \\\nR. Thank you for pointing this out. We have gone through all the notations and ensured that they all are consistent. \n\n2. The definition of some of the notations ........ about the process? \\\nR.  Yes your understanding is correct. Precisely, by $\\(\\mathbb{E}[x_t|N_{0,T}]\\)$, we mean $\\(\\mathbb{E}[x_t| \\sigma(\\mathbf{N}_u,0\\leq u \\leq T ) ]\\)$, where  $\\sigma(\\mathbf{N}_u,0\\leq u \\leq T) $ is the smallest sigma algebra generated by count observations from time 0 to $T$. We have added a sentence after eq. (3) to explain this fact.\n3. Besides, please give a brief ....... Cox process.\\\nR.  We have added a paragraph on page 3 to briefly introduce smoothing posterior with additional references. Moreover on page 3, we have also added examples with references to illustrate the importance of diffusion modulated Cox processes in modeling various service and biological systems.\n4. Please discuss the ...... is false.\\\nR. Thank you for pointing this typo out. We meant that ‘h’ cannot be an identity function. We have fixed that statement. Moreover, the intensity function has to be non-negative as per the definition of the Cox process, therefore mapping $h$ has to be non-negative. We have added a sentence after eq. (1) for clarity.\n\nNote: We have uploaded the revised paper incorporating all your comments and a copy (as supplementary) with changes highlighted in blue. ", "title": "Thank you for your valuable comments."}, "keGz9unhkJE": {"type": "review", "replyto": "snaT4xewUfX", "review": "The paper under review proposes a variational inference procedure for a specific class of Cox processes whose intensity is derived from a stochastic differential equation. The methodology relies on a restriction of candidate solutions the the subset for which the drift depends on $x_t$, $N_t$ and $t$; the drift is then modelled with a neural network. By simulating from the candidate model, a sample average approximation of the ELBO is used to compute a stochastic gradient descent algorithm, optimize the bound and thus estimate non-parametrically the drift.\n\nThe paper is clear and well written with original and significant contribution. The paper would benefit from clarifications about the following points:\n\n\n## Major points\n* It is not clear how equation (13) is a subset of the solution of (2) in general more parameters implies more degree of freedom and thus the drift in (13) could look more general than $b(x)$ (the use the $\\bar{b}$ notation suggesting it refers more to (11) than (2)). This probably comes from the fact that all variables are indexed by $t$ but more details would be nice here.\n* The proposed framework requires to specify both $b$ and $\\sigma$ a priori. It would be nice to explain what is the impact and restrictions of doing so. For instance, the first experiment set $\\sigma$ to $1$ and the second to $1.1$ without further justification. Could the author(s) elaborate(s) on this point? Similarly, the authors use a very flexible model (NN) for $\\bar{b}$, so the main restriction comes from the choice of the `target' $b$: the impact of this choice should be discussed in more detail.\n* Similarly to the previous points, in the methodology, the link function $h$ must be set a priori (and its uncertainty is not taken into account). Would it be possible to have an inference methodology estimating not only the drift but also $h$ (and $\\sigma$?) at the same time? If not, is it possible to explain why?\n\n\n## Minor points\n* p.1 l.1: the reference for Cox processes is not the 'original' work.\n* p.2: 'in particular, we show that...' either 'that' or 'how'.\n* p.2: VBSP has never been defined at this stage of the paper.\n* p.3: Wiener.\n* p.3: the notation $\\mathbb{E}^\\dagger$ is undefined.\n* p.3: defined the indicator function that you are using.\n* p.3: shouldn't the $x$ in the definition of $\\bar{v}(x_t)$ be bold?\n* p.3: which 'section'? Simply 'above'?\n* p.3: $f$ denotes first bounded measureable functions and then twice-differentiable ... Use two different notation to avoid confusion.\n* In general, use eqref for equations.\n* p.5: We call $Q^\\star$ as the VB ... Defined the meaning of VB.\n* p.5: specify the class of parametric functions used in Sutter et al.\n* p.6: the notation $\\psi_t'$ is not defined. The link with equation (13) could be made clearer.", "title": "The paper is clear and well written with original and significant contribution.", "rating": "7: Good paper, accept", "confidence": "3: The reviewer is fairly confident that the evaluation is correct"}, "BpJCfvKaThx": {"type": "review", "replyto": "snaT4xewUfX", "review": "The paper provides a stochastic variational inference method for\napproximating posterior path measures for doubly-stochastic Poisson processes\nconditioned on realisations of paths of the Poisson process. The intensity\nprocess is modelled as the solution to a diffusion stochastic differential\nequation. The authors compare their method experimentally to the numerical\nsolution of the associated system of stochastic partial differential\nequations using the finite element method.\n\nThe paper, although technically difficult, is well written and clearly\npresented. While I cannot validate the mathematical content in detail, the\npaper seems technically correct. It deals with a well-defined problem in a\ndifficult mathematical setting. \n\nThe idea of using variational inference for approximating the smoothing\nposterior density seems well-founded. The method is experimentally validated\non simulated and real data.\n\nIn summary, though my knowledge of point process theory is not sufficient to\nevaluate all aspects of the paper in detail, I find the paper to be a solid\ncontribution worthy of publication at ICLR.", "title": "Solid contribution on point processes and variational inference", "rating": "7: Good paper, accept", "confidence": "2: The reviewer is willing to defend the evaluation, but it is quite likely that the reviewer did not understand central parts of the paper"}, "BL6joWsS59": {"type": "review", "replyto": "snaT4xewUfX", "review": "This paper proposes an interesting point process named diffusion modulated cox processes, which generalizes the stochastic intensity to a stochastic differential equation. The variational inference method looks sound. \n\nPros:\n+ The generalization of SDE-type intensity is novel. The proposed stochastic variational inference makes sense. Especially the neural network solution is meaningful and will have an impact on the learning of point processes. \n+ Good empirical performance and analysis. \n\nCons:\n- I strongly recommend the authors to further improve the presentation of the current draft. Sometimes the notations are not consistent, like $\\mathbb{E}$ and $E$, $\\mathbb{R}$ and $R$. The definition of some of the notations are not very clear, such as Eq(3), what is the definition of the conditional expectation? Is it the expectation of the intensity function given all the information about the process?  Besides, please give a brief introduction of the mathematical background, such as the smoothing posterior. It would also be better if the authors can give some examples to illustrate the advantages of the proposed diffusion modulated cox process.\n- Please discuss the influence of the non-negativity of the intensity function. The paper claims that $h$ is non-negative and thus can be an identity function, which is false.", "title": "The idea of the SDE-modulated cox is interesting, but the writing needs to be improved.", "rating": "6: Marginally above acceptance threshold", "confidence": "3: The reviewer is fairly confident that the evaluation is correct"}}}