{"paper": {"title": "Fast Partial Fourier Transform", "authors": ["Yong-chan Park", "Jun-Gi Jang", "U Kang"], "authorids": ["~Yong-chan_Park1", "~Jun-Gi_Jang1", "~U_Kang1"], "summary": "We propose a fast Partial Fourier Transform (PFT),  an efficient algorithm for computing only a part of Fourier coefficients. ", "abstract": "Given a time-series vector, how can we efficiently compute a specified part of Fourier coefficients? Fast Fourier transform (FFT) is a widely used algorithm that computes the discrete Fourier transform in many machine learning applications. Despite the pervasive use, FFT algorithms do not provide a fine-tuning option for the user to specify one’s demand, that is, the output size (the number of Fourier coefficients to be computed) is algorithmically determined by the input size. Such a lack of flexibility is often followed by just discarding the unused coefficients because many applications do not require the whole spectrum of the frequency domain, resulting in an inefficiency due to the extra computation. \nIn this paper, we propose a fast Partial Fourier Transform (PFT), an efficient algorithm for computing only a part of Fourier coefficients. PFT approximates a part of twiddle factors (trigonometric constants) using polynomials, thereby reducing the computational complexity due to the mixture of many twiddle factors. We derive the asymptotic time complexity of PFT with respect to input and output sizes, as well as its numerical accuracy. Experimental results show that PFT outperforms the current state-of-the-art algorithms, with an order of magnitude of speedup for sufficiently small output sizes without sacrificing accuracy.", "keywords": ["Fourier transform", "time series", "signal processing", "anomaly detection", "machine learning"]}, "meta": {"decision": "Reject", "comment": "The major complaint about this paper was the lack of a proper comparison to previous work, both theoretically and empirically. Also, a study of the tradeoff between the accuracy and running time would significantly help this paper. Ultimately these were the main reasons for deciding to not accept the paper. The reviewers did think the algorithm was new and interesting, and so hopefully by addressing the complaints above, a future version of the paper could be more influential."}, "review": {"5c_lkFdvl7": {"type": "review", "replyto": "SXoheAR0Gz", "review": "The paper presents a fast approximate algorithm for partial discrete Fourier transform. Given the input signal $a_0...a_N$ in the time domain the algorithm approximately computes the first $O(M)$ frequencies. The running time is $O(r (N + M \\log M))$, where $r$ a parameter that controls the accuracy of the output. The algorithm itself proceeds by applying polynomial approximation to the twiddle coefficients in FFT, which makes it possible to reduce the running time.\n\nPros:\n+ Well-motivated problem: in many applications, most of the signal energy is present in the first few coefficients  and this algorithm computes them faster (albeit approximately)\n+ To the best of my knowledge the algorithm is new, although cannot tell for sure given a large body of prior work on this topic (see below)\n+ Experimental evaluation shows one order of magnitude improvement in the running time, while keeping the relative error to $10^{-6}$.\n\nCons:\n- The papers omits a significant body of prior work on computing the first few DFT coefficients faster. For example:\n  * Pruned FFT: the algorithm evaluates the first M coefficients in O(N log M) time; here, the results are *exact*. See e.g., http://www.fftw.org/pruned.html\n  * Subband FFT: this method is approximate; see e.g., these papers:\nSubband DFT—part II: accuracy, complexity and applications, AN Hossen, U Heute, OV Shentov, SK Mitra - Signal Processing, 1995 - Elsevier\n Subband DFT—Part I: Definition, interpretation and extensions, OV Shentov, SK Mitra, U Heute, AN Hossen - Signal Processing, 1995 - Elsevier\n Subband DFT-interpretation, accuracy, and computational complexity, OV Shentov, AN Hossen, SK Mitra… - Conference Record of the …, 1991 - computer.org\n\n  There are also other methods cited in those articles. \n\n- I could not find any analysis of the trade-off between the accuracy and the values of parameters r and p. As a result, it is not clear what the runtime dependence on those parameters is. \n\nThe above two points make it impossible to compare the proposed algorithm relative to what was known before, either in theory or in practice. \n\nAdditional comments:\n- One can  assume (essentially) without loss of generality that the target frequencies lie in the interval centered at zero (i.e., that $\\mu$ is zero), as otherwise one can use Shift Theorem to shift the frequencies by multiplying each coefficient of the time signal by a phase term. This should simplify the presentation.\n\n\nOverall: the paper has interesting (and potentially very useful) ideas. However, it needs a very substantial rewrite, as per the comments above. \n", "title": "Neat algorithm, but comparison to prior work highly incomplete", "rating": "5: Marginally below acceptance threshold", "confidence": "4: The reviewer is confident but not absolutely certain that the evaluation is correct"}, "Qb1Vl4OB3MZ": {"type": "review", "replyto": "SXoheAR0Gz", "review": "The paper suggests a method for quickly computing a \"partial Fourier transform\", which basically means that we want only a small range of output frequencies.  The main technique is an approximation of so called \"twiddle functions\" (which are basically trigonometric functions, or, exponents of complex units if viewed in the complex plane) using polynomials.   The resulting algorithms run in time O(N + M log M) where M is the size of the required frequency range, and N is the input.  This should be compared with Cooley and Tukey's FFT, which is O(N log N).  In fact, the main idea in the paper uses Cooley and Tukey's decomposition of the expression for Fourier transform.\n\nThe first thing I must note is, that the authors seem not to be aware of existing literature on partial Fourier transforms.  For example, Ailon and Liberty show in their paper [1] that whenever you are only interested in M Fourier frequencies then you can do exact FFT in time O(N log M).  This is done by pruning Cooley Tukey's FFT.  It is not as good as O(N + M log M), but it is EXACT, and it doesn't require the M frequencies to be in a single consecutive range.  (In fact, [1] does this for the Hadamard transform, but I am quite certain that it works for the DFT as well because the argument depends on the computational graph only, which is identical for both cases).  \n\nAdditionally, Indyk et al have written many papers on fast computation of Fourier when you know a priori that only M frequencies are nonzeros (and the rest are 0).  This setting is different from the one in this paper, but it is definitely relevant.\n\nFinally, I am inclined to say that the subject of this paper is only loosely related to the scope if ICLR.  I mean, computing Fourier coefficients is definitely a way to get a useful representation of the data, but I don't know if ICLR is the correct venue for this kind of paper.\n\nOtherwise, the paper is well written, and I assume it is correct.\n\n[1] Ailon, Liberty, \"Fast Dimension Reduction Using Rademacher Series on Dual BCH Codes. \" (Discrete and Computational Geometry, 2009)\n\n", "title": "An algorithm for quickly approximating partial Fourier transforms", "rating": "5: Marginally below acceptance threshold", "confidence": "3: The reviewer is fairly confident that the evaluation is correct"}, "oScY2eGTjpO": {"type": "rebuttal", "replyto": "5c_lkFdvl7", "comment": "We would like to thank you for high quality review and constructive comments.\n\n**Comparison with existing methods**\n\nAs the reviewer mentioned, we added the discussion of various existing methods including Pruned FFT and Subband DFT in Section 2 of the revised paper. Additionally, we added the Goertzel algorithm which is one of the first methods devised for evaluating a part of Fourier coefficients in the same section. In the discussion, we showed that PFT outperforms the Goertzel algorithm, which demonstrates the benefits of our proposed method. Moreover, we added the experimental comparison between PFT and Pruned FFT in Section 4.2 of the revised paper. Figures 1(a), 1(b), and 2(a) of the revised paper show that PFT outperforms Pruned FFT, significantly extending the range of output sizes for which partial Fourier transform becomes practical.\n\n**Exact or approximate?**\n\nThe reviewer pointed out that Pruned FFT is exact, while our method is approximate. We claim that, in terms of practical use, the approximate algorithm is the more advantageous one as long as it provides the option to set an arbitrary approximation error bound. Indeed, the Fourier coefficients can be evaluated to arbitrary numerical precision with PFT by changing hyper-parameters, providing more versatility than the exact algorithm. Also, in the experiments in Section 4.2 of the revised paper, PFT was set to the same precision (<$10^{-6}$) as Pruned FFT, and showed up to 19 times faster running time than Pruned FFT. Therefore, one can reasonably argue that it is not a problem that PFT is approximate.\n\n**Trade-off between accuracy and runtime**\n\nAs the reviewer mentioned, we added the experimental results concerning the trade-off between accuracy and runtime of PFT in Section 4.4 of the revised paper. The results show that the runtime of PFT is reduced by up to 17% and 27% as the accuracy goal changes from $10^{-6}$ to $10^{-4}$ and $10^{-2}$, respectively.\n\n**The reason why PFT does not use Shift Theorem**\n\nThe reviewer also pointed out in the additional comments that one can assume essentially without loss of generality that the target range is centered at zero with the help of Shift Theorem, which is true. However, as we had already mentioned in the lines 5-12 of Section 3.3 of the original paper (also lines 5-12 of Section 3.3 of the revised paper), the technique requires extra $N$ (the input size) complex multiplications. By using our proposed method, one can bypass the extra computations during the run-time.\n\n\n", "title": "Response to AnonReviewer4"}, "bvPOePUfhpt": {"type": "rebuttal", "replyto": "Qb1Vl4OB3MZ", "comment": "We would like to thank you for high quality review and constructive comments.\n\n**Comparison with existing works**\n\nAs the reviewer mentioned, we added the discussion of various existing works including Goertzel algorithm, Subband DFT, Pruned FFT, and Sparse Fourier transform in Section 2 of the revised paper. Moreover, we also added the experimental comparison between PFT and Pruned FFT in Section 4.2 of the revised paper. Figures 1(a), 1(b), and 2(a) of the revised paper show that PFT outperforms Pruned FFT, significantly extending the range of output sizes for which partial Fourier transform becomes practical.\n\n**Exact or approximate?**\n\nThe reviewer pointed out that Pruned FFT is exact, while our method is approximate. We claim that, in terms of practical use, the approximate algorithm is the more advantageous one as long as it provides the option to set an arbitrary approximation error bound. Indeed, the Fourier coefficients can be evaluated to arbitrary numerical precision with PFT by changing hyper-parameters, providing more versatility than the exact algorithm. Also, in the experiments in Section 4.2 of the revised paper, PFT was set to the same precision ($<10^{-6}$) as Pruned FFT, and showed up to 19 times faster running time than Pruned FFT. Therefore, one can reasonably argue that it is not a problem that PFT is approximate.\n\n**Consecutiveness constraint**\n\nThe reviewer also pointed out that Pruned FFT does not require the output to be a single consecutive range, while PFT does. In most practical use cases, however, it is a consecutive low-frequency range where we are interested in. Besides, PFT can be used multiple times for distinct target ranges to compute the coefficients in a non-consecutive range. Thus, we argue that the reviewer’s point is not of much concern in terms of practical use.\n\n**Scope of the paper**\n\nMany papers presented in learning conferences, like ICML, CVPR, and KDD, exploit Fast Fourier transform (FFT). Our proposed approach, PFT, allows one to improve the performance (e.g., efficiency) of those existing learning approaches. Moreover, PFT will continue to support various research projects that suffer from the inefficiency of FFT. Therefore, we are confident that many ICLR audiences will be interested in PFT. The following references utilize FFT:\n- [1] Frank et al. Leveraging Frequency Analysis for Deep Fake Image Recognition, ICML 2020, https://arxiv.org/pdf/2003.08685.pdf\n- [2] Li et al. FALCON: A Fourier Transform Based Approach for Fast and Secure Convolutional Neural Network Predictions, CVPR 2020, https://openaccess.thecvf.com/content_CVPR_2020/papers/Li_FALCON_A_Fourier_Transform_Based_Approach_for_Fast_and_Secure_CVPR_2020_paper.pdf\n- [3] Yanchao Yang and Stefano Soatto. FDA: Fourier Domain Adaptation for Semantic Segmentation, CVPR 2020, https://openaccess.thecvf.com/content_CVPR_2020/papers/Yang_FDA_Fourier_Domain_Adaptation_for_Semantic_Segmentation_CVPR_2020_paper.pdf\n- [4] Chen et al. Compressing Convolutional Neural Networks in the Frequency Domain, KDD 2016, https://www.kdd.org/kdd2016/papers/files/rpp0534-chenA.pdf\n", "title": "Response to AnonReviewer3"}, "4DW4erLdhoN": {"type": "rebuttal", "replyto": "APlRKoYyXAm", "comment": "We would like to thank you for high quality review and constructive comments.\n\n**Comparison with Goertzel algorithm**\n\nAs the reviewer mentioned, we added the discussion of PFT compared to the Goertzel algorithm both theoretically and experimentally in the second paragraph of Section 2 of the revised paper. In the discussion, we showed that PFT outperforms the Goertzel algorithm significantly, which demonstrates the benefits of our proposed algorithm.\n\n**Scope of the paper**\n\nMany papers presented in learning conferences, like ICML, CVPR, and KDD, exploit Fast Fourier transform (FFT). Our proposed approach, PFT, allows one to improve the performance (e.g., efficiency) of those existing learning approaches. Moreover, PFT will continue to support various research projects that suffer from the inefficiency of FFT. Therefore, we are confident that many ICLR audiences will be interested in PFT. The following references utilize FFT:\n- [1] Frank et al. Leveraging Frequency Analysis for Deep Fake Image Recognition, ICML 2020, https://arxiv.org/pdf/2003.08685.pdf\n- [2] Li et al. FALCON: A Fourier Transform Based Approach for Fast and Secure Convolutional Neural Network Predictions, CVPR 2020, https://openaccess.thecvf.com/content_CVPR_2020/papers/Li_FALCON_A_Fourier_Transform_Based_Approach_for_Fast_and_Secure_CVPR_2020_paper.pdf\n- [3] Yanchao Yang and Stefano Soatto. FDA: Fourier Domain Adaptation for Semantic Segmentation, CVPR 2020, https://openaccess.thecvf.com/content_CVPR_2020/papers/Yang_FDA_Fourier_Domain_Adaptation_for_Semantic_Segmentation_CVPR_2020_paper.pdf\n- [4] Chen et al. Compressing Convolutional Neural Networks in the Frequency Domain, KDD 2016, https://www.kdd.org/kdd2016/papers/files/rpp0534-chenA.pdf\n", "title": "Response to AnonReviewer1"}, "APlRKoYyXAm": {"type": "review", "replyto": "SXoheAR0Gz", "review": "Overall this is an interesting paper. The paper proposes a few approximations in the computation of the DFT that enable to compute the DTFT of a signal at uniform grid of 2M+1 frequency points around a certain midpoint $\\mu$. While this is easy and straightforward using the direct computation or Goertzel's algorithm, these have complexity O(NM). While I did not check the math fully for correctness, the development appears correct. \n\nHaving said that, the paper completely discounts fair comparisons with the Goertzel algorithm. When M is small compared to N ($o(\\log N)$), complexity of O(NM) is not much of a problem, and Goertzel's algorithm has very favorable hidden constants and is exact. If M is $O(N)$ then the proposed approach has the same complexity with the FFT, which is also exact and has favorable constants. A discussion and an experimental study of the performance of the method compared to the Goertzel algorithm or the direct implementation would demonstrate the benefits of the algorithm.\n\nMy main objection to this paper is one of scope. I do not see how the paper fits in learning conference. It would be a much better fit in a signal processing conference/journal or in a theoretical computer science one. ", "title": "Interesting paper, but out of scope", "rating": "6: Marginally above acceptance threshold", "confidence": "5: The reviewer is absolutely certain that the evaluation is correct and very familiar with the relevant literature"}}}